{
    "https://carsandbids.com/auctions/KYD6QgX0/2016-chevrolet-corvette-z06-callaway-sc757-coupe": {
        "auction_title": "2016 Chevrolet Corvette Z06 Callaway SC757 Coupe",
        "auction_subtitle": "~11,900 Miles, 7-Speed Manual, 757-hp Supercharged V8",
        "auction_quick_facts": {
            "Make": "Chevrolet",
            "Model": "Corvette\nSave",
            "Mileage": "11,900",
            "VIN": "1G1YT2D63G5600263",
            "Title Status": "Clean (SC)",
            "Location": "Summerville, SC 29486",
            "Seller": "JHusted",
            "Engine": "6.2L Supercharged V8",
            "Drivetrain": "Rear-wheel drive",
            "Transmission": "Manual (7-Speed)",
            "Body Style": "Coupe",
            "Exterior Color": "Laguna Blue",
            "Interior Color": "Jet Black",
            "Seller Type": "Private Party"
        },
        "dougs_take": "Wow! The Corvette Callaway SC757 Coupe is nothing short of an insanely powerful sports car that surely offers up a truly fantastic driving experience, and I'm excited to have our first one on Cars & Bids! Based on the C7 Chevy Corvette, this particular example is finished in gorgeous Laguna Blue – and it's equipped with a massive supercharged V8 that generates 757 horsepower and 777 lb-ft of torque, which gives lightning-fast acceleration through the 7-speed manual transmission. Handling and grip are also superb, thanks to the adjustable suspension system and massive brakes. This impressive Callaway SC757 also shows less than 12,000 miles, and it's offered with a clean, accident-free Carfax report, for added peace of mind.\u007f",
        "auction_highlights": [
            "The odometer currently indicates approximately 11,900 miles.",
            "The attached Carfax history report indicates no accidents or mileage discrepancies.",
            "Equipment includes the 3LZ Premium Equipment Group, 19-inch front and 20-inch rear alloy wheels, a Callaway cold-air intake system and 2.3-liter supercharger, a Callaway AeroSurround hood and sport exhaust system, a head-up display, dual-zone automatic climate control, and more as detailed below.",
            "Callaway is well-known for taking powerful sports cars further than the original manufacturer ever dreamed, and the SC757 Coupe is no exception. This $18,000 Callaway package is pure power and performance, with only subtle visual exterior clues as to what lies beneath. In addition to the extra muscle, all the comfort and amenities from Chevrolet are still present, which is a big benefit for those interested in daily driving duties.",
            "Power comes from a 6.2-liter supercharged V8, rated at 757 horsepower and 777 lb-ft of torque. Output is sent to the rear wheels through a 7-speed manual transmission."
        ],
        "auction_equipment": [
            "3LZ Premium Equipment Group (memory package, seat adjusters, Nappa leather Competition sport seats with power lumbar and power bolsters, heated side mirrors, auto-dimming rear-view mirror, suede microfiber-wrapped upper trim package, leather-wrapped instrument panel and doors, heated and ventilated seats, premium audio system with surround sound, performance data and video recorder with navigation, front curb view cameras)",
            "19-inch front, 20-inch rear alloy wheels",
            "Callaway cold-air intake system",
            "Callaway 2.3-liter supercharger",
            "Callaway carbon fiber engine covers",
            "Callaway AeroSurround hood",
            "Carbon Flash exterior trim and badging",
            "Callaway sport exhaust system",
            "Callaway short-throw shifter",
            "Callaway interior badging",
            "Head-up display",
            "Dual-zone automatic climate control"
        ],
        "modifications": [],
        "known_flaws": [],
        "services": [
            "July 2022 (11,009 miles): Safety inspection performed, emissions test performed, engine oil and filter changed, 2 tires mounted and balanced",
            "June 2021 (10,671 miles): Vehicle serviced, maintenance inspection completed, safety inspection performed, engine oil and filter changed, emissions inspection performed",
            "June 2020 (10,290 miles): Vehicle serviced, maintenance inspection completed, engine oil and filter changed, emissions or safety inspection performed",
            "July 2019 (10,036 miles): Vehicle serviced, engine oil and filter changed, 2 tires mounted and balanced"
        ],
        "included_items": [
            "2 key fobs",
            "Build sheet",
            "Factory Stage 1 spoiler end panels"
        ],
        "ownership_history": "The seller states that they purchased this Corvette in August 2022.",
        "auction_stats": {
            "reserve_status": "Reserve",
            "auction_status": "Reserve not met, bid to",
            "highest_bid_value": "$72,277",
            "auction_date": "Feb 18, 2023 12:34 AM",
            "view_count": "12,854",
            "bid_count": "14",
            "bids": [
                "$72,277",
                "$71,777",
                "$71,000",
                "$70,000",
                "$69,500",
                "$68,500",
                "$68,000",
                "$67,500"
            ]
        }
    }
}