{
    "https://carsandbids.com/auctions/9AEEpL0P/2015-bmw-m5-competition-package": {
        "auction_title": "2015 BMW M5 Competition Package",
        "auction_subtitle": "~38,200 Miles, Singapore Grey, Executive Package, California-Owned",
        "auction_quick_facts": {
            "Make": "BMW",
            "Model": "M5\nSave",
            "Mileage": "38,200",
            "VIN": "WBSFV9C50FD594168",
            "Title Status": "Clean (CA)",
            "Location": "Richmond, CA 94804",
            "Seller": "ee43770",
            "Engine": "4.4L Turbocharged V8",
            "Drivetrain": "Rear-wheel drive",
            "Transmission": "Automatic (7-Speed)",
            "Body Style": "Sedan",
            "Exterior Color": "Singapore Grey Metallic",
            "Interior Color": "Black",
            "Seller Type": "Private Party"
        },
        "dougs_take": "The F10 BMW M5 is a true do-it-all sports sedan. It touts an excellent balance of attractive styling, great performance, and modern technology, making the F10 a favorite among enthusiasts – myself included. This particular F10 M5 touts some highly desirable factory equipment, including the Competition and Executive packages, Driver Assistance Plus, and a Bang & Olufsen sound system. Its relatively low mileage and minimal modifications further enhance the appeal – AND it boasts a clean, accident-free Carfax report with California-only ownership.",
        "auction_highlights": [
            "The odometer displays approximately 38,200 miles.",
            "The attached Carfax vehicle history report lists no accidents or mileage discrepancies in this BMW's past. It also confirms that this M5 has been registered in California since new.",
            "Factory equipment includes Competition, Driver Assistance Plus, and Executive packages, Merino leather upholstery, heated and power-adjustable front seats, a Bang & Olufsen sound system, and a navigation system, among others listed below.",
            "Modifications reported by the seller include black kidney grilles, paint protection film on the front end, black side grilles, and window tint.",
            "BMW launched the fifth-generation M5 globally in 2011. It was based on the F10-generation 5 Series, and it swapped its predecessor's naturally-aspirated V10 for a turbocharged V8, though it offered enthusiasts a generous bump in horsepower and torque. This M5 was also considerably more high-tech than its predecessor, but BMW M engineers went out of their way to ensure the electronics didn't dilute the driving experience.",
            "Power comes from a turbocharged \"S63\" 4.4-liter V8, rated at 575 horsepower and 500 lb-ft of torque. Output is sent to the rear wheels via a 7-speed dual-clutch automatic transmission."
        ],
        "auction_equipment": [
            "Competition Package (20-inch Style 343M wheels, engine output increased to 575 horsepower, firmer suspension system, and remapped Dynamic Stability Control system)",
            "Driver Assistance Plus (active blind spot detection, active driving assistant, side- and top-view cameras)",
            "Executive Package (power tailgate, soft-close automatic doors, rear sunshades, front ventilated seats, active front seats, heated rear seats, 4-zone climate control, adaptive full LED headlights, automatic high beams, head-up display, concierge services)",
            "Merino leather upholstery",
            "Heated and power-adjustable front seats",
            "Heated steering wheel",
            "Carbon fiber interior trim",
            "Comfort Access keyless entry",
            "Bang & Olufsen sound system",
            "Navigation system",
            "Park Distance Control (PDC)"
        ],
        "modifications": [
            "Black kidney grilles",
            "Paint protection film on the front end",
            "Black side grilles",
            "Window tint"
        ],
        "known_flaws": [
            "Rock chips on front bumper",
            "Creases on driver's seat"
        ],
        "services": [
            "March 2022 (36,317 miles): Engine oil and filter changed",
            "36,242 miles: Four tires installed",
            "October 2020 (34,379 miles): Engine oil and filter changed, brake fluid flushed"
        ],
        "included_items": [
            "2 keys",
            "Owner's manuals",
            "Window sticker",
            "Service records",
            "M5 floor mats",
            "Rubber floor mats"
        ],
        "ownership_history": "The seller purchased this M5 in December 2017 and has added approximately 13,400 miles since.",
        "auction_stats": {
            "reserve_status": "Reserve",
            "auction_status": "Sold to",
            "highest_bid_value": "$44,250",
            "auction_date": "Feb 28, 2023 12:24 AM",
            "view_count": "13,410",
            "bid_count": "54",
            "bids": [
                "$44,250",
                "$44,000",
                "$43,750",
                "$43,500",
                "$43,250",
                "$43,000",
                "$42,500",
                "$42,000",
                "$41,509",
                "$41,259",
                "$41,000",
                "$40,250",
                "$40,000",
                "$39,472",
                "$38,350",
                "$38,100",
                "$37,777",
                "$37,250",
                "$37,000",
                "$36,250",
                "$36,000",
                "$35,500",
                "$34,750",
                "$34,500",
                "$34,250",
                "$34,000",
                "$33,500",
                "$33,250",
                "$33,000",
                "$32,750",
                "$32,500",
                "$32,250",
                "$32,000",
                "$31,600",
                "$31,000",
                "$30,500",
                "$30,000",
                "$25,250",
                "$25,000",
                "$24,750",
                "$24,500",
                "$24,250",
                "$24,000",
                "$23,500",
                "$23,000",
                "$22,555",
                "$22,222",
                "$19,999",
                "$17,108",
                "$16,666",
                "$14,444",
                "$12,900",
                "$11,980",
                "$10,000"
            ]
        }
    },
    "https://carsandbids.com/auctions/3gewOqMb/2008-audi-rs4-cabriolet": {
        "auction_title": "2008 Audi RS4 Cabriolet",
        "auction_subtitle": "1 Owner, 6-Speed Manual, V8 Power, ~45,600 Miles, California-Owned",
        "auction_quick_facts": {
            "Make": "Audi",
            "Model": "RS 4\nSave",
            "Mileage": "45,600",
            "VIN": "WUAYU48H48K800229",
            "Title Status": "Clean (CA)",
            "Location": "Danville, CA 94506",
            "Seller": "RudyW",
            "Engine": "4.2L V8",
            "Drivetrain": "4WD/AWD",
            "Transmission": "Manual (6-Speed)",
            "Body Style": "Convertible",
            "Exterior Color": "Daytona Gray",
            "Interior Color": "Black",
            "Seller Type": "Private Party"
        },
        "dougs_take": "The B7 Audi RS4 is a special car, as it's the only RS4 Audi ever offered in North America – and the Cabriolet models are exceedingly rare, as Audi brought just 300 of them to our shores. This particular RS4 Cabriolet is especially desirable: it's a one-owner car that touts just 45,600 miles, it's entirely unmodified, and it boasts warm-climate California ownership from new. Plus, this RS4 comes with a clean, accident-free Carfax report – AND it benefits from some recent documented servicing, for added buyer confidence.",
        "auction_highlights": [
            "This RS4 is equipped with a 6-speed manual transmission, and its odometer currently displays about 45,600 miles.",
            "The attached Carfax history report lists no accidents or mileage discrepancies in this Audi's past. It also confirms that this is a one-owner car that's been registered in California from new.",
            "Factory equipment includes 19-inch alloy wheels, RS4-specific sport suspension, bi-xenon headlights, a power-retractable soft top, Silk Nappa leather upholstery, carbon fiber interior trim, heated front seats, a Bose premium sound system, and a navigation system. The seller reports no modifications.",
            "Audi sold the \"B7\" generation RS4 in the United States during the 2007 and 2008 model years. Offered as a sedan and as a convertible, both body styles were exclusively equipped with a 6-speed manual transmission. Audi hasn't made another RS4 available in America since, largely because the next two generations were only made as station wagons.",
            "Power comes from a 4.2-liter V8, rated at 420 horsepower and 317 lb-ft of torque. Output is sent to all four wheels via a 6-speed manual transmission and Audi's Quattro permanent all-wheel drive system."
        ],
        "auction_equipment": [
            "19-inch alloy wheels",
            "Asymmetric dynamic Quattro permanent all-wheel drive with Electronic Differential Lock (EDL)",
            "RS4-specific sport suspension with Dynamic Ride Control",
            "RS4 enhanced brakes",
            "Bi-xenon headlights with washer system",
            "Power-retractable soft top",
            "Silk Nappa leather upholstery",
            "Carbon fiber interior trim",
            "Heated and power-adjustable front seats",
            "Automatic dual-zone automatic climate control",
            "Bose premium sound system",
            "Navigation system",
            "Rear parking sensors",
            "Ski pass through"
        ],
        "modifications": [],
        "known_flaws": [
            "Stone chips on the front end",
            "Scratches on the lower front lip (pictured in the gallery)",
            "Scratches near the fuel door (pictured in the gallery)",
            "Tires bear 2017 date code",
            "Creases and wear on the driver's seat"
        ],
        "services": [
            "November 2022: Battery replaced",
            "September 2022 (44,786 miles): Convertible top motor and pump replaced, top hydraulic fluid changed",
            "April 2022 (44,446 miles): Engine oil and filter changed"
        ],
        "included_items": [
            "2 keys",
            "Owner's manual",
            "Window sticker",
            "Service records",
            "Wind screen"
        ],
        "ownership_history": "The seller purchased this RS4 new in March 2008.",
        "auction_stats": {
            "reserve_status": "Reserve",
            "auction_status": "Sold to",
            "highest_bid_value": "$43,500",
            "auction_date": "Feb 28, 2023 12:11 AM",
            "view_count": "6,651",
            "bid_count": "33",
            "bids": [
                "$43,500",
                "$43,250",
                "$43,000",
                "$42,250",
                "$42,000",
                "$40,500",
                "$40,250",
                "$40,000",
                "$39,250",
                "$39,000",
                "$38,250",
                "$38,000",
                "$36,250",
                "$36,000",
                "$35,250",
                "$35,000",
                "$33,250",
                "$33,000",
                "$32,250",
                "$32,000",
                "$30,250",
                "$30,000",
                "$26,950",
                "$26,700",
                "$26,450",
                "$26,200",
                "$25,950",
                "$25,700",
                "$25,442",
                "$25,000",
                "$17,777",
                "$14,442",
                "$10,000"
            ]
        }
    },
    "https://carsandbids.com/auctions/3yvV8YXw/2014-bmw-328d-xdrive-sports-wagon": {
        "auction_title": "2014 BMW 328d xDrive Sports Wagon",
        "auction_subtitle": "NO RESERVE Turbodiesel Power, Mineral Gray Metallic, AWD, Mostly Unmodified",
        "auction_quick_facts": {
            "Make": "BMW",
            "Model": "328d\nSave",
            "Mileage": "145,100",
            "VIN": "WBA3K5C52EKT33689",
            "Title Status": "Clean (ME)",
            "Location": "Latham, NY 12110",
            "Seller": "SignatureAutoRanch",
            "Engine": "2.0L Turbodiesel I4",
            "Drivetrain": "4WD/AWD",
            "Transmission": "Automatic (8-Speed)",
            "Body Style": "Wagon",
            "Exterior Color": "Mineral Gray Metallic",
            "Interior Color": "Black",
            "Seller Type": "Dealer"
        },
        "dougs_take": "The F31 BMW 3 Series Wagon is a favorite here at Cars & Bids, as it offers exceptional practicality and a great BMW driving experience. This particular 328d xDrive Sports Wagon touts turbodiesel power for great fuel economy, xDrive all-wheel-drive, and gorgeous Mineral Gray Metallic paint. It's also nearly unmodified, except for the addition of a useful Thule roof basket – and it comes with a clean, accident-free Carfax report, for added buyer confidence. Plus, this 328d is offered with no reserve, so someone is taking home this wagon at the end of the auction.",
        "auction_highlights": [
            "The attached Carfax history report indicates no accidents or mileage discrepancies in this BMW's past.",
            "According to the Monroney Label provided in the gallery, factory equipment includes 17-inch Style 393 wheels, fog lights, a sunroof, heated and power-adjustable front seats, wood interior trim, automatic climate control, and a CD player, among others listed below. The sole modification reported by the seller is a Thule roof basket.",
            "The F31-generation is the last 3 Series wagon sold in the United States. It was introduced in 2013 and offered through 2019. The model was sold as the 328i, powered by a 2.0-liter 4-cylinder turbo, and the 328d, powered by a turbodiesel 4-cylinder, also displacing 2.0 liters.",
            "Power for this 328d comes from an \"N47\" 2.0-liter turbodiesel inline-4, rated at 180 horsepower and 280 lb-ft of torque. Output is sent to all four wheels via an 8-speed automatic transmission."
        ],
        "auction_equipment": [
            "17-inch Style 393 wheels",
            "Fog lights",
            "Rain-sensing windshield wipers",
            "Roof rails",
            "Power-operated sunroof",
            "Heated and power-adjustable front seats",
            "Wood interior trim",
            "Leather-wrapped sport steering wheel",
            "Automatic climate control",
            "CD player"
        ],
        "modifications": [
            "Thule roof basket"
        ],
        "known_flaws": [
            "Rock chips on hood and front bumper",
            "Scuffs on front bumper",
            "Touched-up rock chips on roof and rear doors",
            "Scratches on driver's side front fender, driver's side rear door, and rear bumper",
            "Scratches on wheels",
            "Wear on driver's door card",
            "Some rust on underside components"
        ],
        "services": [
            "December 2020 (111,728 miles): Maintenance inspection completed",
            "September 2019 (98,682 miles): Brakes checked, engine oil and filter changed, tire condition and pressure checked, engine checked",
            "November 2018 (85,568 miles): Four wheel alignment performed, tire(s) balanced and rotated"
        ],
        "included_items": [
            "2 keys",
            "Owner's manual",
            "Monroney Label",
            "Floor mats",
            "Cargo cover"
        ],
        "ownership_history": "The selling dealer acquired this BMW in 2023 and has added approximately 50 miles since.",
        "auction_stats": {
            "reserve_status": "No reserve",
            "auction_status": "Sold to",
            "highest_bid_value": "$10,600",
            "auction_date": "Feb 28, 2023 12:02 AM",
            "view_count": "7,234",
            "bid_count": "22",
            "bids": [
                "$10,600",
                "$10,500",
                "$10,200",
                "$10,100",
                "$10,000",
                "$9,200",
                "$9,100",
                "$9,000",
                "$8,600",
                "$8,500",
                "$8,000",
                "$7,600",
                "$7,500",
                "$7,000",
                "$6,700",
                "$6,500",
                "$6,200",
                "$5,550",
                "$5,432",
                "$5,000",
                "$600",
                "$100"
            ]
        }
    },
    "https://carsandbids.com/auctions/35MvLXDE/2022-ford-f-150-lightning-lariat": {
        "auction_title": "2022 Ford F-150 Lightning Lariat",
        "auction_subtitle": "Extended-Range Battery, 4WD, E-Lock Rear Axle",
        "auction_quick_facts": {
            "Make": "Ford",
            "Model": "F-150\nSave",
            "Mileage": "3,700",
            "VIN": "1FT6W1EV4NWG04433",
            "Title Status": "Clean (NY)",
            "Location": "Baldwin, NY 11510",
            "Seller": "moespeed",
            "Engine": "Dual Electric Motors",
            "Drivetrain": "4WD/AWD",
            "Transmission": "Automatic",
            "Body Style": "Truck",
            "Exterior Color": "Carbonized Gray Metallic",
            "Interior Color": "Black",
            "Seller Type": "Private Party"
        },
        "dougs_take": "I love the new Ford F-150 Lightning, and it's a great option for those in the market for an electric pickup – touting practical features like 4-wheel drive, a large frunk, a usable driving range, and great technology. This particular Lightning is a Lariat model that includes features like an extended-range battery, a locking rear axle, heated and ventilated front seats, an 8-speaker Bang & Olufsen audio system, Ford Co-Pilot360 Active 2.0 technology, and more. This Lightning also indicates less than 4,000 miles – and it's offered with a clean, accident-free Carfax report, further enhancing the appeal.",
        "auction_highlights": [
            "The attached Carfax history report indicates no accidents or mileage discrepancies in this Ford's past.",
            "According to the window sticker provided in the gallery, this Lightning carried a sticker price of $79,269 and came equipped with Equipment Group 511A, an extended-range battery, an electric drive e-lock rear axle, a power-operated hood and tailgate, power-adjustable, heated, and ventilated front seats, a 360-degree camera, an 8-speaker Bang & Olufsen sound system, and more as detailed below. Modifications reported by the seller are limited to a Retrax retractable bed cover and an aftermarket bed rug.",
            "Formerly used on a high-performance gasoline variant of the F-150, the Lightning nameplate was revived for the 2022 model year by Ford's first series-produced electric truck. Every member of the line-up offers dual electric motors for through-the-road all-wheel drive, though buyers have two battery packs to choose from, and driving range varies accordingly.",
            "Power comes from a pair of electric motors (one per axle), which draw electricity from a 131-kilowatt-hour lithium-ion battery pack to turn all four wheels with 580 horsepower and 775 lb-ft of torque. The Lightning earned a maximum driving range of 320 miles from the EPA with the extended-range battery."
        ],
        "auction_equipment": [
            "Equipment Group 511A (Lariat Lightning Series, Ford Co-Pilot360 Active 2.0, partitioned lockable storage, Tow Technology Package, onboard scales with smart hitch, twin panel sunroof)",
            "20-inch dark gray alloy wheels",
            "Extended-range battery",
            "Electric drive e-lock rear axle",
            "LED projector with dynamic bending headlights",
            "Power-operated hood and tailgate",
            "Side steps",
            "Leather-trimmed upholstery",
            "Power-adjustable, heated, and ventilated front seats",
            "Heated steering wheel",
            "Power-adjustable pedals",
            "Keyless entry",
            "15.5-inch infotainment system with Sync 4",
            "360-degree camera",
            "8-speaker Bang & Olufsen sound system"
        ],
        "modifications": [
            "Retrax Pro XR retractable bed cover",
            "Aftermarket bed rug"
        ],
        "known_flaws": [],
        "services": [],
        "included_items": [
            "2 key fobs",
            "Owner's manual",
            "Window sticker",
            "Yakima locking bed racks (with key)",
            "Rhino-Rack locking bed racks (with keys)",
            "Husky all-weather floor mats",
            "OEM carpeted floor mats",
            "Spare tire"
        ],
        "ownership_history": "The seller purchased this Lightning new in September 2022.",
        "auction_stats": {
            "reserve_status": "Reserve",
            "auction_status": "Reserve not met, bid to",
            "highest_bid_value": "$69,000",
            "auction_date": "Feb 27, 2023 11:54 PM",
            "view_count": "4,163",
            "bid_count": "8",
            "bids": [
                "$69,000",
                "$68,500",
                "$66,000",
                "$65,000",
                "$60,000",
                "$40,000",
                "$30,000",
                "$225"
            ]
        }
    },
    "https://carsandbids.com/auctions/308bYZg3/2004-porsche-911-carrera-4s-cabriolet": {
        "auction_title": "2004 Porsche 911 Carrera 4S Cabriolet",
        "auction_subtitle": "~51,900 Miles, AWD, California- and Arizona-Owned, Mostly Unmodified",
        "auction_quick_facts": {
            "Make": "Porsche",
            "Model": "911\nSave",
            "Mileage": "51,900",
            "VIN": "WP0CA29904S650092",
            "Title Status": "Clean (AZ)",
            "Location": "Chandler, AZ 85226",
            "Seller": "alstempe",
            "Engine": "3.6L Flat-6",
            "Drivetrain": "4WD/AWD",
            "Transmission": "Automatic (5-Speed)",
            "Body Style": "Convertible",
            "Exterior Color": "Arctic Silver Metallic",
            "Interior Color": "Black",
            "Seller Type": "Dealer"
        },
        "dougs_take": "The 996-generation Porsche 911 has finally earned a spot at the table of collectible Porsche models – and this example looks like a nice one. It's a desirable 4S Cabriolet that touts reasonably low mileage, dry-climate California and Arizona ownership history, and a classic color combination. It's also nicely equipped with 18-inch Turbo Look II wheels, xenon headlights, a full leather interior, and a Bose sound system. Plus, this Carrera 4S is nearly unmodified – and it comes with a clean, accident-free Carfax report, for added buyer confidence.",
        "auction_highlights": [
            "The odometer on this Carrera 4S currently displays about 51,900 miles.",
            "The attached Carfax history report lists no accidents or mileage discrepancies in this 911’s past. It also shows that it's been registered in California and Arizona since new.",
            "A build sheet is provided in the photo gallery, and a partial list of notable equipment includes 18-inch Turbo Look II wheels, a power-retractable soft top, a full leather interior with supple leather seats, aluminum-look interior trim, power-adjustable and heated front seats, a Bose sound system, and more as detailed below. Modifications are limited to clear side marker lights.",
            "Porsche introduced the 996-generation 911 for the 1999 model year. It was the first water-cooled 911, and it stood out from its predecessors with a new-look front end that ditched the round lights. The line-up grew to include coupe, convertible, and Targa models plus numerous variants ranging from the base Carrera to the track-ready GT2.",
            "Released for 2002, the wide-body Carrera 4S variant of the 996 offered enthusiasts all-wheel-drive, plus suspension and brake components borrowed from the Turbo in a naturally-aspirated package. It also bore a distinctive reflector bar across its rear.",
            "Power comes from an \"M96\" 3.6-liter flat-6, rated at 320 horsepower and 273 lb-ft of torque. Output is sent to all four wheels via a 5-speed automatic transmission."
        ],
        "auction_equipment": [
            "18-inch Turbo Look II wheels",
            "Red-painted brake calipers",
            "Power-retractable soft top",
            "Xenon headlights",
            "Full leather interior with supple leather seats",
            "Aluminum-look interior trim",
            "Power-adjustable and heated front seats with driver's memory function",
            "Porsche crest in headrests",
            "Automatic climate control",
            "Bose sound system",
            "Cruise control"
        ],
        "modifications": [
            "Clear side marker lights"
        ],
        "known_flaws": [
            "Some chips on front bumper",
            "Scuffs on the front lip",
            "Some chips on the wheels",
            "2010 and 2016 date codes on tires",
            "Creases and wear on the seat bolsters",
            "Worn finish on radio knobs"
        ],
        "services": [],
        "included_items": [
            "Three keys",
            "Owner's manuals"
        ],
        "ownership_history": "The selling dealer recently acquired this 911 in December 2022.",
        "auction_stats": {
            "reserve_status": "Reserve",
            "auction_status": "Reserve not met, bid to",
            "highest_bid_value": "$29,000",
            "auction_date": "Feb 27, 2023 11:49 PM",
            "view_count": "5,882",
            "bid_count": "18",
            "bids": [
                "$29,000",
                "$28,250",
                "$28,000",
                "$27,250",
                "$27,000",
                "$26,250",
                "$26,000",
                "$24,996",
                "$20,000",
                "$16,996",
                "$10,996",
                "$9,996",
                "$7,096",
                "$6,996",
                "$5,000",
                "$1,888",
                "$1,011",
                "$911"
            ]
        }
    },
    "https://carsandbids.com/auctions/3BZazQAE/2006-acura-rsx-type-s": {
        "auction_title": "2006 Acura RSX Type-S",
        "auction_subtitle": "NO RESERVE 6-Speed Manual, 201-hp 4-Cylinder, Mostly Unmodified",
        "auction_quick_facts": {
            "Make": "Acura",
            "Model": "RSX\nSave",
            "Mileage": "124,400",
            "VIN": "JH4DC53066S012523",
            "Title Status": "Clean (CA)",
            "Location": "Los Angeles, CA 90022",
            "Seller": "cesar399",
            "Engine": "2.0L I4",
            "Drivetrain": "Front-wheel drive",
            "Transmission": "Manual (6-Speed)",
            "Body Style": "Coupe",
            "Exterior Color": "Nighthawk Black Pearl",
            "Interior Color": "Black",
            "Seller Type": "Private Party"
        },
        "dougs_take": "The Acura RSX Type-S is a cool and sporty car that follows a recipe for fun reminiscent of old-school Acura. Specifically, it's small and lightweight, it boasts a 6-speed manual transmission, and it has a punchy naturally-aspirated 2.0-liter engine. This particular RSX Type-S is nearly unmodified, too – and it comes with a clean, accident-free Carfax report showing ownership history is dry climate states since 2011, both of which are nice benefits. Plus, this RSX is offered with no reserve, so someone is taking it home at the end of the auction.",
        "auction_highlights": [
            "This RSX features a 6-speed manual transmission.",
            "The attached Carfax history report lists no accidents or mileage discrepancies in this RSX's past.",
            "Factory equipment includes 17-inch wheels, a power sunroof, leather upholstery, power windows, mirrors, and locks, a Bose sound system, automatic climate control, and cruise control. Modifications reported by the seller are limited to tinted windows.",
            "The RSX replaced the Integra for the 2002 model year in the US with similar dimensions but revised styling inside and out, more power from new K-Series 4-cylinder engines, and a strut-type front suspension. The Type-S built upon the base model with a stiffened suspension and a sportier version of the 4-cylinder, plus an exclusive 6-speed manual transmission.",
            "Power comes from a 2.0-liter \" K20Z1\" inline-4 engine, rated at 201 horsepower and 140 lb-ft of torque. Output is sent to the front wheels via a 6-speed manual transmission."
        ],
        "auction_equipment": [
            "17-inch wheels",
            "Power sunroof",
            "Rear wiper",
            "Leather upholstery",
            "Power windows, mirrors, and locks",
            "Bose sound system with CD player",
            "Automatic climate control",
            "Cruise control"
        ],
        "modifications": [
            "Tinted windows"
        ],
        "known_flaws": [
            "Paint chips and scratches around the exterior",
            "Scuffs on and beneath lower front lip",
            "Spoiler plugs, scratches, and wear on the rear hatch",
            "Paint cracks on the rear bumper",
            "Some curb rash on passenger's side wheels",
            "Creases on front seats",
            "Loose cupholder cover in center console",
            "Hole in driver's carpet floor mat",
            "The seller reports that the transmission feels clunky in reverse."
        ],
        "services": [
            "June 2022 (123,278 miles): Tire condition and pressure checked",
            "June 2021 (120,657 miles): Maintenance inspection completed, A/C and heating system checked, exterior trim checked, engine oil and filter changed",
            "May 2020 (118,610 miles): Maintenance inspection completed, engine oil and filter changed, steering/suspension checked, four wheel alignment performed",
            "January 2020 (115,484 miles): Maintenance inspection completed, engine oil and filter changed",
            "September 2019 (111,001 miles): Maintenance inspection completed, spark plug(s) replaced, fuel injection system flushed/serviced, brake fluid flushed/changed, engine oil and filter changed, tires rotated, serpentine belt replaced, upper radiator hose replaced, thermostat replaced, lower radiator hose replaced, engine valves adjusted, windshield replaced"
        ],
        "included_items": [
            "2 keys with remotes",
            "Owner's manual",
            "Factory carpet and all-weather mats",
            "Aftermarket carpet floor mats",
            "Factory transmission (requires rebuild)",
            "Factory rear spoiler"
        ],
        "ownership_history": "The seller purchased this RSX in June 2022 and has added approximately 1,000 miles since.",
        "auction_stats": {
            "reserve_status": "No reserve",
            "auction_status": "Sold to",
            "highest_bid_value": "$12,200",
            "auction_date": "Feb 27, 2023 11:46 PM",
            "view_count": "9,441",
            "bid_count": "31",
            "bids": [
                "$12,200",
                "$12,000",
                "$11,900",
                "$11,800",
                "$11,700",
                "$11,600",
                "$11,500",
                "$11,200",
                "$11,100",
                "$10,900",
                "$10,800",
                "$10,600",
                "$10,500",
                "$10,300",
                "$10,200",
                "$9,900",
                "$9,800",
                "$9,600",
                "$9,500",
                "$9,100",
                "$9,000",
                "$8,600",
                "$8,500",
                "$8,200",
                "$8,100",
                "$8,000",
                "$7,700",
                "$5,000",
                "$4,100",
                "$4,000",
                "$2,006"
            ]
        }
    },
    "https://carsandbids.com/auctions/K1YRpg5d/1993-subaru-impreza-wrx": {
        "auction_title": "1993 Subaru Impreza WRX",
        "auction_subtitle": "5-Speed Manual, Extensive Modifications, Japanese Import with U.S. Title",
        "auction_quick_facts": {
            "Make": "Subaru",
            "Model": "Impreza\nSave",
            "Mileage": "20,000 Miles Shown - TMU",
            "VIN": "GC8006716",
            "Title Status": "Clean (NH)",
            "Location": "Hudson, NH 03051",
            "Seller": "NAI",
            "Engine": "2.0L Turbocharged Flat-4",
            "Drivetrain": "4WD/AWD",
            "Transmission": "Manual (5-Speed)",
            "Body Style": "Sedan",
            "Exterior Color": "World Rally Blue",
            "Interior Color": "Gray",
            "Seller Type": "Dealer"
        },
        "dougs_take": "The original Subaru Impreza WRX is one of the most iconic sport sedans to come out of Japan – and while Subaru never sold the model in the United States, several examples have trickled in now that they're old enough to legally import. This is one of these cars – it boasts a U.S. title for peace of mind, and it features a long list of aftermarket parts intended to improve its look and its performance, including a desirable GReddy turbocharger, Speedline wheels, and World Rally Blue paint. This WRX is also listed by a great seller – and it sounds great, too, with a fantastic exhaust note in the included video.",
        "auction_highlights": [
            "This is a right-hand-drive, Japanese-market sedan that's titled in New Hampshire.",
            "Modifications to this WRX are extensive, and the full list is detailed below. Highlights include a GReddy turbocharger, equal-length headers, 17-inch Speedline wheels, a body kit, a roll cage, Recaro front seats, a Pivot Racing Spec lap timer, a Blitz turbo timer, Alpine parts in the sound system, and a trunk-mounted amplifier, among other aftermarket parts.",
            "Subaru released the first WRX in Japan in 1992. Offered as a sedan and a little later as a hatchback, the WRX (World Rally eXperimental) benefited from the lessons the Japanese firm learned while racing the Legacy in international rally events. Its turn to compete came after the Legacy's retirement, and an overall victory in the 1995 World Rally Championship tremendously boosted sales and Subaru's image around the world. Still, the original WRX was never sold in the United States.",
            "Power comes from a 2.0-liter turbocharged flat-4, rated at about 240 horsepower and 224 lb-ft of torque when left stock. The modifications might increase those figures but a dyno sheet is not available. Part of the long-running \"EJ\" family of engines, it spins the four wheels via a 5-speed manual transmission and Subaru's permanent all-wheel-drive system."
        ],
        "auction_equipment": [
            "Rear wiper",
            "Sunroof",
            "Power-adjustable door mirrors",
            "Air conditioning"
        ],
        "modifications": [
            "GReddy turbocharger",
            "Equal-length headers",
            "Aftermarket exhaust system",
            "17-inch Speedline wheels",
            "TEIN coilover suspension",
            "Adjustable camber plates",
            "Front and rear strut braces",
            "World Rally Blue paint",
            "Body kit (including front bumper, side skirts, and rear wing)",
            "Aftermarket grille",
            "Aftermarket hood with vents",
            "Rain guards on the windows",
            "Emblems removed from the trunk lid",
            "Roll cage",
            "Recaro front seats",
            "ATC Sprint R steering wheel",
            "Pivot Racing Spec lap timer",
            "Aftermarket gauges",
            "Aftermarket instrument cluster",
            "A'PEXi rev/speed meter",
            "A'PEXi airflow converter",
            "Blitz dual turbo timer",
            "HKS electronic control system",
            "Aftermarket shift knob",
            "Aftermarket pedal caps",
            "Dome light removed",
            "Alpine head unit",
            "Alpine CD and DVD player",
            "Alpine CD and DVD changer",
            "Alpine DVD-based navigation system",
            "Alpine parts in the sound system",
            "Trunk-mounted amplifier",
            "Japanese toll card reader"
        ],
        "known_flaws": [
            "The selling dealer states that this WRX's instrument cluster has been replaced. The odometer displays about 32,200 kilometers, which represents around 20,000 miles, but the true mileage is unknown.",
            "Faded trim on the driver-side C-pillar",
            "Scratches on the wheels",
            "Wear on some of the interior touchpoints",
            "Residue on the dashboard and front door panels",
            "Worn hood insulation pad",
            "Some rust on some of the underbody components"
        ],
        "services": [],
        "included_items": [
            "1 key",
            "Owner's manuals",
            "Japanese inspection certificates"
        ],
        "ownership_history": "The selling dealer states that he purchased this WRX in 2022.",
        "auction_stats": {
            "reserve_status": "Reserve",
            "auction_status": "Sold to",
            "highest_bid_value": "$18,500",
            "auction_date": "Feb 27, 2023 11:30 PM",
            "view_count": "18,165",
            "bid_count": "16",
            "bids": [
                "$18,500",
                "$18,250",
                "$18,000",
                "$13,555",
                "$13,000",
                "$12,555",
                "$12,100",
                "$12,000",
                "$11,100",
                "$11,000",
                "$10,400",
                "$10,300",
                "$10,100",
                "$10,000",
                "$7,500",
                "$6,969"
            ]
        }
    },
    "https://carsandbids.com/auctions/3qMpw5Ry/2017-mercedes-benz-e400-cabriolet": {
        "auction_title": "2017 Mercedes-Benz E400 Cabriolet",
        "auction_subtitle": "Turbo V6 Power, Polar White, Unmodified",
        "auction_quick_facts": {
            "Make": "Mercedes-Benz",
            "Model": "E400\nSave",
            "Mileage": "99,700",
            "VIN": "WDDKK6FFXHF360957",
            "Title Status": "Clean (WA)",
            "Location": "Bellevue, WA 98006",
            "Seller": "jonika1990",
            "Engine": "3.0L Turbocharged V6",
            "Drivetrain": "Rear-wheel drive",
            "Transmission": "Automatic (7-Speed)",
            "Body Style": "Convertible",
            "Exterior Color": "Polar white",
            "Interior Color": "Beige",
            "Seller Type": "Private Party"
        },
        "dougs_take": "The Mercedes-Benz E400 Cabriolet from this era is a desirable car, as it boasts handsome styling, a luxurious interior, and a potent turbocharged V6. This particular E400 Cabriolet is finished in an attractive color combination, and it’s fitted with some great equipment, including a set of handsome 18-inch wheels, heated and ventilated front seats, and the surprisingly useful Airscarf neck-level heating system. This E400 is also completely unmodified, and it touts a clean, accident-free Carfax report, further adding to the appeal.",
        "auction_highlights": [
            "The attached Carfax history report shows no accidents or mileage discrepancies in this E400’s past.",
            "According to the build sheet provided in the gallery, factory equipment includes 18-inch wheels, sport suspension, LED headlights a power-retractable soft top, leather upholstery, power-adjustable heated and ventilated front seats, a navigation system, and more as listed below. The seller reports no modifications.",
            "Mercedes-Benz introduced the E-Class Coupe (called C207 internally) for the 2010 model year to replace the second-generation CLK. It was positioned as a sportier alternative to the E-Class, as its name implied, but it shared much of its underpinnings with the W204-generation C-Class. Production ended in 2017.",
            "The A207 E-Class Cabriolet was first shown in 2010 at the North American International Auto Show. It replaced the CLK-Class in the Mercedes-Benz lineup as a four-seater convertible positioned above the A205 C-Class Cabriolet.",
            "Power comes from a 3.0-liter turbocharged V6, rated at 329 horsepower and 354 lb-ft of torque. Output is sent to the rear wheels via a 7-speed automatic transmission."
        ],
        "auction_equipment": [
            "Memory Package (driver seat, steering column, side mirrors)",
            "18-inch wheels",
            "Sport suspension",
            "Power-retractable soft top",
            "Leather upholstery",
            "Power-adjustable heated and ventilated front seats",
            "Wood interior trim",
            "Comand infotainment system",
            "Navigation system",
            "Dual-zone automatic climate control",
            "Airscarf neck-level heating system",
            "Collision Warning System",
            "Blind Spot Assistant",
            "Rear-view camera",
            "Keyless Go",
            "Cruise control"
        ],
        "modifications": [],
        "known_flaws": [
            "Rock chips on hood and front bumper",
            "Creases on driver's seat's outer bolster"
        ],
        "services": [
            "April 2021 (62,836 miles): Pre-delivery inspection completed, cooling system checked, battery/charging system checked, oil and filter changed, brake fluid flushed/changed, maintenance reminder reset, air filter replaced, transmission checked",
            "February 2020 (46,297 miles): Recommended maintenance performed, electrical system checked, blower motor replaced/repaired, front wiper blades/refills replaced"
        ],
        "included_items": [
            "2 keys",
            "Owner's manual",
            "Window sticker"
        ],
        "ownership_history": "The seller purchased this Mercedes-Benz E400 in June 2021.",
        "auction_stats": {
            "reserve_status": "Reserve",
            "auction_status": "Reserve not met, bid to",
            "highest_bid_value": "$19,500",
            "auction_date": "Feb 27, 2023 11:27 PM",
            "view_count": "8,444",
            "bid_count": "30",
            "bids": [
                "$19,500",
                "$19,250",
                "$19,000",
                "$18,750",
                "$18,500",
                "$18,250",
                "$18,000",
                "$17,250",
                "$17,000",
                "$16,600",
                "$15,500",
                "$15,000",
                "$14,000",
                "$13,300",
                "$13,100",
                "$12,800",
                "$12,600",
                "$12,500",
                "$12,000",
                "$10,500",
                "$10,400",
                "$10,100",
                "$10,000",
                "$9,900",
                "$9,800",
                "$9,700",
                "$9,500",
                "$9,100",
                "$9,000",
                "$2,000"
            ]
        }
    },
    "https://carsandbids.com/auctions/92Q4vXmW/1995-daihatsu-rocky-canterbury-of-new-zealand-4x4": {
        "auction_title": "1995 Daihatsu Rocky Canterbury Of New Zealand 4x4",
        "auction_subtitle": "NO RESERVE Japanese-Market SUV, 4WD, Removable Hardtops, U.S. Title",
        "auction_quick_facts": {
            "Make": "Daihatsu",
            "Model": "Rocky\nSave",
            "Mileage": "61,600",
            "VIN": "F300S010788",
            "Title Status": "Clean (NH)",
            "Location": "Hudson, NH 03051",
            "Seller": "NAI",
            "Engine": "1.6L I4",
            "Drivetrain": "4WD/AWD",
            "Transmission": "Automatic (4-Speed)",
            "Body Style": "SUV/Crossover",
            "Exterior Color": "Green",
            "Interior Color": "Grey",
            "Seller Type": "Dealer"
        },
        "dougs_take": "The Daihatsu Rocky is fun little SUV with surprising off-road capabilities and robust underpinnings. This particular Rocky is a right-hand drive, Japanese-spec model offered with a U.S. title, which means the difficult task of importing one from abroad has already been completed. It boasts 4-wheel drive, a pair of removable hardtops, cool cloth upholstery, and air conditioning. It also benefits from a few upgrades, including a recent exterior repaint – and it has an indicated 61,600 miles, further adding to the appeal. This looks like a well-kept Rocky – and it’s offered with the thrill of no reserve!",
        "auction_highlights": [
            "This Daihatsu is a Japanese-spec, right-hand-drive SUV that's titled in New Hampshire. Reportedly imported from Japan in 2022, it's equipped with a metric instrument cluster, and the odometer currently shows about 99,100 kilometers, which represents approximately 61,600 miles.",
            "Factory equipment includes automatic locking front hubs, a fender-mounted mirror, a rear bumper protector, removable hardtops, Canterbury of New Zealand cloth upholstery, and air conditioning.",
            "Modifications reported by the selling dealer include a green exterior repaint, a Pioneer Carrozzeria head unit, aftermarket rear speakers, and more as detailed below.",
            "Released globally in 1989, and briefly sold in the United States, the F300-generation Rocky was a body-on-frame SUV that offered excellent off-road capacity in a city-friendly package. American sales ended in the early 1990s but the Rocky lived on in Japan until 1997 and in some overseas markets until 2002.",
            "Power comes from a 1.6-liter 4-cylinder engine, rated at approximately 105 horsepower and 103 lb-ft of torque. Output is sent to the rear or the four wheels via a 4-speed automatic transmission and a 2-speed transfer case."
        ],
        "auction_equipment": [
            "Automatic locking front hubs",
            "Fender-mounted mirror",
            "Rain guards on the front windows",
            "Running boards",
            "Rear bumper protector",
            "Removable hardtops",
            "Canterbury of New Zealand cloth upholstery",
            "Air conditioning",
            "Power-operated front windows"
        ],
        "modifications": [
            "Exterior repainted green",
            "16-inch steel wheels",
            "Front brush guard deleted",
            "Side graphics deleted",
            "Pioneer Carrozzeria FH-770DVD head unit",
            "Aftermarket rear speakers",
            "Denso ETC card reader"
        ],
        "known_flaws": [
            "Missing rear wiper",
            "Wear on the driver's seat and interior touchpoints",
            "Some corrosion on seat mounts",
            "Tears in the headliner",
            "Stains in driver's footwell carpets",
            "Cracked driver's door handle trim, scuffs on interior panels",
            "Some corrosion on the underbody and engine bay components"
        ],
        "services": [],
        "included_items": [
            "1 key",
            "Import documents"
        ],
        "ownership_history": "The selling dealer acquired this Rocky in July 2022.",
        "auction_stats": {
            "reserve_status": "No reserve",
            "auction_status": "Sold to",
            "highest_bid_value": "$5,300",
            "auction_date": "Feb 27, 2023 11:14 PM",
            "view_count": "7,063",
            "bid_count": "26",
            "bids": [
                "$5,300",
                "$5,200",
                "$5,100",
                "$5,000",
                "$4,800",
                "$4,700",
                "$4,600",
                "$4,500",
                "$4,000",
                "$3,900",
                "$3,800",
                "$3,666",
                "$3,500",
                "$3,333",
                "$3,200",
                "$2,800",
                "$2,600",
                "$2,500",
                "$2,300",
                "$2,200",
                "$2,100",
                "$2,000",
                "$1,800",
                "$1,600",
                "$1,420",
                "$456"
            ]
        }
    },
    "https://carsandbids.com/auctions/rNbMZGP5/2015-porsche-macan-turbo": {
        "auction_title": "2015 Porsche Macan Turbo",
        "auction_subtitle": "400-hp Turbo V6, Dark Blue Metallic, AWD, Unmodified",
        "auction_quick_facts": {
            "Make": "Porsche",
            "Model": "Macan\nSave",
            "Mileage": "89,100",
            "VIN": "WP1AF2A58FLB47634",
            "Title Status": "Clean (CA)",
            "Location": "San Diego, CA 92127",
            "Seller": "AMoodley",
            "Engine": "3.6L Turbocharged V6",
            "Drivetrain": "4WD/AWD",
            "Transmission": "Automatic (7-Speed)",
            "Body Style": "SUV/Crossover",
            "Exterior Color": "Dark Blue Metallic",
            "Interior Color": "Luxor Beige",
            "Seller Type": "Private Party"
        },
        "dougs_take": "The Porsche Macan Turbo is a fantastic sporty crossover, offering excellent performance and a genuine Porsche driving experience. This particular Macan Turbo is finished in gorgeous Dark Blue Metallic, and it features some great options, including a set of 20-inch Macan SportDesign wheels, thermally and noise insulating privacy glass, and a heated sport steering wheel. This Macan is also unmodified, and it comes with a clean, accident-free Carfax report, for added buyer confidence.",
        "auction_highlights": [
            "The attached Carfax history report lists no accidents or mileage discrepancies in this Macan's past.",
            "Factory equipment includes 20-inch Macan SportDesign wheels, bi-xenon headlights, leather upholstery, heated and ventilated front seats, Dark Walnut wood trim, heated multifunction sport steering wheel, and a navigation system, among others listed below. The seller reports no modifications.",
            "Encouraged by the Cayenne's success and eager to tap into one of the biggest segments of the market, Porsche introduced the Macan as its entry-level SUV for 2015. Some of the model's underpinnings came from Audi, but Porsche dialed in a level of performance and handling that's unusual to find in a compact SUV. The Turbo model was positioned at the top of the line-up through the 2021 model year.",
            "Power comes from a turbocharged 3.6-liter V6, rated at 400 horsepower and 406 lb-ft of torque. It spins the four wheels via a 7-speed dual-clutch automatic transmission."
        ],
        "auction_equipment": [
            "20-inch Macan SportDesign wheels",
            "Bi-xenon headlights",
            "Thermal and noise insulating privacy glass",
            "Leather upholstery",
            "Heated, ventilated, and power-adjustable front seats",
            "Dark Walnut wood trim",
            "Heated multifunction sport steering wheel",
            "2-zone climate control",
            "Navigation system",
            "Bose surround sound system"
        ],
        "modifications": [],
        "known_flaws": [
            "Stone chips on the front end",
            "Paint chips on the leading edge of the hood",
            "Scratches on driver's side front fender",
            "Dings on rear doors",
            "Scratches on rear bumper",
            "Scratches on passenger's side wheels",
            "Indent in driver's side outer seat bolster"
        ],
        "services": [
            "January 2023: Spark plugs and transmission filter replaced, engine oil and filter changed",
            "September 2022 (85,051 miles): Rear brake pads and rotors replaced",
            "May 2022 (82,082 miles): Engine oil and filter changed",
            "July 2021 (70,321 miles): Engine oil and filter changed",
            "September 2020 (61,037 miles): Engine oil and filter changed",
            "April 2020: Four tires installed",
            "December 2019 (52,275 miles): Front brake pads and rotors replaced",
            "November 2019 (50,470 miles): Engine oil and filter changed",
            "March 2019 (40,577 miles): Rear brake pads and rotors, spark plugs replaced, transmission fluid and filter changed"
        ],
        "included_items": [
            "2 keys",
            "Owner's manual",
            "Available service records",
            "Window sticker",
            "Carpet and all-weather floor mats"
        ],
        "ownership_history": "The seller states they purchased this Porsche when new in June 2015.",
        "auction_stats": {
            "reserve_status": "Reserve",
            "auction_status": "Sold to",
            "highest_bid_value": "$27,250",
            "auction_date": "Feb 27, 2023 11:06 PM",
            "view_count": "8,847",
            "bid_count": "18",
            "bids": [
                "$27,250",
                "$27,000",
                "$26,250",
                "$26,000",
                "$25,500",
                "$25,000",
                "$24,000",
                "$23,750",
                "$23,250",
                "$23,000",
                "$22,500",
                "$22,000",
                "$13,000",
                "$12,500",
                "$12,000",
                "$11,760",
                "$10,000",
                "$5,000"
            ]
        }
    },
    "https://carsandbids.com/auctions/rEDW08M7/2015-polaris-slingshot": {
        "auction_title": "2015 Polaris Slingshot",
        "auction_subtitle": "~1,900 Miles, 5-Speed Manual, Numerous Modifications",
        "auction_quick_facts": {
            "Make": "Polaris",
            "Model": "Slingshot\nSave",
            "Mileage": "1,900",
            "VIN": "57XAASFA0F5103774",
            "Title Status": "Clean (CA)",
            "Location": "Rancho Cucamonga, CA 91739",
            "Seller": "Nuvo",
            "Engine": "2.4L I4",
            "Drivetrain": "Rear-wheel drive",
            "Transmission": "Manual (5-Speed)",
            "Body Style": "Convertible",
            "Exterior Color": "Gray",
            "Interior Color": "Black",
            "Seller Type": "Dealer"
        },
        "dougs_take": "The Polaris Slingshot is a ton of fun to drive, as it's part motorcycle, part roadster and fully exciting. This Slingshot boasts low mileage, and it features a long list of modifications intended to improve the look – like a carbon fiber body kit and an aftermarket shift knob. The aftermarket parts in the sound system are a nice addition, as well – and this example boasts cruise control, along with a small windshield for added practicality. Plus, this Slingshot is powered by a General Motors-sourced engine, so finding parts should be relatively straight-forward.",
        "auction_highlights": [
            "This three-wheeler's odometer displays about 1,900 miles.",
            "Modifications reported by the selling dealer include a carbon fiber body kit, carbon fiber door mirror caps, an NRG Innovations steering wheel, a RiderScan rear-view mirror, Sparco pedal caps, a JL Audio display for the infotainment system, Focal speakers, and a Mosconi Gladen D2500.1 amplifier. Some of the removed factory parts are pictured in the gallery and included in the sale.",
            "Pegged at the intersection of motorcycles and cars, the Polaris Slingshot arrived for 2015 with a tubular chassis, polymer body panels, a front-mounted General Motors-sourced engine, and a reverse trike layout. It offers enthusiasts the experience of riding a sports bike and the handling of a sports car; it has no doors and no roof in its standard configuration, but it features a steering wheel and pedals.",
            "Power comes from a 2.4-liter \"EcoTec\" inline-4, rated at 173 horsepower and 166 lb-ft of torque. Power is sent to the rear wheel through a 5-speed manual transmission."
        ],
        "auction_equipment": [
            "18-inch front wheels, 20-inch rear wheel",
            "LED headlights",
            "Windshield",
            "Cruise control"
        ],
        "modifications": [
            "Alpha air intake system",
            "Aftermarket engine oil cap",
            "Carbon fiber engine cover",
            "Aftermarket drive belt guard",
            "Aftermarket rear wheel bolt cover",
            "Carbon fiber body kit (includes front splitter and rear wing)",
            "Carbon fiber door mirror caps",
            "Aftermarket fuel filler cap",
            "NRG Innovations steering wheel",
            "RiderScan rear-view mirror",
            "Aftermarket shift knob",
            "NRG Innovations emergency brake handle and boot",
            "Sparco pedal caps",
            "JL Audio display for the infotainment system",
            "Focal speakers",
            "SSV Works speaker bezels and panel behind the seats",
            "Mosconi Gladen D2500.1 amplifier"
        ],
        "known_flaws": [
            "2013 and 2014 date codes on the tires"
        ],
        "services": [],
        "included_items": [
            "2 keys",
            "Some spare parts (including factory wheels and 1320 Performance headers)",
            "Battery charger",
            "1 helmet"
        ],
        "ownership_history": "The selling dealer states that he purchased this Slingshot in April 2021.",
        "auction_stats": {
            "reserve_status": "Reserve",
            "auction_status": "Sold to",
            "highest_bid_value": "$16,500",
            "auction_date": "Feb 27, 2023 11:01 PM",
            "view_count": "6,766",
            "bid_count": "31",
            "bids": [
                "$16,500",
                "$16,250",
                "$16,000",
                "$15,750",
                "$15,500",
                "$15,250",
                "$14,900",
                "$14,700",
                "$14,600",
                "$14,500",
                "$14,400",
                "$14,300",
                "$14,200",
                "$14,100",
                "$14,000",
                "$13,700",
                "$13,500",
                "$13,000",
                "$12,000",
                "$10,500",
                "$10,100",
                "$10,000",
                "$9,500",
                "$9,000",
                "$8,000",
                "$7,500",
                "$5,000",
                "$4,500",
                "$4,100",
                "$4,000",
                "$3,333"
            ]
        }
    },
    "https://carsandbids.com/auctions/37XQMNqq/2003-dodge-ram-2500-slt-4x4": {
        "auction_title": "2003 Dodge Ram 2500 SLT 4x4",
        "auction_subtitle": "6-Speed Manual, 4WD, Cummins Turbodiesel, Long Bed, Western-Owned",
        "auction_quick_facts": {
            "Make": "Dodge",
            "Model": "Ram\nSave",
            "Mileage": "91,400",
            "VIN": "3D7KU26C43G772081",
            "Title Status": "Clean (CA)",
            "Location": "Fairfield, CA 94533",
            "Seller": "krispl",
            "Engine": "5.9L Turbodiesel I6",
            "Drivetrain": "4WD/AWD",
            "Transmission": "Manual (6-Speed)",
            "Body Style": "Truck",
            "Exterior Color": "Bright White",
            "Interior Color": "Black",
            "Seller Type": "Private Party"
        },
        "dougs_take": "I love the third-generation Dodge Ram, and the heavy-duty 2500 model is a great truck for towing and hauling – especially when equipped with the 5.9-liter Cummins high-output turbodiesel 6-cylinder, like this one has. This Ram is also a regular cab model equipped with a 6-speed manual transmission, 4-wheel drive, and a long bed, which is a rare and desirable combination. Other benefits include no major modifications, a Nevada and California ownership history, and an odometer that indicates less than 92,000 miles since new. A clean, accident-free Carfax report also adds buyer confidence!",
        "auction_highlights": [
            "This Ram is equipped with a 6-speed manual transmission.",
            "The attached Carfax history report indicates no accidents or mileage discrepancies in this truck's past.",
            "Equipment includes 17-inch wheels, a long bed, cloth upholstery, power windows, locks, and mirrors, dual front airbags, air conditioning, cruise control, an AM/FM/CD stereo, and more as detailed below.",
            "A partial list of modifications reported by the seller includes a chrome hood-mounted wind deflector, aftermarket tail light covers, a tailgate top cap, a Fass fuel pump, and front suspension spacers.",
            "The third generation of Dodge Ram debuted in 2001 for the 2002 model year, and the Ram 1500 included an all-new frame, suspension, powertrains, interiors, and sheet metal. The 2500/3500 trucks were introduced in 2003 and retained their durable live rear axles. Four-wheel drive models featured a solid front axle and recirculating-ball steering setup, and the two-wheel drive models came equipped with an independent front suspension and rack-and-pinion steering.",
            "Power comes from a 5.9-liter turbodiesel \"high output\" inline-6, rated at approximately 305 horsepower and 555 lb-ft of torque. Output is sent to the rear or all four wheels through a 6-speed manual transmission and a 2-speed transfer case."
        ],
        "auction_equipment": [
            "17-inch wheels",
            "Anti-spin rear differential",
            "Engine block heater",
            "Long bed",
            "Cloth upholstery",
            "Power windows, locks, and mirrors",
            "Rear cab storage area",
            "Overhead trip computer",
            "Dual front airbags",
            "Air conditioning",
            "Cruise control",
            "AM/FM/CD stereo"
        ],
        "modifications": [
            "Chrome hood-mounted wind deflector",
            "Aftermarket tail light covers",
            "Non-skid material applied to bed interior",
            "Tailgate top cap",
            "Tinted rear window",
            "FASS fuel pump",
            "Front suspension spacers"
        ],
        "known_flaws": [
            "Some stone chips on front end",
            "Dings on driver's bed side",
            "Dent/scrape on passenger's door, front fender, and front bumper corner",
            "Hole on driver's seat",
            "Cracks on dashboard"
        ],
        "services": [
            "October 2022 (91,156 miles): Vehicle serviced, tire pressure and condition checked",
            "September 2022 (90,929 miles): California emissions test performed",
            "May 2022 (90,589 miles): Nevada emissions test performed",
            "May 2021 (85,925 miles): Nevada emissions test performed",
            "November 2020 (82,861 miles): Fuel injectors replaced, plenum gasket set replaced, valve cover gasket replaced",
            "May 2020 (82,127 miles): Nevada emissions test performed",
            "September 2019 (78,828 miles): Vehicle serviced, drivability/performance checked, alignment checked"
        ],
        "included_items": [
            "1 set of keys",
            "Owner's manual",
            "Carpeted floor mats",
            "Spare tire"
        ],
        "ownership_history": "The seller states that they purchased this Ram in September 2022 and have added approximately 800 miles since.",
        "auction_stats": {
            "reserve_status": null,
            "auction_status": null,
            "highest_bid_value": null,
            "auction_date": null,
            "view_count": null,
            "bid_count": null,
            "bids": []
        }
    },
    "https://carsandbids.com/auctions/3702EMBv/1995-toyota-land-cruiser": {
        "auction_title": "1995 Toyota Land Cruiser",
        "auction_subtitle": "NO RESERVE 5-Speed Manual, 1HZ Diesel 6-Cylinder, 4WD, Triple Locking Differentials",
        "auction_quick_facts": {
            "Make": "Toyota",
            "Model": "Land Cruiser\nSave",
            "Mileage": "82,500",
            "VIN": "HZJ810005190",
            "Title Status": "Registered (NH)",
            "Location": "Hudson, NH 03051",
            "Seller": "NAI",
            "Engine": "4.2L Diesel I6",
            "Drivetrain": "4WD/AWD",
            "Transmission": "Manual (5-Speed)",
            "Body Style": "SUV/Crossover",
            "Exterior Color": "White",
            "Interior Color": "Grey",
            "Seller Type": "Dealer"
        },
        "dougs_take": "Now this is a really cool Land Cruiser! It's a Japanese-market 80-Series that features the desirable combination of diesel power, a 5-speed manual transmission, AND triple locking differentials. This Land Cruiser also features some upgrades intended to make it even more capable off the beaten path, including a suspension lift, 17-inch Method Race wheels, and 34-inch Goodyear mud-terrain tires. Other benefits include low mileage for one of these and a U.S. registration, which means that the next owner won't have to worry about the difficulty of importing it from abroad. To top it off, this Land Cruiser is offered with the excitement of no reserve, which should make for a thrilling auction finish!",
        "auction_highlights": [
            "This Land Cruiser is a Japanese-spec, right-hand drive SUV equipped with a 5-speed manual transmission. Reportedly imported from Japan in April 2022, it's equipped with a metric instrument cluster, and the odometer shows about 132,800 kilometers, which represents approximately 82,500 miles.",
            "Factory equipment includes triple locking differentials, running boards, rear ambulance-style doors, cloth upholstery, and automatic climate control.",
            "The full list of modifications reported by the selling dealer is detailed below. Highlights include a Rancho suspension lift kit, 17-inch Method Race wheels with 34-inch Goodyear Territory MT tires, a tubular front bumper, fender-mounted wing mirrors, and an Eclipse touchscreen head unit.",
            "Released globally in 1990, the 80-Series is the first Land Cruiser to firmly plant its flag in the luxury segment. It was bigger than its predecessor, it gained a more aerodynamic design, and it offered better materials inside. It nonetheless kept what adventurers loved about the Land Cruiser: solid axles, a 2-speed transfer case, and a generous amount of ground clearance. Japanese production ended in 1997.",
            "Power comes from a \"1HZ\" 4.2-liter diesel inline-6, rated at approximately 129 horsepower and 210 lb-ft of torque. Output is sent to all four wheels through a 5-speed manual transmission and a 2-speed transfer case."
        ],
        "auction_equipment": [
            "Triple locking differentials",
            "Fender-mounted mirror",
            "Running boards",
            "Rear ambulance-style doors",
            "Rear wipers",
            "Rear parking mirror",
            "Cloth upholstery",
            "Power-adjustable mirrors",
            "Automatic climate control"
        ],
        "modifications": [
            "Rancho suspension lift kit",
            "Aftermarket exhaust system",
            "17-inch Method Race wheels with 34-inch Goodyear Territory MT tires",
            "Tubular front bumper",
            "Fender-mounted wing mirrors",
            "Fender flares",
            "Side window rain guards",
            "Rear tow hook",
            "Tinted windows",
            "Eclipse AVN6606HD touchscreen head unit",
            "Pioneer Carrozzeria speakers",
            "Incent car charger"
        ],
        "known_flaws": [
            "Chips and scratches around the exterior",
            "Some rust at the base of driver's side A-pillar",
            "Passenger's side running board is dented",
            "Rear bumper is misaligned",
            "Wear on interior touchpoints",
            "Cracks on dash",
            "Stains in the headliner",
            "Hood insulation pad is torn",
            "Some rust on underbody components"
        ],
        "services": [
            "Engine oil and filter changed",
            "Wheels and tires replaced",
            "Fuel filter replaced"
        ],
        "included_items": [
            "3 keys",
            "Owner's manual",
            "Import documents",
            "Rubber floor mats"
        ],
        "ownership_history": "The selling dealer acquired this Land Cruiser in April 2022.",
        "auction_stats": {
            "reserve_status": "No reserve",
            "auction_status": "Sold to",
            "highest_bid_value": "$22,500",
            "auction_date": "Feb 27, 2023 10:50 PM",
            "view_count": "11,523",
            "bid_count": "33",
            "bids": [
                "$22,500",
                "$21,500",
                "$20,500",
                "$19,500",
                "$18,750",
                "$18,500",
                "$16,000",
                "$15,000",
                "$13,100",
                "$13,000",
                "$12,100",
                "$12,000",
                "$9,700",
                "$9,600",
                "$9,500",
                "$9,000",
                "$7,500",
                "$7,000",
                "$6,900",
                "$6,800",
                "$6,700",
                "$6,600",
                "$6,500",
                "$6,400",
                "$6,300",
                "$6,200",
                "$6,100",
                "$6,000",
                "$5,700",
                "$5,600",
                "$5,500",
                "$5,000",
                "$500"
            ]
        }
    },
    "https://carsandbids.com/auctions/92vodvQQ/1998-bmw-540i-sedan": {
        "auction_title": "1998 BMW 540i Sedan",
        "auction_subtitle": "6-Speed Manual, V8 Power, Some Modifications",
        "auction_quick_facts": {
            "Make": "BMW",
            "Model": "540i\nSave",
            "Mileage": "98,800",
            "VIN": "WBADE5320WBV93124",
            "Title Status": "Clean (NJ)",
            "Location": "Blackwood, NJ 08012",
            "Seller": "sbattman",
            "Engine": "4.4L V8",
            "Drivetrain": "Rear-wheel drive",
            "Transmission": "Manual (6-Speed)",
            "Body Style": "Sedan",
            "Exterior Color": "Arctic Silver Metallic",
            "Interior Color": "Black",
            "Seller Type": "Private Party"
        },
        "dougs_take": "The E39 BMW 540i is a compelling luxury sedan, touting classic styling and V8 power – and it's especially exciting with a 6-speed manual transmission and a sport suspension, which is exactly what we have here. This particular 540i is finished in a classic BMW color combination, and it's equipped with heated front seats and a premium sound system – plus, it features some desirable modifications like 18-inch Style 37 wheels, upgraded brakes, and a Billy Boat Exhaust muffler. To top it off, this 540i is offered with a clean, accident-free Carfax report for added buyer confidence.",
        "auction_highlights": [
            "The attached Carfax history report indicates no accidents or mileage discrepancies in this car's past.",
            "According to the window sticker pictured in the gallery, this E39 had an original MSRP of $57,320 and came equipped with sports suspension calibration, fog lights, a sunroof, leather upholstery, heated and power-adjustable front seats, automatic climate control, and a CD player, among others listed below.",
            "Modifications reported by the seller include 18-inch Style 37 wheels, aftermarket slotted and drilled brake rotors, aftermarket braided brake lines, an aFe Power cold air intake, DEC catalytic converters, a Billy Boat Exhaust muffler, paint protection film on front bumper and valance, a front valance, Hella European-style facelifted headlights, window tint, an M5-style rear spoiler, and an M5 steering wheel.",
            "In the United States, BMW introduced the E39-generation 5 Series for the 1997 model year. Available at launch, the V8-powered 540i remained positioned as the quickest and most expensive non-M-badged model until production ended after the 2003 model year.",
            "Power comes from the 4.4-liter \"M62\" V8, which produces 282 horsepower and 310 lb-ft of torque. This engine may be making more power as a result of the modifications, though a dyno sheet is not included. Output is sent to the rear wheels via a 6-speed manual transmission."
        ],
        "auction_equipment": [
            "Sports suspension calibration",
            "Fog lights",
            "Power-operated sunroof",
            "Leather upholstery",
            "Heated and power-adjustable front seats",
            "Automatic climate control",
            "6-disc CD changer",
            "Premium sound system with DSP"
        ],
        "modifications": [
            "18-inch Style 37 wheels",
            "Aftermarket slotted and drilled brake rotors",
            "Aftermarket braided brake lines",
            "aFe Power cold air intake",
            "DEC catalytic converters",
            "Billy Boat Exhaust muffler",
            "Front valance",
            "Paint protection film on front bumper and valance",
            "Hella European-style facelifted headlights",
            "Clear side markers",
            "Window tint",
            "M5-style rear spoiler",
            "Hella facelifted taillights",
            "M shift knob",
            "M5 steering wheel"
        ],
        "known_flaws": [
            "Various chips and scratches as seen in gallery photos",
            "Scratches, cracks, and damage on front valance",
            "Some cracks in tires",
            "2013, 2015, and 2016 date codes on tires",
            "Creases on driver's seat",
            "Passenger's seat is missing a seat position button",
            "Wear on steering wheel",
            "Crack in center A/C vent",
            "Pixels missing on head unit",
            "Passenger's side cup holder is missing",
            "Cracks in interior wood trim",
            "Crack in center console cubby slider",
            "Some rust on exhaust and underside components"
        ],
        "services": [
            "December 2022 (98,717 miles): Maintenance inspection completed, fluids checked, engine electrical system checked",
            "September 2021 (98,385 miles): Fluids checked, oil and filter changed, camshaft position sensor replaced"
        ],
        "included_items": [
            "2 keys",
            "Owner's manual",
            "Copy of window sticker",
            "Service records"
        ],
        "ownership_history": "The seller is representing this 540i on behalf of the owner, who purchased it in February 2019 and added approximately 2,500 miles since.",
        "auction_stats": {
            "reserve_status": "Reserve",
            "auction_status": "Sold to",
            "highest_bid_value": "$10,900",
            "auction_date": "Feb 27, 2023 10:44 PM",
            "view_count": "12,217",
            "bid_count": "32",
            "bids": [
                "$10,900",
                "$10,800",
                "$10,700",
                "$10,500",
                "$10,200",
                "$10,000",
                "$9,900",
                "$9,800",
                "$9,700",
                "$9,500",
                "$8,888",
                "$8,700",
                "$8,600",
                "$8,500",
                "$8,250",
                "$8,040",
                "$7,540",
                "$7,200",
                "$7,069",
                "$6,969",
                "$6,420",
                "$6,000",
                "$5,600",
                "$5,450",
                "$5,200",
                "$4,900",
                "$4,700",
                "$4,600",
                "$4,500",
                "$3,700",
                "$3,540",
                "$2,000"
            ]
        }
    },
    "https://carsandbids.com/auctions/KVGzO1zL/2015-porsche-boxster-s": {
        "auction_title": "2015 Porsche Boxster S",
        "auction_subtitle": "~11,600 Miles, Anthracite Brown Metallic, Unmodified",
        "auction_quick_facts": {
            "Make": "Porsche",
            "Model": "Boxster\nSave",
            "Mileage": "11,600",
            "VIN": "WP0CB2A89FK130587",
            "Title Status": "Clean (CA)",
            "Location": "Palm Springs, CA 92264",
            "Seller": "exoticauctionsales",
            "Engine": "3.4L Flat-6",
            "Drivetrain": "Rear-wheel drive",
            "Transmission": "Automatic (7-Speed)",
            "Body Style": "Convertible",
            "Exterior Color": "Anthracite Brown Metallic",
            "Interior Color": "Luxor Beige",
            "Seller Type": "Dealer ($85 Document Fee)"
        },
        "dougs_take": "The 981 Porsche Boxster S is a fantastic sports car with thrilling handling, handsome styling, and excellent performance, thanks to a naturally-aspirated 3.4-liter flat-6 mounted in the middle. This particular Boxster S has a lot going for it, including the beautiful color combination of Anthracite Brown Metallic over a Luxor Beige leather interior. It also boasts some nice factory equipment, including the Porsche Active Suspension Management (PASM) system, adaptive cruise control, and a set of 19-inch wheels. Other benefits include just 11,600 miles, and a clean, accident-free Carfax report showing just two owners in dry-climate Southern California from new, further adding to the appeal.",
        "auction_highlights": [
            "The odometer currently displays approximately 11,600 miles.",
            "The attached Carfax history report shows no accidents or mileage discrepancies in this Boxster’s past. It also confirms that this is a 2-owner car registered in California from new.",
            "According to the build sheet provided in the gallery, factory equipment includes 19-inch wheels, Porsche Active Suspension Management (PASM), a power-operated soft top, a speed-activated rear spoiler, leather upholstery, power-adjustable seats, and more as listed below. No modifications have been reported by the selling dealer.",
            "The 981 Boxster was sold from 2013 through 2016 as Porsche's entry-level sports car, though this range-topping S model considerably shrinks the performance gap between itself and the base 911 Carrera. The S model sports a 77-pound weight reduction over the previous generation Boxster, and employs a slightly de-tuned (35 hp less) version of the same engine that powers its larger sibling.",
            "Power comes from a 3.4-liter flat 6, rated at 315 horsepower and 266 lb-ft of torque. Output is sent to the rear wheels via a 7-speed PDK dual-clutch automatic transmission."
        ],
        "auction_equipment": [
            "19-inch wheels",
            "Wheel center caps with colored Porsche crests",
            "Porsche Active Suspension Management (PASM) system",
            "Red brake calipers",
            "Speed-activated rear spoiler",
            "Leather upholstery",
            "Power-adjustable seats",
            "PCM infotainment system",
            "Automatic climate control",
            "ParkAssist, front and rear",
            "Adaptive cruise control with Porsche Active Safe (PAS)"
        ],
        "modifications": [],
        "known_flaws": [
            "Paint chips and some scuffs on the lower front bumper",
            "2014 date codes on 3 tires, 2016 date code on the driver-side rear wheel"
        ],
        "services": [
            "September 2022 (11,360 miles): Battery replaced, battery/charging system checked",
            "August 2019: Vehicle serviced",
            "July 2019: Vehicle serviced",
            "July 2019: Vehicle serviced",
            "May 2019: Vehicle serviced"
        ],
        "included_items": [
            "1 key",
            "Owner's manual"
        ],
        "ownership_history": "The selling dealer acquired this Boxster in January 2023 and added minimal mileage since.",
        "auction_stats": {
            "reserve_status": "Reserve",
            "auction_status": "Reserve not met, bid to",
            "highest_bid_value": "$45,000",
            "auction_date": "Feb 27, 2023 10:36 PM",
            "view_count": "12,632",
            "bid_count": "35",
            "bids": [
                "$45,000",
                "$44,300",
                "$44,000",
                "$43,300",
                "$43,000",
                "$42,250",
                "$42,000",
                "$41,250",
                "$41,000",
                "$40,500",
                "$40,250",
                "$40,000",
                "$39,250",
                "$39,000",
                "$38,500",
                "$38,000",
                "$37,500",
                "$37,000",
                "$36,500",
                "$36,000",
                "$35,500",
                "$35,000",
                "$34,250",
                "$34,000",
                "$33,500",
                "$33,250",
                "$33,000",
                "$32,000",
                "$31,100",
                "$30,850",
                "$30,600",
                "$26,250",
                "$26,000",
                "$25,000",
                "$2,000"
            ]
        }
    },
    "https://carsandbids.com/auctions/KDVk1gE8/2004-volvo-s60r": {
        "auction_title": "2004 Volvo S60R",
        "auction_subtitle": "NO RESERVE 6-Speed Manual, Turbocharged 5-Cylinder, AWD, Highly Modified",
        "auction_quick_facts": {
            "Make": "Volvo",
            "Model": "S60\nSave",
            "Mileage": "105,000",
            "VIN": "YV1RH52Y042327681",
            "Title Status": "Clean (WA)",
            "Location": "Seattle, WA 98177",
            "Seller": "Torbjorn",
            "Engine": "2.5L Turbocharged I5",
            "Drivetrain": "4WD/AWD",
            "Transmission": "Manual (6-Speed)",
            "Body Style": "Sedan",
            "Exterior Color": "Silver Metallic",
            "Interior Color": "Nordkap",
            "Seller Type": "Private Party"
        },
        "dougs_take": "The Volvo S60R is a fun sports sedan with all-wheel drive, a potent turbocharged 5-cylinder engine, and a wonderful soundtrack. This particular S60R also features the desirable 6-speed manual transmission, making it especially fun to drive – and it has some nice factory equipment, including bi-xenon headlights, power-adjustable heated front seats, and those beautiful Pegasus wheels. This S60R also touts a number of upgrades, including a TME Stage 2 tune, exhaust, and suspension springs – and it's offered with the thrill of no reserve, which should make for an exciting auction finish!",
        "auction_highlights": [
            "This S60R features the desirable 6-speed manual transmission.",
            "Factory equipment includes 18-inch Pegasus wheels, all-wheel drive, Brembo brakes, an R-specific body kit, a power sunroof, leather upholstery, power-adjustable and heated front sport seats, and an R-specific instrument cluster.",
            "Modifications to this S60R are extensive, and the full list is detailed below. Highlights include a TME exhaust system, a Svenske downpipe, a TME ECU tune, TME springs, Evolve front grilles, an Alpine head unit, MB quart speakers, Dynaudio subwoofers, JL Audio amplifiers, and more as detailed below.",
            "Volvo waded into a segment dominated by its German rivals when it released the S60R for 2004. Its engineers used a turbocharged engine, Haldex all-wheel drive, and innovative suspension technology to create what was then the fastest series-produced car ever to wear a Volvo emblem. The S60R stayed true to its Swedish roots with a relatively low-key design.",
            "Power comes from a 2.5-liter turbocharged 5-cylinder engine, rated at 300 horsepower and 295 lb-ft of torque in stock form. The modifications likely increase those figures, but a dyno sheet was not provided to confirm. Output is sent to all four wheels via a 6-speed manual transmission."
        ],
        "auction_equipment": [
            "18-inch Pegasus wheels",
            "All-wheel drive",
            "Brembo brakes",
            "R-specific body kit",
            "Bi-xenon headlights with wipers",
            "Power sunroof",
            "Leather upholstery",
            "Power-adjustable and heated front sport seats",
            "R-specific instrument cluster",
            "Dual-zone automatic climate control",
            "Cruise control"
        ],
        "modifications": [
            "TME stage 2 ECU tune",
            "TME exhaust system",
            "Svenske downpipe with Random Technology catalytic converter",
            "iPd heavy-duty turbo control valve",
            "iPd engine stabilizer bushing",
            "Subframe isolator shim retrofit",
            "QBM upper engine stabilizer strut mounts",
            "QBM lower transmission mount",
            "All-wheel drive system kill switch",
            "TME springs, sway bars, and end links",
            "Stainless steel brake lines",
            "Takspeed brake shims",
            "Evolve upper and lower mesh front grilles",
            "PIAA Ion fog lights",
            "XPEL protection film on headlights and fog lights",
            "Driver's side aspherical mirror",
            "Low-profile windshield wiper arms",
            "Color-matched upper belt moldings",
            "Aftermarket rear-view camera",
            "Some exterior badging removed",
            "Tinted windows",
            "Momo shift knob",
            "Color-matched shifter surround and cupholder lid",
            "Alpine head unit",
            "MB quart speakers",
            "Dynaudio subwoofers and tweeters",
            "JL Audio amplifiers",
            "Heico pedals",
            "Disabled automatic daytime running lights",
            "Incline alarm sensor",
            "Dynamat sheets on doors, trunk, and trunk lid"
        ],
        "known_flaws": [
            "Although the included Carfax report indicates no accidents in this S60’s past, documentation in the gallery shows that the hood was replaced, and the front fenders and the driver-side doors were repaired and refinished in December 2006 and January 2007. Please contact the seller directly with any questions.",
            "Chips on exterior body panels",
            "Dings on the hood, rear bumper",
            "Scratches on the driver's side front fender, roof",
            "Weathered windshield weatherstripping",
            "Curb rash and chips on wheels",
            "2017 date codes on rear tires",
            "Creases and some wear on seats",
            "Wear on shift knob",
            "Creases on driver's door panel"
        ],
        "services": [
            "January 2021 (98,620 miles): Engine oil and filter changed, brake fluid flushed/changed, four wheel alignment performed, lower control arm(s) replaced",
            "May 2019 (92,468 miles): Rear brakes serviced/adjusted",
            "March 2019 (91,733 miles): Engine oil and filter changed, front brakes serviced"
        ],
        "included_items": [
            "2 keys, 1 valet key",
            "Owner's manual",
            "Service records",
            "Interior and trunk trim pieces",
            "Factory spare wheel and tire",
            "Full-sized spare wheel and tire",
            "Rensi all-weather front floor mats",
            "IPD and DiCE tuning cables"
        ],
        "ownership_history": "The seller purchased this S60R in December 2021.",
        "auction_stats": {
            "reserve_status": "No reserve",
            "auction_status": "Sold to",
            "highest_bid_value": "$10,000",
            "auction_date": "Feb 27, 2023 10:27 PM",
            "view_count": "12,760",
            "bid_count": "18",
            "bids": [
                "$10,000",
                "$9,100",
                "$9,000",
                "$7,200",
                "$7,000",
                "$6,600",
                "$6,500",
                "$6,100",
                "$6,000",
                "$5,100",
                "$5,000",
                "$4,000",
                "$3,200",
                "$3,015",
                "$1,500",
                "$1,250",
                "$1,000",
                "$500"
            ]
        }
    },
    "https://carsandbids.com/auctions/KZGBM77O/2017-mazda-mx-5-miata-sport": {
        "auction_title": "2017 Mazda MX-5 Miata Sport",
        "auction_subtitle": "NO RESERVE 1 Owner, 6-Speed Manual, California-Owned, Some Modifications",
        "auction_quick_facts": {
            "Make": "Mazda",
            "Model": "MX-5 Miata\nSave",
            "Mileage": "52,800",
            "VIN": "JM1NDAB79H0122877",
            "Title Status": "Clean (CA)",
            "Location": "Fountain Valley, CA 92708",
            "Seller": "only_conv_driver",
            "Engine": "2.0L I4",
            "Drivetrain": "Rear-wheel drive",
            "Transmission": "Manual (6-Speed)",
            "Body Style": "Convertible",
            "Exterior Color": "Ceramic Metallic",
            "Interior Color": "Black",
            "Seller Type": "Private Party"
        },
        "dougs_take": "I love the ND Mazda Miata because it's small, peppy, and exceptionally fun to drive – especially when it's equipped with a 6-speed manual transmission, like this one. This ND looks good in Ceramic Metallic, and it features some nice equipment like 16-inch alloy wheels, LED headlights, air conditioning, and an advanced keyless entry system. It also touts several minor but desirable modifications including LED daytime running lights, a low-profile driver's seat mount, an aftermarket steering wheel, and front and rear dashcams. On top of all that, this Miata benefits from single ownership in warm-climate California since new, adding further to its appeal.",
        "auction_highlights": [
            "This MX-5 is fitted with the desirable 6-speed manual transmission.",
            "The attached Carfax history report shows no mileage discrepancies in this MX-5’s past. It also confirms that it’s been registered to one owner in California since new.",
            "According to the window sticker provided in the gallery, factory equipment includes LED headlights, a manually folding soft top, cloth upholstery, air conditioning, an advanced keyless entry system, and more as detailed below.",
            "Modifications reported by the seller include paint protection film on the front end, LED daytime running lights, an Aurora Auto Design low profile driver's seat mount, an aftermarket steering wheel, and BlackVue front and rear dashcams. A full list of modifications is included below.",
            "The ND generation of the Mazda MX-5 Miata debuted for the 2016 model year, and it strikes a balance as a modern, nicely-appointed roadster that still maintains the intended nature of a Miata as a fun, uncomplicated, lightweight sports car at an accessible price.",
            "Power comes from a 2.0-liter inline-4 engine, rated at 155 horsepower and 148 lb-ft of torque. Output is sent to the rear wheels via a 6-speed manual transmission."
        ],
        "auction_equipment": [
            "16-inch alloy wheels",
            "LED headlights",
            "Manually folding soft top",
            "Cloth upholstery",
            "Manually adjustable sport seats",
            "Leather-upholstered steering wheel and shift knob",
            "Air conditioning",
            "Bluetooth connectivity",
            "Advanced keyless entry system",
            "Cruise control"
        ],
        "modifications": [
            "Paint protection film on the front end",
            "LED daytime running lights",
            "Flyin' Miata sequential rear LED turn signal bulbs",
            "Moss Miata shorty antenna",
            "Driver side blind spot mirror insert",
            "Curt tow hitch receiver",
            "Factory splash guards",
            "Aftermarket steering wheel",
            "Steering wheel spacer",
            "Aurora Auto Design low profile driver seat mount",
            "Flyin' Miata cabin air filter",
            "BlackVue front and rear dashcams",
            "Leg Sport armrest pad"
        ],
        "known_flaws": [
            "The attached Carfax history report shows that this MX-5 sustained \"minor damage\" to the rear in March 2019. The seller notes that the rear bumper was replaced to repair the damage.",
            "Although not listed on the Carfax, the seller states a rear end collision occurred in January 2018 as well, requiring the rear bumper to be repainted. The seller adds that the driver's door was repainted in November 2021 to repair a scratch; documentation for this repair is shown in the gallery.",
            "Rock chip on hood",
            "Scratches on both rocker panels (shown in video)",
            "Chip in paint on rear bumper",
            "Chips in paint on passenger side rear quarter panel (shown in photos)",
            "Scratch on rear driver side wheel",
            "Some wear on driver's seat bolsters",
            "Some wear on driver's door panel"
        ],
        "services": [
            "November 2022 (50,895 miles): Engine oil and filter changed, air induction system cleaned, transmission and differential fluid changed, engine air filter replaced, wheels balanced, four wheel alignment performed, brake fluid changed",
            "June 2021: Paint protection film installed",
            "December 2020: Aurora Auto Design low profile driver seat mount installed",
            "February 2019: Paint correction performed, Gyeon ceramic coating applied, Glassparency windshield coating applied",
            "May 2022 (45,983 miles): Engine oil and filter changed, tires rotated",
            "November 2021 (41,117 miles): Engine oil and filter changed, tires rotated",
            "June 2021 (35,965 miles): Engine oil and filter changed, tires rotated",
            "October 2020 (28,127 miles): Engine oil and filter changed, tires rotated, brake fluid flushed/changed, transmission fluid changed",
            "June 2020 (23,775 miles): Engine oil and filter changed, tires rotated",
            "November 2019 (18,605 miles): Engine oil and filter changed, tires rotated",
            "March 2019 (14,333 miles): Engine oil and filter changed, tires rotated",
            "July 2018 (9,535 miles): Engine oil and filter changed, tires rotated",
            "January 2018 (5,057 miles): Engine oil and filter changed, tires rotated"
        ],
        "included_items": [
            "2 keys",
            "Window sticker",
            "Service records",
            "Mazda trunk liner",
            "Mazda convertible half-cover",
            "Mazda outdoor car cover",
            "Convertible top cleaner and sealant",
            "WeatherTech floormats",
            "WeatherTech sunshade"
        ],
        "ownership_history": "The seller purchased this MX-5 when new in August 2017.",
        "auction_stats": {
            "reserve_status": "No reserve",
            "auction_status": "Sold to",
            "highest_bid_value": "$16,500",
            "auction_date": "Feb 27, 2023 10:20 PM",
            "view_count": "8,940",
            "bid_count": "31",
            "bids": [
                "$16,500",
                "$16,250",
                "$16,000",
                "$15,750",
                "$15,500",
                "$15,250",
                "$15,000",
                "$14,900",
                "$14,800",
                "$14,700",
                "$14,600",
                "$14,500",
                "$14,000",
                "$13,700",
                "$13,569",
                "$13,250",
                "$13,101",
                "$13,000",
                "$12,600",
                "$12,500",
                "$12,100",
                "$12,000",
                "$10,000",
                "$3,500",
                "$3,200",
                "$3,100",
                "$2,600",
                "$2,500",
                "$2,400",
                "$2,017",
                "$420"
            ]
        }
    },
    "https://carsandbids.com/auctions/9a50x62Q/2019-bmw-m850i-xdrive-coupe": {
        "auction_title": "2019 BMW M850i xDrive Coupe",
        "auction_subtitle": "~9,100 Miles, Twin-Turbocharged V8, AWD, Barcelona Blue Metallic",
        "auction_quick_facts": {
            "Make": "BMW",
            "Model": "M850i\nSave",
            "Mileage": "9,100",
            "VIN": "WBABC4C52KBU95434",
            "Title Status": "Clean (NY)",
            "Location": "San Diego, CA 92103",
            "Seller": "prabhuamol",
            "Engine": "4.4L Turbocharged V8",
            "Drivetrain": "4WD/AWD",
            "Transmission": "Automatic (8-Speed)",
            "Body Style": "Coupe",
            "Exterior Color": "Barcelona Blue Metallic",
            "Interior Color": "Tartufo/Black",
            "Seller Type": "Private Party"
        },
        "dougs_take": "The BMW M850i is a thrilling coupe, boasting gorgeous styling and truly exceptional performance, thanks to a twin-turbocharged V8 with 523 horsepower and with BMW's xDrive all-wheel drive system. This particular M850i is especially appealing, as it's finished in an absolutely stunning Barcelona Blue Metallic over Tartufo and black color combination – and it features a LOT of desirable equipment, like the Drivers Assistance Pro and Comfort Seating packages, 20-inch Style 728M wheels, an M carbon roof, a Bowers & Wilkins sound system, and much more. This M850i also touts low mileage, and it's offered with a clean, accident-free Carfax report, adding some valuable peace of mind.",
        "auction_highlights": [
            "The odometer currently displays approximately 9,100 miles.",
            "The attached Carfax history report shows no accidents or mileage discrepancies in this M850i’s past.",
            "Factory equipment includes the Drivers Assistance Pro and Comfort Seating packages, 20-inch Style 728M wheels, Icon adaptive LED headlights, an M carbon roof, Merino leather upholstery, heated and power-adjustable front seats, automatic climate control, glass controls, soft-close doors, a Bowers & Wilkins sound system, and a navigation system, among others listed below. The seller reports no modifications.",
            "BMW resurrected the 8 Series nameplate for 2019, nearly 20 years after the \"E31\" was discontinued. The new \"G15\" generation continues the 8 Series tradition with its long, sweeping body lines on the outside and the latest and greatest luxury features BMW has to offer on the inside. Propelling the 8 Series to the modern age is a combination of powerful turbocharged engines and an available xDrive all-wheel drive system.",
            "Power comes from an \"N63\" 4.4-liter twin-turbocharged V8 engine, rated at 523 horsepower and 553 lb-ft of torque. Output is sent to all four wheels via an 8-speed automatic transmission and BMW's xDrive all-wheel drive system."
        ],
        "auction_equipment": [
            "Drivers Assistance Pro Package (Extended Traffic Jam Assistant, Active Driving Assistant Pro)",
            "Comfort Seating Package (remote engine start, front ventilated seats, heated front armrests, heated steering wheel)",
            "20-inch Style 728M wheels",
            "Adaptive M Suspension Pro",
            "M Sport brakes",
            "M Sport differential",
            "Icon adaptive LED headlights",
            "M carbon roof",
            "Merino leather upholstery",
            "Heated and power-adjustable front seats",
            "Automatic climate control",
            "Glass controls",
            "Comfort Access keyless entry",
            "Soft-close doors",
            "Bowers & Wilkins sound system",
            "Navigation system",
            "Apple CarPlay capabilities"
        ],
        "modifications": [],
        "known_flaws": [
            "Some rock chips on hood",
            "Scratches on driver's side door",
            "Scratches on wheels",
            "Creases on driver's seat's outer bolster",
            "Scratches on driver's door sill"
        ],
        "services": [
            "The attached Carfax history report shows that the fluids and tire condition and pressure were checked in March 2022 at 3,788 miles. The seller states the coolant fluid was topped off, a maintenance inspection was completed, and an engine oil and filter change was recently performed."
        ],
        "included_items": [
            "2 keys",
            "Owner's manual",
            "Build sheet"
        ],
        "ownership_history": "The seller purchased this M850i in February 2022 and has added approximately 5,800 miles since.",
        "auction_stats": {
            "reserve_status": "Reserve",
            "auction_status": "Sold to",
            "highest_bid_value": "$64,000",
            "auction_date": "Feb 27, 2023 10:12 PM",
            "view_count": "14,145",
            "bid_count": "23",
            "bids": [
                "$64,000",
                "$63,055",
                "$62,555",
                "$62,000",
                "$61,500",
                "$61,000",
                "$60,500",
                "$60,000",
                "$59,500",
                "$58,500",
                "$58,000",
                "$57,500",
                "$57,000",
                "$55,555",
                "$53,100",
                "$52,569",
                "$52,000",
                "$50,569",
                "$50,000",
                "$40,000",
                "$33,333",
                "$25,000",
                "$4,000"
            ]
        }
    },
    "https://carsandbids.com/auctions/9elDlZvN/1985-bmw-325e-coupe": {
        "auction_title": "1985 BMW 325e Coupe",
        "auction_subtitle": "NO RESERVE 325is Drivetrain Swap, 5-Speed Manual, Numerous Modifications",
        "auction_quick_facts": {
            "Make": "BMW",
            "Model": "325e\nSave",
            "Mileage": "158,000",
            "VIN": "WBAAB6409F1211063",
            "Title Status": "Clean (GA)",
            "Location": "Suwanee, GA 30024",
            "Seller": "trivers",
            "Engine": "2.5L I6",
            "Drivetrain": "Rear-wheel drive",
            "Transmission": "Manual (5-Speed)",
            "Body Style": "Coupe",
            "Exterior Color": "Bronzit Beige Metallic",
            "Interior Color": "Black",
            "Seller Type": "Private Party"
        },
        "dougs_take": "I love this build! It's an E30-generation BMW 3 Series that started life as a lowly 325e with an automatic transmission – but it's now reportedly powered by a 325is-sourced 2.5-liter straight-6, so it's more powerful than stock, and it boasts a 5-speed manual transmission that enhances the driving experience further. This E30 also features several suspension modifications that should improve handling, including aftermarket shocks and springs – yet it looks nearly unmodified when viewed from the outside. Other benefits include a clean, accident-free Carfax history report for peace of mind, and the excitement of no reserve.",
        "auction_highlights": [
            "The attached Carfax history report starts in 2004 and lists no accidents since, though it contains several gaps. It also shows that this BMW has been Georgia-owned since at least 2004.",
            "This 325e's factory-fitted 2.7-liter straight-6 was replaced by a 2.5-liter \"M20B25\" straight-6 sourced from a 1989 325is, according to the seller. The list of modifications reported by the seller also includes a 5-speed manual transmission and a 4.10:1-ratio limited-slip differential from a 1989 325is, aftermarket headers, an Ireland Engineering Motorsports muffler, a Condor Speed Shop subframe, 14-inch BBS wheels, Bilstein struts, and H&R Special Springs Super Sport springs.",
            "BMW introduced the E30-generation 3 Series in the United States late in the 1983 model year. It was originally offered exclusively with a 4-cylinder engine, but 6-cylinder-powered models were quickly added to the range. The 325e notably joined the line-up for 1984 as the first 6-cylinder-powered E30 sold in the United States, and the 325iX released for 1988 was the first series-produced BMW with permanent all-wheel-drive. BMW made several updates to the E30 and production ended after the 1991 model year.",
            "Power comes from a 2.5-liter straight-6, rated at 166 horsepower and 163 lb-ft of torque. It spins the rear wheels via a 5-speed manual transmission."
        ],
        "auction_equipment": [
            "Sunroof",
            "Vinyl upholstery",
            "Power-operated front windows",
            "Pop-out rear windows",
            "Power-adjustable door mirrors",
            "Power-operated antenna",
            "Cruise control",
            "Air conditioning"
        ],
        "modifications": [
            "2.5-liter \"M20B25\" straight-6 from a 1989 325is",
            "Polyurethane engine mounts",
            "Aftermarket headers",
            "Ireland Engineering Motorsports muffler",
            "5-speed manual transmission from a 1989 325is",
            "Chassis-mounted short-throw shifter",
            "Polyurethane transmission mount",
            "4.10:1-ratio limited-slip differential from a 1989 325is",
            "Polyurethane differential mount",
            "Condor Speed Shop subframe",
            "14-inch BBS wheels",
            "Bilstein struts",
            "H&R Special Springs Super Sport springs",
            "Condor Speed Shop control arm bushings",
            "Stainless-steel brake lines",
            "Front splitter",
            "Fog lights removed",
            "Aftermarket steering wheel",
            "Aftermarket shift knob",
            "Black finish on the front seatbelt release buttons",
            "Radio removed; radio block-off plate installed",
            "Clock from a European-market model",
            "Overhead console removed"
        ],
        "known_flaws": [
            "Scratches on the front bumper",
            "Dents in the driver-side rocker panel",
            "Cracks in the driver-side rear light",
            "Some scratches on the wheels",
            "VIN plate missing from the dashboard",
            "Split seams on the driver's seat cushion",
            "Wear on some of the interior touch points",
            "Passenger-side window motor works intermittently",
            "Instrument cluster plastic cover cracked",
            "Crack on the dashboard",
            "Tear in the C-pillar fabric",
            "Air conditioning system doesn't work"
        ],
        "services": [
            "Water pump",
            "Expansion tank",
            "Fuel tank",
            "Fuel pump",
            "Ignition coil",
            "Distributor cap and rotor",
            "Spark plugs and wires",
            "Starter motor",
            "Shift fork",
            "Pilot and throw-out bearings",
            "Clutch kit and pressure plate",
            "Clutch master and slave cylinders",
            "Tires",
            "Exterior emblems",
            "Front and rear lights",
            "Ignition switch",
            "Windshield wiper stalk",
            "Dashboard",
            "Shifter boot",
            "Shifter bushings"
        ],
        "included_items": [
            "1 key and 1 spare blank key",
            "Parts invoices",
            "Spare window seals"
        ],
        "ownership_history": "The seller states that he purchased this 325e in 2018.",
        "auction_stats": {
            "reserve_status": "No reserve",
            "auction_status": "Sold to",
            "highest_bid_value": "$8,700",
            "auction_date": "Feb 27, 2023 10:07 PM",
            "view_count": "10,240",
            "bid_count": "28",
            "bids": [
                "$8,700",
                "$8,600",
                "$8,500",
                "$8,400",
                "$8,300",
                "$8,200",
                "$8,100",
                "$8,000",
                "$7,900",
                "$7,800",
                "$7,500",
                "$7,300",
                "$7,200",
                "$7,000",
                "$6,900",
                "$6,800",
                "$6,600",
                "$6,500",
                "$6,250",
                "$6,100",
                "$6,000",
                "$5,750",
                "$5,600",
                "$5,500",
                "$5,100",
                "$5,000",
                "$2,000",
                "$1,000"
            ]
        }
    },
    "https://carsandbids.com/auctions/9e22zdd3/1994-lada-niva-1600": {
        "auction_title": "1994 Lada Niva 1600",
        "auction_subtitle": "Left-Hand Drive SUV, 5-Speed Manual, 4WD, U.S. Registration",
        "auction_quick_facts": {
            "Make": "Lada",
            "Model": "Niva\nSave",
            "Mileage": "34,500",
            "VIN": "XTA212100P1016304",
            "Title Status": "Registered (NH)",
            "Location": "Hudson, NH 03051",
            "Seller": "NAI",
            "Engine": "1.6L I4",
            "Drivetrain": "4WD/AWD",
            "Transmission": "Manual (5-Speed)",
            "Body Style": "SUV/Crossover",
            "Exterior Color": "White",
            "Interior Color": "Black",
            "Seller Type": "Dealer"
        },
        "dougs_take": "WOW – our first Lada Niva is here! These are pretty obscure in the United States, but they're hugely popular in other parts of the world because they're cheap to run and extremely capable off the beaten path. In fact, the Niva is so popular that it's still in production over 45 years after its debut. This is a left-hand drive example that touts a U.S. registration for peace of mind. It's also mostly unmodified, which is a great benefit, and it looks like it's been relatively well-kept – a lot of these were heavily modified, driven hard, or both. I'm happy to see this little SUV on Cars & Bids, and I bet this is going to be an exciting auction.",
        "auction_highlights": [
            "This is a left-hand drive Niva that was reportedly imported from Japan in 2022. Registered in New Hampshire, it's equipped with a metric instrument cluster and its 5-digit odometer displays about 55,300 kilometers, which represents approximately 34,500 miles.",
            "The attached Carfax history report starts in 2022 and lists no accidents since.",
            "Factory equipment includes 16-inch steel wheels, headlight wipers, mudflaps, manual windows, and rubber flooring. Modifications reported by the selling dealer are limited to aftermarket switches on the dashboard and a Kenwood CD player.",
            "Lada launched the Niva in 1977 as an affordable, capable, and durable off-roader. Initially only offered with two doors, it stood out from many comparable SUVs with unibody construction and a full-time four-wheel drive system. It was later made available with four doors, and several third-party companies turned it into a convertible. Lada has made numerous updates to the Niva over the past couple of decades and the model remains available new today in some markets, including Russia. While it was briefly sold in Canada, it was never officially available in the United States.",
            "Power comes from a 1.6-liter 4-cylinder engine, rated at about 75 horsepower and 87 lb-ft of torque. It spins the four wheels via a 5-speed manual transmission and a 2-speed transfer case."
        ],
        "auction_equipment": [
            "16-inch steel wheels",
            "Headlight wipers",
            "Mudflaps",
            "Rear wiper",
            "Vinyl upholstery",
            "Manual windows",
            "Manual locks",
            "Rubber flooring"
        ],
        "modifications": [
            "Aftermarket switches on the dashboard",
            "Kenwood CD player"
        ],
        "known_flaws": [
            "Faded finish on the quarter panel emblems",
            "Some rust on wheels",
            "Some residue on the dashboard",
            "Driver-side interior door handle bezel and armrest bolt cover missing",
            "Wear on the passenger-side window crank",
            "Some rust on underbody components"
        ],
        "services": [],
        "included_items": [
            "1 key",
            "Owner's manuals",
            "Service records",
            "Import-related documents"
        ],
        "ownership_history": "The selling dealer purchased this Niva in 2022.",
        "auction_stats": {
            "reserve_status": "Reserve",
            "auction_status": "Sold to",
            "highest_bid_value": "$12,600",
            "auction_date": "Feb 27, 2023 9:59 PM",
            "view_count": "21,055",
            "bid_count": "37",
            "bids": [
                "$12,600",
                "$12,500",
                "$12,100",
                "$12,000",
                "$11,600",
                "$11,500",
                "$11,100",
                "$11,000",
                "$10,855",
                "$10,755",
                "$10,655",
                "$10,555",
                "$10,000",
                "$9,100",
                "$9,000",
                "$8,350",
                "$8,250",
                "$8,150",
                "$8,050",
                "$7,900",
                "$5,500",
                "$5,350",
                "$5,200",
                "$5,100",
                "$4,900",
                "$4,800",
                "$4,700",
                "$4,600",
                "$4,500",
                "$3,100",
                "$3,000",
                "$2,700",
                "$2,600",
                "$2,500",
                "$2,111",
                "$2,000",
                "$420"
            ]
        }
    },
    "https://carsandbids.com/auctions/9QPBJj8M/1994-ferrari-348-spider": {
        "auction_title": "1994 Ferrari 348 Spider",
        "auction_subtitle": "Gated 5-Speed Manual, V8 Power, Some Modifications",
        "auction_quick_facts": {
            "Make": "Ferrari",
            "Model": "348\nSave",
            "Mileage": "75,300",
            "VIN": "ZFFRG43A3R0097238",
            "Title Status": "Clean (PA)",
            "Location": "York, PA 17402",
            "Seller": "EzioA",
            "Engine": "3.4L V8",
            "Drivetrain": "Rear-wheel drive",
            "Transmission": "Manual (5-Speed)",
            "Body Style": "Convertible",
            "Exterior Color": "Rosso Corsa",
            "Interior Color": "Beige",
            "Seller Type": "Dealer"
        },
        "dougs_take": "The Ferrari 348 is becoming increasingly desired by collectors, as it touts a classic design, a naturally-aspirated V8 engine, AND a wonderfully analog driving experience. This particular 348 is especially desirable, as it's a very late-production 348 Spider that features some improvements over earlier models – and it's finished in the classic Ferrari color scheme of Rosso Corsa over beige. This 348 also boasts an awesome gated 5-speed manual transmission, and it's equipped with a few upgrades like wheels from a Ferrari 360, Scuderia fender shields, and a Larini Systems exhaust system. This 348 is also offered with a clean, accident-free Carfax report, for added peace of mind.",
        "auction_highlights": [
            "The attached Carfax history report indicates no accidents or mileage discrepancies in this Ferrari's past, though it contains multiple gaps.",
            "Factory equipment includes pop-up headlights, fog lights, Connolly leather upholstery, power-operated windows, mirrors, and locks, among others listed below.",
            "Modifications reported by the selling dealer include 18-inch wheels from a Ferrari 360, a Larini Systems exhaust system, and Scuderia fender shields.",
            "The Ferrari 348 was built between 1989 and 1995 as the successor to Ferrari's long-running rear-mid-engine line. Major updates over the 328 that preceded it included updated exterior styling, a longitudinally-mounted engine design, and a more powerful \"Tipo F119\" V8.",
            "Power comes from a 3.4-liter V8 engine, rated at 312 horsepower and 228 lb-ft of torque. Mid-mounted, it spins the rear wheels via a gated 5-speed manual transmission."
        ],
        "auction_equipment": [
            "Pop-up headlights",
            "Fog lights",
            "Connolly leather upholstery",
            "Power-operated windows, mirrors, and locks",
            "Air conditioning"
        ],
        "modifications": [
            "18-inch wheels from a Ferrari 360",
            "Larini Systems exhaust system",
            "Scuderia fender shields"
        ],
        "known_flaws": [
            "Some rock chips on hood and front bumper",
            "Scratches on underside of front bumper",
            "Tear in convertible top (pictured in the gallery)",
            "Scratches on passenger's side rear wheel",
            "2012 date codes on front tires",
            "2017 date codes on rear tires",
            "Wear on driver's seat's outer bolster",
            "Driver's seat occasionally sticks when tilting the seat back forwards",
            "Wear on steering wheel",
            "The selling dealer states the timing belt was reportedly last replaced in 2014, and it is recommended to be replaced."
        ],
        "services": [],
        "included_items": [
            "1 key",
            "Factory wheels"
        ],
        "ownership_history": "The selling dealer is offering this Ferrari on behalf of the owner, who acquired the vehicle in 2015 and has added approximately 5,000 miles since.",
        "auction_stats": {
            "reserve_status": "Reserve",
            "auction_status": "Sold to",
            "highest_bid_value": "$64,348",
            "auction_date": "Feb 27, 2023 9:46 PM",
            "view_count": "19,167",
            "bid_count": "6",
            "bids": [
                "$64,348",
                "$62,000",
                "$60,650",
                "$60,000",
                "$50,000",
                "$40,000"
            ]
        }
    },
    "https://carsandbids.com/auctions/9W5WdQ7Q/1988-peugeot-205-gti": {
        "auction_title": "1988 Peugeot 205 GTi",
        "auction_subtitle": "NO RESERVE British-Market Hot Hatch, Some Modifications, U.S. Title",
        "auction_quick_facts": {
            "Make": "Peugeot",
            "Model": "205 GTi\nSave",
            "Mileage": "108,200",
            "VIN": "VF320CB6201515666",
            "Title Status": "Clean (MT)",
            "Location": "Huntingdon Valley, PA 19006",
            "Seller": "chrisblakeallen",
            "Engine": "1.6L I4",
            "Drivetrain": "Front-wheel drive",
            "Transmission": "Manual (5-Speed)",
            "Body Style": "Hatchback",
            "Exterior Color": "Gris Graphite",
            "Interior Color": "Red/Gray",
            "Seller Type": "Private Party"
        },
        "dougs_take": "Peugeot never sold the 205 in the United States, but the model was extremely popular in Europe – and the GTi variant is often considered one of the best hot hatches of the 1980s, as it's relatively light, quick, AND a lot of fun to drive thanks in part to a mandatory 5-speed manual transmission. This is a 1.6-liter-powered GTi that's titled in the United States, which is a major benefit – and it touts an attractive color combination; check out the striped cloth upholstery and red carpets! This 205 GTi also features some modifications, including 15-inch wheels from a newer model, along with a sunroof. It's not perfect, but that means you can drive it the way Peugeot intended without feeling guilty about it – and it's offered with the excitement of no reserve.",
        "auction_highlights": [
            "This is a right-hand drive, British-market 205 that's titled in Montana.",
            "The attached Carfax history report starts in 2013 and lists no accidents since.",
            "Factory equipment includes a GTi-specific body kit, fog lights, cloth upholstery, and front sport seats. Modifications reported by the seller include 15-inch wheels from a 1.9-liter-powered 205 GTi, Bilstein Group N Tarmac dampers and springs, an aftermarket sunroof, and a Pioneer CD player.",
            "Peugeot released the 205 in 1983, and the hatchback quickly became the brand's best-selling model. The range-topping GTi made its debut in 1984 with a 1.6-liter 4-cylinder engine and went through several evolutions; 1986 notably brought a 115-horsepower engine and the 1.9-liter-powered model arrived later that year. The GTi retired in 1993, but 205 production continued until 1998.",
            "Power comes from a 1.6-liter 4-cylinder engine, rated at about 115 horsepower and 99 lb-ft of torque. Part of the \"XU\" family of engines, it spins the front wheels via a 5-speed manual transmission."
        ],
        "auction_equipment": [
            "GTi-specific body kit",
            "Fog lights",
            "Rear wiper",
            "Cloth upholstery",
            "Front sport seats",
            "Manual windows"
        ],
        "modifications": [
            "15-inch wheels from a 1.9-liter-powered 205 GTi",
            "Bilstein Group N Tarmac dampers and springs",
            "Stainless-steel brake lines",
            "Aftermarket shift linkage rods",
            "Aftermarket sunroof",
            "Sparco pedal caps",
            "Pioneer CD player",
            "Component front speakers",
            "4-channel amplifier"
        ],
        "known_flaws": [
            "Exterior scratches, chips, dings, and spots of peeling clearcoat (shown in the gallery)",
            "Lower hatch trim cracked",
            "Lower rear bumper misaligned",
            "Some wear on the driver's seat's outer bolsters",
            "Instrument cluster bezel cracked",
            "Passenger-side parcel shelf string broken",
            "Some rust on the rocker panels, hood, some of the underbody components"
        ],
        "services": [],
        "included_items": [
            "2 keys",
            "Service records"
        ],
        "ownership_history": "The seller purchased this 205 GTi in August 2021.",
        "auction_stats": {
            "reserve_status": "No reserve",
            "auction_status": "Sold to",
            "highest_bid_value": "$8,600",
            "auction_date": "Feb 27, 2023 9:38 PM",
            "view_count": "13,795",
            "bid_count": "11",
            "bids": [
                "$8,600",
                "$8,500",
                "$8,188",
                "$8,000",
                "$7,500",
                "$5,000",
                "$3,333",
                "$1,988",
                "$1,100",
                "$1,000",
                "$205"
            ]
        }
    },
    "https://carsandbids.com/auctions/3vY1O7xv/2013-mini-clubvan": {
        "auction_title": "2013 Mini Clubvan",
        "auction_subtitle": "~50,600 Miles, 1 of 50 in the U.S., Formerly Reviewed by Doug DeMuro",
        "auction_quick_facts": {
            "Make": "MINI",
            "Model": "Cooper Clubvan\nSave",
            "Mileage": "50,600",
            "VIN": "WMWZF3C52DT491378",
            "Title Status": "Clean (CA)",
            "Location": "Costa Mesa, CA 92626",
            "Seller": "marije",
            "Engine": "1.6L I4",
            "Drivetrain": "Front-wheel drive",
            "Transmission": "Automatic (6-Speed)",
            "Body Style": "Wagon",
            "Exterior Color": "Pepper White",
            "Interior Color": "Carbon Black",
            "Seller Type": "Private Party"
        },
        "dougs_take": "I love this! The R55 Mini Clubvan is one of the rarest Mini models in North America, as they sold just 50 cars in the few months that went on sale – and it's one of the quirkiest vans ever made. This particular Clubvan is also the very same car I reviewed a few years ago, which adds to my excitement for this weird and special Mini. Like all of these, this one is finished in the handsome Pepper White, and it’s fitted with some nice factory features, including roof rails, a split tailgate, and air conditioning. It also has a relatively low 50,600 miles – and it touts a clean, accident-free Carfax report, showing just two owners in warm-weather California from new, further adding to the appeal. If you always wanted one of the rarest Mini models ever made, this is your chance!",
        "auction_highlights": [
            "The odometer in this Mini indicates approximately 50,600 miles.",
            "The attached Carfax history report shows no accidents or mileage discrepancies in this Mini's past. It also confirms that this is a 2-owner car registered in California from new.",
            "According to the build sheet provided in the gallery, factory equipment includes 16-inch alloy wheels, roof rails, a multifunction sport leather steering wheel, climate control, rear Park Distance Control, and more as detailed below. Modifications reported by the seller are limited to a rubber trunk liner.",
            "Released for the US market in 2013, the Mini Clubvan was a compact commercial van based on the R55-generation Mini Clubman. The Clubvan retained the third passenger door, but the rear seats were removed to create a flat load floor complete with tie-down points. The rear windows were covered with vinyl from the outside and plastic inserts on the inside. Mini withdrew the Clubvan from the US market in July 2013 due to low demand and the excessive 25% \"Chicken Tax\" in place on light commercial vehicles. Only 50 Clubvans were sold in the U.S. during their short production run.",
            "Power comes from a 1.6-liter inline-4, rated at 121 horsepower and 114 lb-ft of torque. Output is sent to the front wheels through a 6-speed automatic transmission."
        ],
        "auction_equipment": [
            "16-inch alloy wheels",
            "Roof rails",
            "Leatherette upholstery",
            "Anthracite headliner",
            "Multifunction sport leather steering wheel",
            "Air conditioning",
            "Sport button",
            "Auto-dimming rearview mirror",
            "Bluetooth hands-free interface",
            "Rear Park Distance Control (PDC)",
            "Dynamic Stability Control (DSC)",
            "Cruise control"
        ],
        "modifications": [
            "Rubber trunk liner"
        ],
        "known_flaws": [
            "Rock chips on the front end",
            "Scuffs on the front bumper's underside",
            "Scratches on the rear bumper",
            "Scratch on the roof (pictured in the photo gallery)"
        ],
        "services": [
            "October 2020: Engine oil and filter changed, brake fluid flushed/changed, four tires mounted, glass repaired",
            "July 2019 (20,288 miles): Thermostat replaced, engine oil and filter changed, air filter replaced",
            "May 2018 (17,721 miles): Brake fluid flushed/changed"
        ],
        "included_items": [
            "2 keys",
            "Owner's manual",
            "Window sticker"
        ],
        "ownership_history": "The seller purchased this Clubvan in November 2020 and has added approximately 27,000 miles since.",
        "auction_stats": {
            "reserve_status": "Reserve",
            "auction_status": "Sold to",
            "highest_bid_value": "$11,500",
            "auction_date": "Feb 27, 2023 9:30 PM",
            "view_count": "21,428",
            "bid_count": "28",
            "bids": [
                "$11,500",
                "$11,300",
                "$11,200",
                "$11,100",
                "$11,000",
                "$10,812",
                "$10,615",
                "$10,515",
                "$10,252",
                "$10,099",
                "$9,999",
                "$9,889",
                "$9,711",
                "$9,600",
                "$9,456",
                "$9,350",
                "$9,234",
                "$9,100",
                "$9,000",
                "$8,888",
                "$8,775",
                "$8,675",
                "$8,500",
                "$7,777",
                "$7,600",
                "$7,500",
                "$7,000",
                "$6,900"
            ]
        }
    }
}