{
    "https://carsandbids.com/auctions/361V4PoB/2018-mclaren-570s-spider": {
        "auction_title": "2018 McLaren 570S Spider",
        "auction_subtitle": "562-hp Twin-Turbo V8, Highly Optioned, California-Owned, Some Modifications",
        "auction_quick_facts": {
            "Make": "McLaren",
            "Model": "570S\nSave",
            "Mileage": "56,700",
            "VIN": "SBM13FAA8JW004423",
            "Title Status": "Clean (CA)",
            "Location": "Glendale, CA 91206",
            "Seller": "eddiantte",
            "Engine": "3.8L Turbocharged V8",
            "Drivetrain": "Rear-wheel drive",
            "Transmission": "Automatic (7-Speed)",
            "Body Style": "Convertible",
            "Exterior Color": "Silver",
            "Interior Color": "Black",
            "Seller Type": "Private Party"
        },
        "dougs_take": "The 562-horsepower McLaren 570S is a special exotic sports car, as it's quick and fun to drive – and it features eye-catching styling. This particular 570S is a Spider model, so it offers the thrill of top-down driving, and it's highly equipped with over $32,000 in options including the Luxury Pack, the Carbon Fiber Exterior Pack 1, the Carbon Fiber Interior Upgrade, carbon ceramic brakes, a vehicle lift system, and a By McLaren designer interior. This 570S is also offered with a clean, accident-free Carfax report showing warm-climate California ownership from new, which should provide valuable peace of mind to the next owner.",
        "auction_highlights": [
            "The attached Carfax history report shows no accidents or mileage discrepancies; it also shows that this 570S has been registered in California since new.",
            "Factory equipment includes the Luxury Pack, the Carbon Fiber Exterior Pack 1, the Carbon Fiber Interior Upgrade, carbon ceramic brakes, a vehicle lift system, a By McLaren designer interior, Alcantara upholstery, a rear-view camera, and Bluetooth connectivity.",
            "The full list of modifications reported by the seller is detailed below. Highlights include an aftermarket titanium exhaust system with catless downpipes, a carbon fiber front splitter, a carbon fiber rear wing, and satin paint protection film applied to the exterior.",
            "McLaren launched the topless variant of the 570S for the 2018 model year. Part of the Sports Series line of cars, it was designed to deliver the best possible handling, not to post headline-grabbing acceleration figures, which partially explains why it kept a hydraulic power steering system in an era when even supercars use an electric setup. McLaren proudly called the 570S Spider \"a convertible without compromise\" when it introduced the model.",
            "Power comes from a twin-turbocharged 3.8-liter V8, rated at 562 horsepower and 443 lb-ft of torque. Output is sent to the rear wheels via a 7-speed dual-clutch automatic transmission linked to a pair of shift paddles."
        ],
        "auction_equipment": [
            "Luxury Pack (8-way power-adjustable and heated sports seats with memory, power-adjustable steering column, 12-speaker Bowers & Wilkins audio system, soft close doors, McLaren branded floor mat set)",
            "Carbon Fiber Exterior Pack 1 (carbon fiber door mirror casings and side intakes)",
            "Carbon Fiber Interior Upgrade (carbon fiber interior components, interior door inserts, and tunnel sides)",
            "19-inch front and 20-inch rear 5-twin-spoke forged alloy wheels",
            "Carbon ceramic brakes",
            "Vehicle lift system",
            "Power-operated hard top",
            "By McLaren designer interior",
            "Alcantara upholstery",
            "7-inch portrait center touchscreen",
            "10-inch digital instrument cluster",
            "Front and rear parking sensors",
            "Rear-view camera",
            "Navigation system",
            "Bluetooth connectivity"
        ],
        "modifications": [
            "Aftermarket titanium exhaust system with catless downpipes",
            "Aftermarket blow off valve",
            "Carbon fiber front splitter",
            "Carbon fiber rear wing",
            "Satin paint protection film applied to the exterior",
            "Black vinyl wrap on A-pillars and the roof area",
            "Black vinyl stripes"
        ],
        "known_flaws": [
            "Chips and scratches on forward-facing surfaces",
            "Scratches under the carbon fiber front bumper splitter (pictured in the gallery)",
            "Scratches on wheels",
            "Rear tires are worn",
            "Tears on passenger's leather door sill (pictured in the gallery)",
            "The seller states that the catless downpipes are causing the check engine light to stay illuminated."
        ],
        "services": [
            "July 2022 (55,046 miles): 30,000-mile service performed, engine oil and filter changed, transmission fluid and clutch fluid changed, wiper blade and key battery replaced",
            "March 2022 (53,205 miles): Seat ECU module and right headlight replaced",
            "December 2021 (52,467 miles): Windshield replaced",
            "June 2021 (49,153 miles): 40,000-mile service performed, engine oil and filter changed, tire(s) replaced, two tires mounted, washer fluid reservoir replaced",
            "October 2020 (43,431 miles): Two tires replaced",
            "June 2020 (40,240 miles): 40,000-mile service performed, clutch serviced/repaired",
            "December 2019 (30,531 miles): Battery replaced",
            "April 2019 (19,784 miles): 20,000-mile service performed, tire(s) replaced, two tires mounted",
            "December 2018 (15,079 miles): Tire(s) replaced, two tires mounted",
            "August 2018 (9,968 miles): 10,000-mile service performed"
        ],
        "included_items": [
            "2 keys",
            "Owner's manual",
            "Battery charger"
        ],
        "ownership_history": "The seller is representing this 570S on behalf of the owner, who purchased it in July 2021 and has added approximately 7,000 miles since.",
        "auction_stats": {
            "reserve_status": "Reserve",
            "auction_status": "Reserve not met, bid to",
            "highest_bid_value": "$92,500",
            "auction_date": "Feb 25, 2023 12:18 AM",
            "view_count": "18,278",
            "bid_count": "25",
            "bids": [
                "$92,500",
                "$92,000",
                "$91,500",
                "$91,000",
                "$90,000",
                "$85,000",
                "$84,500",
                "$84,000",
                "$83,500",
                "$83,000",
                "$82,500",
                "$82,000",
                "$80,000",
                "$78,000",
                "$75,500",
                "$75,000",
                "$70,500",
                "$70,000",
                "$61,000",
                "$60,500",
                "$60,000",
                "$55,000",
                "$42,000",
                "$41,000",
                "$40,000"
            ]
        }
    },
    "https://carsandbids.com/auctions/rGA6P8jo/2001-bmw-z3-30i-coupe": {
        "auction_title": "2001 BMW Z3 3.0i Coupe",
        "auction_subtitle": "NO RESERVE 5-Speed Manual, 3.0-Liter 6-Cylinder, Topaz Blue, Some Modifications",
        "auction_quick_facts": {
            "Make": "BMW",
            "Model": "Z3\nSave",
            "Mileage": "148,200",
            "VIN": "WBACK734X1LJ15071",
            "Title Status": "Clean (CA)",
            "Location": "Woodland Hills, CA 91367",
            "Seller": "FloatingOtter",
            "Engine": "3.0L I6",
            "Drivetrain": "Rear-wheel drive",
            "Transmission": "Manual (5-Speed)",
            "Body Style": "Coupe",
            "Exterior Color": "Topaz Blue",
            "Interior Color": "Sand Beige",
            "Seller Type": "Private Party"
        },
        "dougs_take": "The BMW Z3 is a great sports car that offers a thrilling driving experience – and the uniquely-shaped Z3 Coupe is a lot rarer than the roadster! This was one of the quirkiest BMW models ever made, adding a surprisingly practical hatchback design to the popular Z3 – and this particular Z3 Coupe boasts a 5-speed manual transmission combined with a potent 3.0-liter six-cylinder engine and a limited-slip differential. This Z3 Coupe is also finished in an absolutely gorgeous Topaz Blue over Sand Beige color combination, and it boasts some desirable upgrades – including a reinforced rear subframe, a roll bar, a TC Kline Racing coilover kit, and an Eisenmann muffler. This Z3 Coupe is also offered with no reserve, which further adds to the appeal.",
        "auction_highlights": [
            "This Z3 features the desirable 5-speed manual transmission.",
            "According to the build sheet provided in the gallery, factory equipment includes 17-inch Style 32 wheels, a limited-slip differential, a power sunroof, Nappa leather upholstery, air conditioning, and a Harman/Kardon sound system.",
            "The full list of modifications reported by the seller is detailed below. Highlights include a reinforced rear subframe, a roll bar, a TC Kline Racing coilover kit, an Eisenmann muffler, and 3M ceramic window tint.",
            "Released for 1996, the Z3 was welcomed as a rear-wheel-drive roadster with two seats and a relatively affordable price tag; it was a true driver's car. BMW kept development costs in check by sourcing some components from the E30 and E36 3 Series parts bins, and it built the Z3 in South Carolina. The Z3 was available with numerous engine options, from a 1.9-liter inline-4 engine all the way up to the venerable \"S54\" inline-6 found in the 2001 and 2002 M Coupe and Roadster.",
            "Power comes from a 3.0-liter \"M54\" inline-6, rated at 225 horsepower and 214 lb-ft of torque. Output is sent to the rear wheels via a 5-speed manual transmission."
        ],
        "auction_equipment": [
            "17-inch Style 32 wheels",
            "Limited-slip differential",
            "Dynamic Stability Control (DSC)",
            "Fog lights",
            "Power sunroof",
            "Nappa leather upholstery",
            "Sports seats (non-heated)",
            "Leather-wrapped M steering wheel",
            "Air conditioning",
            "Cruise control",
            "Harman/Kardon sound system"
        ],
        "modifications": [
            "TC Kline Racing coilover kit",
            "TC Kline Racing camber plates",
            "Racing Dynamics front strut brace",
            "Eisenmann muffler",
            "Projector headlights with LED halo rings",
            "3M ceramic window tint",
            "Rear subframe reinforced",
            "Roll bar",
            "Center armrest",
            "VDO Continental TR7412UB-OR head unit",
            "M shift knob",
            "Black center console trim panels with heated seats switches"
        ],
        "known_flaws": [
            "The attached Carfax history report notes that this Z3 sustained \"minor damage\" to the front in July 2020. The seller states that the hood was replaced following a collision with a deer.",
            "Front reflectors are cracked",
            "Some clear coat failure on the roof",
            "Paint chips on forward-facing surfaces and on rear wheel arches",
            "Scratches on the rear bumper",
            "Scratches on wheels",
            "Creases and wear on seats",
            "Scratches on door sills; passenger's side trim is loose",
            "Passenger door speaker grille is cracked",
            "Some corrosion on underbody components"
        ],
        "services": [
            "September 2022 (147,426 miles): Radiator, cooling fan, and fan shroud replaced, coolant changed",
            "July 2022 (146,349 miles): Shift shaft seal, seat rail bushings, and inner and outer tie rods replaced, ride height adjusted",
            "April 2022 (145,683 miles): Engine oil and filter changed, differential fluid, coolant, and brake fluid changed, seat rail bushings and spark plugs replaced, transmission serviced",
            "April 2021 (144,377 miles): Engine oil and filter changed, oil pan drain plug replaced",
            "February 2020 (143,241 miles): Engine serviced",
            "September 2019 (143,010 miles): Engine serviced, rear wiper motor replaced",
            "September 2018 (134,963 miles): Tire(s) replaced"
        ],
        "included_items": [
            "3 keys",
            "Owner's manuals",
            "Service records",
            "Factory head unit",
            "Factory headlights",
            "Assorted spare parts"
        ],
        "ownership_history": "The seller purchased this Z3 in March 2022 and has added approximately 2,500 miles since.",
        "auction_stats": {
            "reserve_status": "No reserve",
            "auction_status": "Sold to",
            "highest_bid_value": "$15,250",
            "auction_date": "Feb 25, 2023 12:16 AM",
            "view_count": "16,715",
            "bid_count": "36",
            "bids": [
                "$15,250",
                "$15,000",
                "$14,750",
                "$14,500",
                "$14,400",
                "$14,300",
                "$14,200",
                "$14,100",
                "$14,000",
                "$13,669",
                "$13,569",
                "$13,469",
                "$13,369",
                "$13,269",
                "$13,100",
                "$13,000",
                "$12,600",
                "$12,500",
                "$12,369",
                "$12,269",
                "$12,100",
                "$12,000",
                "$11,900",
                "$11,800",
                "$11,700",
                "$11,600",
                "$11,500",
                "$11,400",
                "$11,300",
                "$11,200",
                "$11,100",
                "$11,000",
                "$10,000",
                "$3,456",
                "$2,300",
                "$2,001"
            ]
        }
    }
}