{
    "https://carsandbids.com/auctions/9lDnojpO/2021-aston-martin-vantage": {
        "auction_title": "2021 Aston Martin Vantage",
        "auction_subtitle": "~6,000 Miles, 503-hp V8, $32,600 in Options",
        "auction_quick_facts": {
            "Make": "Aston Martin",
            "Model": "Vantage\nSave",
            "Mileage": "6,000",
            "VIN": "SCFSMGAW0MGN05656",
            "Title Status": "Clean (CA)",
            "Location": "Beverly Hills, CA 90211",
            "Seller": "OGaraCoach",
            "Engine": "4.0L Turbocharged V8",
            "Drivetrain": "Rear-wheel drive",
            "Transmission": "Automatic (8-Speed)",
            "Body Style": "Coupe",
            "Exterior Color": "Jet Black",
            "Interior Color": "Obsidian Black/Spicy Red",
            "Seller Type": "Dealer"
        },
        "dougs_take": "I LOVE the current-generation Aston Martin Vantage, thanks to its head-turning styling and big power from the AMG-sourced turbocharged V8 (which will also help ensure its reliability and parts availability in the future). This particular Vantage has traveled just under 6,000 miles, and it boasts an impressive $32,600 in options, including the Exterior Black, Sports Plus, Tech, and Comfort Collections. It’s also mechanically unmodified, and it touts a clean, accident-free Carfax report, further adding to the appeal. These are truly impressive sports cars and I’m thrilled to offer this Vantage on Cars & Bids.",
        "auction_highlights": [
            "The odometer currently displays approximately 6,000 miles.",
            "The attached Carfax history report shows no accidents or mileage discrepancies in this Vantage’s past. It also confirms that it’s been registered in California from new.",
            "According to the window sticker provided in the gallery, this Vantage is fitted with $32,600 in options, including the Exterior Black, Sports Plus, Tech and Comfort Collections, 20-inch Lightweight wheels, a mesh front grille, full LED headlights, smoked taillights, red brake calipers, two-tone leather upholstery, automatic climate control, and more as listed below. Modifications reported by the selling dealer are limited to paint protection film on the rocker covers.",
            "Aston Martin released the new Vantage in for the 2018 model year to replace the outgoing model which had been on sale since 2006. Much like its DB11 sibling, the Vantage uses Mercedes-Benz's COMAND infotainment system and the AMG M177 twin-turbocharged V8 engine.",
            "Power for this Vantage comes from an AMG-sourced 4.0-liter twin-turbocharged V8, rated at 503 horsepower and 461 lb-ft of torque. Output is sent to the rear wheels via an 8-speed automatic transmission."
        ],
        "auction_equipment": [
            "Exterior Black Collection (matte black front grille mesh, matte black window surround trim)",
            "Sports Plus Collection (Sports Plus seats and steering wheel)",
            "Tech Collection (keyless entry, blind spot monitoring, auto park assist, touchpad, glass switches)",
            "Comfort Collection (16-way power-adjustable heated and ventilated seats)",
            "20-inch Lightweight wheels",
            "Red brake calipers",
            "Full LED headlights",
            "Smoked taillights",
            "Two-tone leather upholstery",
            "Gloss black interior trim",
            "Power-adjustable steering column",
            "12-inch TFT digital instrument cluster",
            "Aston Martin Premium Audio system",
            "Navigation system with an 8-inch display",
            "Dual-zone automatic climate control",
            "360-degree camera system",
            "Front and rear parking sensors",
            "Rain-sensing wipers",
            "Cruise control"
        ],
        "modifications": [
            "Paint protection film on the rocker covers"
        ],
        "known_flaws": [
            "Scuff on the front spitter’s passenger side",
            "Paint chips on the driver door's edge",
            "Chips on the paint protection film"
        ],
        "services": [
            "November 2022 (5,827 miles): CPO inspection performed, tire pressure checked, right front wheel repaired, body repaired"
        ],
        "included_items": [
            "2 keys",
            "Owner's manual",
            "Window sticker"
        ],
        "ownership_history": "The selling dealer acquired this Vantage in November 2022.",
        "auction_stats": {
            "reserve_status": "Reserve",
            "auction_status": "Reserve not met, bid to",
            "highest_bid_value": "$101,500",
            "auction_date": "Mar 20, 2023 11:44 PM",
            "view_count": "12,977",
            "bid_count": "12",
            "bids": [
                "$101,500",
                "$101,000",
                "$100,500",
                "$100,000",
                "$99,000",
                "$98,500",
                "$93,500",
                "$92,500",
                "$92,000",
                "$90,000",
                "$87,000",
                "$85,000"
            ]
        }
    },
    "https://carsandbids.com/auctions/rknQ6eMg/1991-volkswagen-jetta-gl": {
        "auction_title": "1991 Volkswagen Jetta GL",
        "auction_subtitle": "NO RESERVE 5-Speed Manual, 2.5L 5-Cylinder Swap, Koni Coilover Suspension, Extensive Modifications",
        "auction_quick_facts": {
            "Make": "Volkswagen",
            "Model": "Jetta\nSave",
            "Mileage": "161,200 Miles Shown - TMU",
            "VIN": "3VWRA21G3MM024689",
            "Title Status": "Clean (VA)",
            "Location": "Staunton, VA 24401",
            "Seller": "kalebshull",
            "Engine": "2.5L I5",
            "Drivetrain": "Front-wheel drive",
            "Transmission": "Manual (5-Speed)",
            "Body Style": "Sedan",
            "Exterior Color": "Alpine White",
            "Interior Color": "Gray",
            "Seller Type": "Private Party"
        },
        "dougs_take": "Now this is cool! The Mk2 Volkswagen Jetta was a really cool car that touted great handling, compact sizing, and a comfortable interior even in base trim. This particular example touts a 2.5-liter 5-cylinder from a later-model Jetta, combined with a 5-speed manual transmission – so it should be more fun to drive (and faster) than a factory Mk2! It also features some nice upgrades like Koni adjustable coilover suspension, drilled and slotted front brake rotors, 15-inch Spec-1 wheels, and Recaro Trophy front seats. On top of all that, this Jetta is offered with an accident-free Carfax report and with the added excitement of no reserve, further enhancing its appeal.",
        "auction_highlights": [
            "The attached Carfax history report shows no accidents or damage in this car's past, though it contains gaps. It also shows that it was registered in North Carolina until 2021.",
            "Modifications to this Volkswagen are extensive, and the full list is detailed below. Highlights include a 2.5-liter 07K 5-cylinder engine, an 02J TDI transmission and shift tower, a 2.5-inch stainless steel catless exhaust system, 15-inch Spec-1 wheels, Koni adjustable coilover suspension, an Mk3 fuel tank, a hydraulic clutch conversion, a custom dual pass radiator, drilled and slotted front brake rotors, Recaro Trophy front seats, a Dual Electronics XDM16BT head unit, and more as described below.",
            "Factory equipment includes power steering, black exterior trim, hand-crank windows, and interior heating.",
            "The Mk2 Jetta was larger, more comfortable, and better equipped than its Mk1 forerunner, and could be ordered with a range of engines and trim configurations. However they were optioned, they proved to be very popular -- according to vwvortex.com, Volkswagen produced nearly 488,000 units for the U.S. over an 8-year production run.",
            "Power comes from a 2.5-liter 07K inline-5 rated at 170 horsepower and 177 ft-lbs of torque in stock form. Output is sent to the front wheels via a 5-speed manual transmission."
        ],
        "auction_equipment": [
            "Power steering",
            "Black exterior trim",
            "Hand-crank windows",
            "Interior heating"
        ],
        "modifications": [
            "2.5-liter 07K 5-cylinder engine from 2008 Rabbit (the seller reports that the engine had approximately 80,000 miles on it when it was installed)",
            "02J TDI 5-speed manual transmission and shift tower",
            "2.5-inch stainless steel catless exhaust system",
            "Mk3 fuel tank",
            "Mk3 fuel pump",
            "Hydraulic clutch conversion",
            "Custom Mk3 oversized dual pass radiator",
            "Custom stainless coolant lines",
            "Stainless steel coolant expansion tank",
            "Spulen Ultimate 2.5L Brake Vacuum Pump Delete Kit",
            "ARP axle cup studs",
            "Aftermarket engine air filter",
            "15-inch Spec-1 wheels",
            "Koni adjustable coilover suspension",
            "Drilled and slotted front brake rotors",
            "Recaro Trophy front seats with power-adjustable bases",
            "Dual Electronics XDM16BT head unit",
            "6x9-inch rear speakers",
            "Digital information display",
            "Black Forest Industries shift knob"
        ],
        "known_flaws": [
            "While the odometer currently displays approximately 161,200 miles, the included Carfax history report shows the mileage to be greater than 240,000, and the true mileage is unknown.",
            "The seller states that the air conditioning system does not function, and that a Mk3 condenser would be required for the system to work.",
            "The seller notes that the power steering pump occasionally emits a groaning noise at cold start.",
            "Crack in windshield",
            "Ding in front of passenger-side rear wheel, some door dings",
            "Worn paint on corner below driver-side tail light and below rear bumper trim",
            "Various stone chips",
            "Worn pinstripes",
            "Dry-rotted rain gutter seals",
            "Rear VW badge removed (included in the sale)",
            "Jack point covers missing",
            "Radio antenna missing",
            "Wear on driver seat lower outer bolster, tears in passenger seat upper inner bolster",
            "Cracks in dashboard",
            "Broken driver door sill cover",
            "Area of separated fabric on driver and rear passenger-side door panels, indentations in rear door panels",
            "Worn rear tires"
        ],
        "services": [
            "Transmission rebuilt",
            "Power steering pump, power steering rack, clutch master cylinder, tie rod ends, ball joints, thermostat, thermostat housing, coolant output flange, battery, radiator shroud, engine cooling fan, valve cover gasket, brake pads, rotors, and shoes, rear brake cylinders, lower control arms, axle boots, engine mounts, fuel level sending unit, fuel lines, fuel filter, and front and rear wheel bearings replaced",
            "Koni coilovers, 02J shift tower, Recaro Trophy front seats, 2.5-inch stainless steel exhaust system, Mk3 fuel tank and pump, and ARP wheel studs installed"
        ],
        "included_items": [
            "1 key",
            "Parts receipts",
            "Factory seats",
            "Radio delete plate",
            "Spare transmission",
            "Rear VW emblem"
        ],
        "ownership_history": "The seller acquired this Jetta in July 2021.",
        "auction_stats": {
            "reserve_status": "No reserve",
            "auction_status": "Sold to",
            "highest_bid_value": "$7,000",
            "auction_date": "Mar 20, 2023 11:34 PM",
            "view_count": "9,729",
            "bid_count": "12",
            "bids": [
                "$7,000",
                "$6,700",
                "$6,500",
                "$6,000",
                "$5,500",
                "$3,800",
                "$3,600",
                "$3,500",
                "$3,000",
                "$1,234",
                "$1,111",
                "$777"
            ]
        }
    },
    "https://carsandbids.com/auctions/9WxZ6Vx5/2017-bmw-330i-xdrive-sports-wagon": {
        "auction_title": "2017 BMW 330i xDrive Sports Wagon",
        "auction_subtitle": "M Sport Package, $15,330 in Options, Some Modifications",
        "auction_quick_facts": {
            "Make": "BMW",
            "Model": "330i\nSave",
            "Mileage": "78,500",
            "VIN": "WBA8K3C50HK679397",
            "Title Status": "Clean (PA)",
            "Location": "Norristown, PA 19401",
            "Seller": "LuisFromCarsNBids",
            "Engine": "2.0L Turbocharged I4",
            "Drivetrain": "4WD/AWD",
            "Transmission": "Automatic (8-Speed)",
            "Body Style": "Wagon",
            "Exterior Color": "Glacier Silver Metallic",
            "Interior Color": "Coral Red",
            "Seller Type": "Private Party"
        },
        "dougs_take": "The F31 BMW 3 Series is a desirable car, touting BMW performance and handling with added wagon practicality – and these are becoming especially desirable, as BMW no longer offers a 3 Series wagon in its U.S. lineup. This particular 330i Sports Wagon is highly equipped with xDrive all-wheel-drive, the M Sport, Driving Assistance, Lighting, Premium, Cold Weather, and Track Handling packages, and an attractive Coral Red interior. We love BMW wagons here on Cars & Bids, and it's great to see one return to us for another exciting auction!",
        "auction_highlights": [
            "The attached Carfax history report indicates no mileage discrepancies in this 330i's past.",
            "According to the Monroney Label pictured in the photo gallery, this 330i had an original MSRP of $59,275 and came equipped with the M Sport, Driving Assistance, Lighting, Premium, Cold Weather, and Track Handling packages, 18-inch alloy wheels, a panoramic sunroof, Coral Red leather upholstery, a navigation system, and more as detailed below.",
            "Modifications reported by the seller include an aftermarket charge pipe, a Cobra Sport quad-exit exhaust, an aftermarket front lip spoiler and M3-style rear diffuser, and tinted windows.",
            "BMW launched the sixth-generation 3 Series for the 2012 model year. Called F30 internally, it was slightly bigger and more spacious than its predecessor, and it offered buyers a much more up-to-date interior. 2016 brought a mid-cycle update that included subtle styling tweaks, a widely praised redesigned suspension, and a revised steering system. This 330i xDrive benefits from all of these updates.",
            "Power for this 330i comes from a 2.0-liter turbocharged inline-4 engine, rated at 248 horsepower and 258 lb-ft of torque in stock form. According to Dinan, the Dinantronics Sport Tuner increases those figures to up to 273 horsepower and 308 lb-ft of torque, but a dyno sheet for this specific 330xi was not provided to confirm. Output is sent to all four wheels via an 8-speed automatic transmission and BMW's xDrive all-wheel-drive system."
        ],
        "auction_equipment": [
            "M Sport Package (adaptive M suspension, sport seats, aluminum hex interior trim, LED fog lights, M steering wheel, M aerodynamic kit, Shadowline exterior trim, Anthracite headliner)",
            "Premium Package (keyless entry, lumbar support, Sirius radio capabilities)",
            "Track Handling Package (M sport brakes, variable sport steering)",
            "Driving Assistance Package (rear-view camera, Park Distance Control)",
            "Driving Assistance Plus Package (Active Blind Spot Detection, Active Driving Assistant, side- and top-view cameras)",
            "Cold Weather Package (heated steering wheel, heated front and rear seats)",
            "Lighting Package (adaptive LED headlights, auto-high beam)",
            "18-inch alloy wheels",
            "Increased top speed limiter",
            "Black kidney grilles",
            "Roof rails",
            "Panoramic sunroof",
            "Coral Red leather upholstery",
            "Rear side window sunshades",
            "Dual-zone automatic climate control",
            "Hi-Fi sound system",
            "Navigation system",
            "Touchless-opening rear liftgate"
        ],
        "modifications": [
            "Dinan Dinantronics Sport Tuner",
            "Aftermarket charge pipe",
            "Cobra Sport quad-exit exhaust",
            "Aftermarket front lip spoiler",
            "Aftermarket M3-style rear diffuser",
            "Tinted windows"
        ],
        "known_flaws": [
            "The attached Carfax history report notes that this 330i was involved in an accident that resulted in \"minor damage\" to the right-front in October 2018. The seller states that the front bumper appears to have been repainted as a result.",
            "The Carfax report also indicates that this 330i was involved in an accident in June 2022. The seller states that this is due to filing a police report to investigate scratches on the rear bumper the seller thought might have occurred in a parking lot, but the seller later determined that the scratches had been present on the vehicle since he acquired it.",
            "Various scratches and chips as seen in gallery photos",
            "Holes drilled in the front bumper for a front license plate",
            "Scuffs on lower front bumper and front lip; crack in front lip (pictured in the gallery)",
            "Cracked paint on the rear bumper (pictured in the gallery)",
            "Curb rash on wheels",
            "Creases on driver’s seat bolsters",
            "Some scratches and wear on interior trim and touch points",
            "Some rust on undercarriage brackets and fasteners"
        ],
        "services": [
            "March 2022 (69,891 miles): Rear tires replaced",
            "November 2021 (65,785 miles): Front tires replaced",
            "November 2021 (65,320 miles): Engine oil and filter changed, brake fluid flushed",
            "May 2021 (59,931 miles): Spark plug(s), front brakes, and cabin air filter replaced, engine oil and filter changed",
            "December 2020 (53,437 miles): Engine oil and filter changed",
            "October 2020 (49,625 miles): Wiper(s) replaced",
            "February 2020 (43,894 miles): Evaporative emissions vent purge valve replaced",
            "February 2020 (43,660 miles): Engine oil and filter changed, four-wheel alignment performed, tire(s) and engine air filter replaced, cabin air filter replaced/cleaned",
            "April 2019 (31,283 miles): Engine oil and filter changed",
            "August 2018 (19,743 miles): Engine oil and filter changed, cabin air filter replaced/cleaned, battery replaced",
            "May 2018: Computer reprogrammed",
            "March 2018: Boost sensor replaced",
            "January 2023: Right-front strut, right-front wheel, and parking brake guides replaced",
            "August 2022: Bushings replaced, engine oil and filter changed",
            "July 2022: Coolant vent line replaced under recall"
        ],
        "included_items": [
            "2 keys",
            "Owner's manuals",
            "Monroney Label",
            "Available service records",
            "BMW roof rack",
            "BMW rubber floor mats",
            "Factory exhaust and diffuser",
            "Spare side mirror turn signal lights, mudflaps, and kidney grilles"
        ],
        "ownership_history": "The seller purchased this 330i on Cars & Bids in March 2022 and has added approximately 8,900 miles since. The previous auction can be viewed here.",
        "auction_stats": {
            "reserve_status": "Reserve",
            "auction_status": "Sold to",
            "highest_bid_value": "$27,555",
            "auction_date": "Mar 20, 2023 11:26 PM",
            "view_count": "11,023",
            "bid_count": "18",
            "bids": [
                "$27,555",
                "$27,000",
                "$26,000",
                "$25,000",
                "$22,000",
                "$21,500",
                "$21,000",
                "$20,500",
                "$20,250",
                "$20,000",
                "$18,000",
                "$17,330",
                "$14,000",
                "$12,000",
                "$10,000",
                "$7,000",
                "$6,000",
                "$5,000"
            ]
        }
    },
    "https://carsandbids.com/auctions/KVqzBpoM/2005-mercedes-benz-c55-amg": {
        "auction_title": "2005 Mercedes-Benz C55 AMG",
        "auction_subtitle": "NO RESERVE Naturally-Aspirated V8 Power, Some Modifications, California-Owned",
        "auction_quick_facts": {
            "Make": "Mercedes-Benz",
            "Model": "C55 AMG\nSave",
            "Mileage": "123,900",
            "VIN": "WDBRF76JX5F636541",
            "Title Status": "Clean (CA)",
            "Location": "Simi Valley, CA 93063",
            "Seller": "ssprle",
            "Engine": "5.4L V8",
            "Drivetrain": "Rear-wheel drive",
            "Transmission": "Automatic (5-Speed)",
            "Body Style": "Sedan",
            "Exterior Color": "Diamond Black Metallic",
            "Interior Color": "Black",
            "Seller Type": "Private Party"
        },
        "dougs_take": "The W203 Mercedes-Benz C55 AMG is a desirable sport sedan that boasts a 5.4-liter V8 rated at 362 horsepower (a big number for a relatively small car!), a low-key exterior design, AND better handling than you might expect. It's also hard to find, as these were only sold in 2005 and 2006. This C55 AMG touts a clean, accident-free Carfax report for peace of mind, and it has been California-owned since new. It also features some modifications, though they're relatively minor – and it wouldn't take much to bring this car back to stock if that's what you're after. No reserve further enhances this C55's appeal.",
        "auction_highlights": [
            "The attached Carfax history report lists no accidents in this sedan's past. It also shows that this C-Class has been California-owned since new.",
            "Factory equipment includes an AMG-specific body kit, fog lights, a sunroof, heated and power-adjustable front sport seats, and a rear sunshade, according to a build sheet pictured in the gallery. Modifications reported by the seller include 18-inch Enkei PF01 wheels, tinted LED rear lights, tinted windows, and a 9-inch Xtrons touchscreen with Apple CarPlay and Android Auto compatibility.",
            "Launched for 2005 to replace the supercharged V6-powered C32, the C55 was the quickest and most powerful variant of the \"W203\" C-Class. It benefited from a naturally-aspirated V8, bigger brakes, and a firmer suspension system, among other performance-oriented modifications. Its exterior design remained relatively subtle. Mercedes-Benz sold 1,299 units of the C55 for 2005 and 451 units for 2006, according to enthusiast website MB World, bringing the total number to 1,750.",
            "Power comes from a 5.4-liter V8, rated at 362 horsepower and 376 lb-ft of torque. Called \"M113\" internally, it spins the rear wheels via a 5-speed automatic transmission."
        ],
        "auction_equipment": [
            "AMG-specific body kit",
            "Bi-xenon headlights",
            "Fog lights",
            "Sunroof",
            "Leather upholstery",
            "Heated and power-adjustable front sport seats",
            "Memory function for the front passengers",
            "Power-adjustable steering column",
            "Rear sunshade",
            "Air conditioning"
        ],
        "modifications": [
            "18-inch Enkei PF01 wheels",
            "Clear paint protection film on part of the front end",
            "\"AMG\" emblem on the hood",
            "Clear side-marker lights",
            "Tinted LED rear lights",
            "Black \"Mercedes-Benz\" emblem on the trunk lid",
            "Tinted windows",
            "Phone mount on the dashboard",
            "9-inch Xtrons touchscreen with Apple CarPlay and Android Auto compatibility",
            "Rear-view camera"
        ],
        "known_flaws": [
            "Exterior chips and scratches (shown in the gallery)",
            "Some wear on the driver's seat bolsters",
            "Scratches in the driver's window's tint",
            "The \"Tele Aid Malfunction\" message appears in the instrument cluster",
            "Passenger-side steering rack boot torn"
        ],
        "services": [
            "March 2023: Front tires replaced",
            "April 2022 (~120,600 miles): Radiator, expansion tank, upper radiator hose, front and rear brake pads and front and rear brake rotors replaced",
            "November 2021: Battery replaced",
            "February 2021 (~120,300 miles): Secondary air pump replaced",
            "December 2019 (~110,000 miles): Transmission serviced and transmission valve body replaced",
            "November 2019 (~109,000 miles): Alternator replaced",
            "May 2019 (~100,500 miles): Crankshaft position sensor replaced"
        ],
        "included_items": [
            "2 keys",
            "Owner's manuals",
            "Service records",
            "Rubber floor and trunk mats"
        ],
        "ownership_history": "The seller purchased this C55 in December 2016.",
        "auction_stats": {
            "reserve_status": "No reserve",
            "auction_status": "Sold to",
            "highest_bid_value": "$12,700",
            "auction_date": "Mar 20, 2023 11:20 PM",
            "view_count": "7,519",
            "bid_count": "39",
            "bids": [
                "$12,700",
                "$12,600",
                "$12,500",
                "$12,350",
                "$12,250",
                "$12,150",
                "$12,050",
                "$11,950",
                "$11,850",
                "$11,750",
                "$11,650",
                "$11,550",
                "$11,450",
                "$11,350",
                "$11,250",
                "$11,055",
                "$10,955",
                "$10,855",
                "$10,755",
                "$10,655",
                "$10,555",
                "$10,100",
                "$10,000",
                "$8,955",
                "$8,500",
                "$7,500",
                "$3,600",
                "$3,500",
                "$3,000",
                "$2,900",
                "$2,500",
                "$1,745",
                "$1,645",
                "$1,544",
                "$1,203",
                "$400",
                "$300",
                "$200",
                "$100"
            ]
        }
    },
    "https://carsandbids.com/auctions/rGeAadM2/2012-lamborghini-aventador-lp700-4-coupe": {
        "auction_title": "2012 Lamborghini Aventador LP700-4 Coupe",
        "auction_subtitle": "~5,500 Miles, 1 Owner, 691-hp V12, Arancio Argos",
        "auction_quick_facts": {
            "Make": "Lamborghini",
            "Model": "Aventador\nSave",
            "Mileage": "5,500",
            "VIN": "ZHWUC1ZD7CLA00787",
            "Title Status": "Clean (KS)",
            "Location": "Stilwell, KS 66085",
            "Seller": "Grasutu",
            "Engine": "6.5L V12",
            "Drivetrain": "4WD/AWD",
            "Transmission": "Automatic (7-Speed)",
            "Body Style": "Coupe",
            "Exterior Color": "Arancio Argos",
            "Interior Color": "Black/Orange",
            "Seller Type": "Dealer"
        },
        "dougs_take": "When the word supercar pops into your mind, don't you picture a brightly-colored Lamborghini? The Aventador is an archetypical supercar through and through, boasting a gorgeous wedge-shaped design, breathtaking performance, and a monstrous mid-engine V12. This particular Aventador is a one-owner example with just 5,500 miles, and it's finished in head-turning Arancio Argos. It also boasts some desirable equipment, including a transparent engine cover, a front axle lift system, and heated seats. Other benefits include a clean, accident-free Carfax report and a reported extensive service, which should provide some peace of mind to the next owner. These big Lambos are hugely fun to drive (and to look at!), and I’m thrilled to offer this Aventador on Cars & Bids!",
        "auction_highlights": [
            "The odometer currently displays approximately 5,500 miles.",
            "The attached Carfax history report shows no accidents or mileage discrepancies in this Aventador’s past. It also confirms that this is a 1-owner car.",
            "Factory equipment includes 19-inch front and 20-inch rear wheels, a front axle lift system, a transparent engine cover, extended leather upholstery with contrast stitching, power-adjustable and heated seats, a navigation system, and more as listed below. Modifications reported by the selling dealer are limited to a removable windshield decal.",
            "Released for 2012, the Aventador was the latest in a long line of mid-engined, V12-powered Lamborghini supercars that began with the Miura. It wore a more chiseled exterior design than the Murciélago it replaced, it gained new tech features, and it offered enthusiasts a generous bump in power. Production of the Aventador ended in 2022.",
            "Power comes from a 6.5-liter V12, rated at 691 horsepower and 509 lb-ft of torque. It spins the four wheels via a 7-speed \"Independent Shift Rod\" automatic transmission."
        ],
        "auction_equipment": [
            "19-inch front, 20-inch rear wheels",
            "Front axle lift system",
            "Transparent engine cover",
            "Extended leather upholstery",
            "Contrast stitching",
            "Power-adjustable and heated seats",
            "Navigation system",
            "Dual-zone automatic climate control",
            "Front and rear parking sensors",
            "Rear-view camera"
        ],
        "modifications": [
            "Windshield decal"
        ],
        "known_flaws": [
            "Some creases on the driver seat’s cushion"
        ],
        "services": [
            "November 2022 (5,131 miles): Engine oil and filter changed, battery replaced, four tires mounted and balanced, four-wheel alignment performed, tire condition and pressure checked"
        ],
        "included_items": [
            "1 key",
            "Owner's manual and factory literature",
            "Battery tender"
        ],
        "ownership_history": "The selling dealer acquired this Aventador in February 2023 and added 100 miles since.",
        "auction_stats": {
            "reserve_status": "Reserve",
            "auction_status": "Reserve not met, bid to",
            "highest_bid_value": "$272,500",
            "auction_date": "Mar 20, 2023 11:02 PM",
            "view_count": "16,741",
            "bid_count": "28",
            "bids": [
                "$272,500",
                "$272,000",
                "$271,500",
                "$271,000",
                "$270,000",
                "$260,000",
                "$255,000",
                "$250,000",
                "$245,000",
                "$233,000",
                "$232,000",
                "$231,000",
                "$230,500",
                "$230,000",
                "$222,222",
                "$221,500",
                "$220,500",
                "$220,000",
                "$212,212",
                "$210,000",
                "$200,000",
                "$102,102",
                "$100,500",
                "$100,000",
                "$1,313",
                "$1,212",
                "$1,100",
                "$1,000"
            ]
        }
    },
    "https://carsandbids.com/auctions/9nXxQVYv/1998-porsche-boxster": {
        "auction_title": "1998 Porsche Boxster",
        "auction_subtitle": "NO RESERVE 5-Speed Manual, Unmodified, Accident-Free Carfax Report",
        "auction_quick_facts": {
            "Make": "Porsche",
            "Model": "Boxster\nSave",
            "Mileage": "72,300",
            "VIN": "WP0CA2981WU623014",
            "Title Status": "Clean (DE)",
            "Location": "King Of Prussia, PA 19406",
            "Seller": "MotorcarsOfTheMainLine",
            "Engine": "2.5L Flat-6",
            "Drivetrain": "Rear-wheel drive",
            "Transmission": "Manual (5-Speed)",
            "Body Style": "Convertible",
            "Exterior Color": "Arctic Silver Metallic",
            "Interior Color": "Black",
            "Seller Type": "Dealer"
        },
        "dougs_take": "The 986 Porsche Boxster is a fantastic sports car with excellent handling and balance thanks to its mid-engine layout – and it offers some of the best value in the Porsche world. This particular Boxster features the desirable 5-speed manual transmission, and it's finished in a classic color combination. It also touts reasonably low mileage for the year, and it's entirely unmodified – both great benefits. Plus, this Boxster comes with a clean, accident-free Carfax report – AND it's offered with the thrill of no reserve.",
        "auction_highlights": [
            "This Boxster features the desirable 5-speed manual transmission.",
            "The attached Carfax history report shows no accidents or mileage discrepancies in this Porsche's past.",
            "Factory equipment includes 17-inch wheels, leather upholstery, power-adjustable seats, automatic climate control, and a CD player. The selling dealer reports no modifications.",
            "Called 986 internally, the first-generation Boxster was introduced for 1997 as Porsche's long-awaited entry-level model. It was immediately well-received by driving enthusiasts; some even called it a better overall platform than the 911 thanks to its mid-mounted engine. In hindsight, it's one of the cars that saved Porsche from an uncertain fate.",
            "Power comes from a 2.5-liter flat-6, rated at 201 horsepower and 181 lb-ft of torque. Output is sent to the rear wheels via a 5-speed manual transmission."
        ],
        "auction_equipment": [
            "17-inch alloy wheels",
            "Power-retractable soft top",
            "Leather upholstery",
            "Power-adjustable seats",
            "Power windows and door locks",
            "CDR-210 radio with CD player",
            "Automatic climate control",
            "Traction control",
            "Cruise control"
        ],
        "modifications": [],
        "known_flaws": [
            "Scratches, chips, and other paint imperfections around the exterior (pictured in the gallery)",
            "Cracked paint on the front bumper",
            "Scuffs beneath the front bumper",
            "Faded paint on passenger's side quarter panel (pictured in the gallery)",
            "Wear on the windshield molding",
            "Some chips on the wheels",
            "Tires bear 2018 date codes",
            "Creases and wear on the seats",
            "Wear on interior touch points",
            "A technician's note from March 2023 indicates that the rear end links \"have a little play in the ball joints.\""
        ],
        "services": [],
        "included_items": [
            "3 keys, 1 valet key",
            "Owner's manuals",
            "Wind deflector",
            "Car cover"
        ],
        "ownership_history": "The selling dealer acquired this Boxster in March 2023 and has added minimal mileage to it.",
        "auction_stats": {
            "reserve_status": "No reserve",
            "auction_status": "Sold to",
            "highest_bid_value": "$10,900",
            "auction_date": "Mar 20, 2023 10:54 PM",
            "view_count": "5,339",
            "bid_count": "5",
            "bids": [
                "$10,900",
                "$9,986",
                "$2,986",
                "$1,986",
                "$986"
            ]
        }
    },
    "https://carsandbids.com/auctions/3gnjXa2E/2011-ford-mustang-shelby-gt500-coupe": {
        "auction_title": "2011 Ford Mustang Shelby GT500 Coupe",
        "auction_subtitle": "~25,900 Miles, 6-Speed Manual, SVT Track Pack, Mostly Unmodified",
        "auction_quick_facts": {
            "Make": "Ford",
            "Model": "Mustang\nSave",
            "Mileage": "25,900",
            "VIN": "1ZVBP8JS1B5105037",
            "Title Status": "Clean (ON, Canada)",
            "Location": "Waterdown, ON, Canada",
            "Seller": "Bulletproofauto",
            "Engine": "5.4L Supercharged V8",
            "Drivetrain": "Rear-wheel drive",
            "Transmission": "Manual (6-Speed)",
            "Body Style": "Coupe",
            "Exterior Color": "Black",
            "Interior Color": "Charcoal Black",
            "Seller Type": "Dealer"
        },
        "dougs_take": "The Shelby GT500 is one of the most desirable variants of the S197-generation Ford Mustang, as it boasts a design that's both muscular and retro – AND a 5.4-liter supercharged V8 rated at 550 horsepower. This GT500 boasts the SVT Track Pack, reasonably low indicated mileage, and no major modifications. It also touts a 6-speed manual transmission with a cool heritage-inspired shift knob, and the clean, accident-free Carfax report further enhances this GT500's appeal. These are becoming increasingly desired by collectors, and this example looks like it has been nicely kept.",
        "auction_highlights": [
            "This is a Canadian-market Mustang, and its odometer can be set to display miles or kilometers. It currently shows approximately 25,900 miles.",
            "The attached Carfax history report lists no accidents or mileage inconsistencies in this car's past.",
            "Factory equipment includes the SVT Track Pack, a Shelby-specific body kit, a glass roof panel, leather upholstery, a power-adjustable driver's seat, and a navigation system. Modifications reported by the seller include MBRP parts in the exhaust system and tinted windows.",
            "Called S197 internally, the fifth-generation Mustang launched for 2005 with a heritage-laced design, a new platform, and an available 24-valve V8 engine. Extending the wheelbase gave the Mustang a much more compliant ride than its predecessor, though it remained true to the pony car ethos that characterized the original model. Production ended in 2014, when the S197 passed the torch to the current-generation Mustang.",
            "Ford rekindled ties with Shelby to transform what was envisioned as a replacement for the Mustang Cobra into a 21st-century GT500. Massive power, huge brakes, and heritage-laced styling cues were part of the package.",
            "Power comes from a 5.4-liter supercharged V8, rated at 550 horsepower and 510 lb-ft of torque. It spins the rear wheels via a 6-speed manual transmission."
        ],
        "auction_equipment": [
            "SVT Track Pack (19-inch front and 20-inch rear wheels, 3.73-ratio limited-slip axle, exterior stripes removed, and Shelby rear spoiler)",
            "Shelby-specific body kit",
            "Fog lights",
            "Glass roof panel",
            "Leather upholstery",
            "Power-adjustable driver's seat",
            "Power-adjustable steering column",
            "Dual-zone climate control system",
            "Touchscreen-based infotainment system",
            "CD player",
            "Shaker sound system",
            "Navigation system"
        ],
        "modifications": [
            "K&N Engineering intake system",
            "MBRP parts in the exhaust system",
            "Tinted windows"
        ],
        "known_flaws": [
            "Scratches on the front bumper",
            "Filled chip in the windshield",
            "Scratches on the driver-side front wheel",
            "The tires need to be replaced and bear date codes from 2018."
        ],
        "services": [
            "February 2023 (25,817 miles/41,548 kilometers): Engine oil and filter changed",
            "May 2019 (14,425 miles/23,215 kilometers): Four tires mounted"
        ],
        "included_items": [
            "1 key",
            "Owner's manual",
            "Service records",
            "Ford-issued certificate of authenticity",
            "Car cover"
        ],
        "ownership_history": "The selling dealer purchased this Mustang in 2023.",
        "auction_stats": {
            "reserve_status": "Reserve",
            "auction_status": "Reserve not met, bid to",
            "highest_bid_value": "$27,500",
            "auction_date": "Mar 20, 2023 10:46 PM",
            "view_count": "6,974",
            "bid_count": "5",
            "bids": [
                "$27,500",
                "$27,000",
                "$25,000",
                "$20,000",
                "$2,011"
            ]
        }
    },
    "https://carsandbids.com/auctions/9aN0JMmE/2006-toyota-4runner-sr5-4x4": {
        "auction_title": "2006 Toyota 4Runner SR5 4x4",
        "auction_subtitle": "NO RESERVE 1 Owner, V6 Power, 4WD, Locking Center Differential, Mostly Unmodified",
        "auction_quick_facts": {
            "Make": "Toyota",
            "Model": "4Runner\nSave",
            "Mileage": "208,400",
            "VIN": "JTEBU14R260084483",
            "Title Status": "Clean (MD)",
            "Location": "Hagerstown, MD 21740",
            "Seller": "lanierchris",
            "Engine": "4.0L V6",
            "Drivetrain": "4WD/AWD",
            "Transmission": "Automatic (5-Speed)",
            "Body Style": "SUV/Crossover",
            "Exterior Color": "Shadow Mica",
            "Interior Color": "Stone",
            "Seller Type": "Dealer ($40 Temporary Tag)"
        },
        "dougs_take": "The fourth-generation Toyota 4Runner is a fantastic SUV that boasts excellent reliability, great trail capabilities, and a handsome, rugged design. This particular 4Runner is finished in handsome Shadow Mica, and it touts the off-roading essentials – 4-wheel drive, a locking center differential, and Toyota's bulletproof 1GR-FE 4.0-liter V6 engine. Other benefits include a set of 32-inch Falken Wildpeak tires and a Carfax report that shows only one previous owner. Plus, this 4Runner is offered with no reserve, which should make for an exciting auction finish!",
        "auction_highlights": [
            "The attached Carfax history report shows no mileage discrepancies; it also shows that this 4Runner has been registered to one owner since new.",
            "According to the build sheet provided in the gallery, factory equipment includes 17-inch wheels, a Torsen locking center differential, running boards, a power rear window, cloth upholstery, remote keyless entry, and Downhill Assist Control (DAC).",
            "Modifications reported by the selling dealer are limited to 32-inch Falken Wildpeak tires, a Boss Audio Systems multimedia player, an overhead rear entertainment screen, and tinted windows.",
            "The fourth-generation 4Runner arrived for 2003, and it was larger, more powerful, and generally more refined than the model it replaced. Toyota significantly bucked the industry's trend towards car-like crossovers and let the 4Runner keep its rugged body-on-frame construction, an architecture later shared with the FJ Cruiser. Production ended in 2009.",
            "Power comes from a 4.0-liter \"1GR-FE\" V6 engine, rated at 236 horsepower and 266 lb-ft of torque. Output is sent to the rear or all four wheels via a 5-speed automatic transmission and a 2-speed transfer case."
        ],
        "auction_equipment": [
            "17-inch wheels",
            "Torsen locking center differential",
            "Fog lights",
            "Running boards",
            "Trailer hitch receiver",
            "Roof rails",
            "Power rear window",
            "Cloth upholstery",
            "Automatic climate control system",
            "Remote keyless entry",
            "Downhill Assist Control (DAC)",
            "Hill Start Assist Control (HAC)",
            "Cruise control"
        ],
        "modifications": [
            "32-inch Falken Wildpeak A/T3W tires",
            "Boss Audio Systems BV2950TU multimedia player",
            "Overhead rear entertainment screen",
            "Tinted windows"
        ],
        "known_flaws": [
            "The attached Carfax history report indicates that this 4Runner sustained \"minor damage\" to the rear, left rear, and left side in September 2019 following a sideswipe collision with another motor vehicle, and \"minor damage\" to the rear in June 2006 following a rear-end collision with another motor vehicle.",
            "Headlights and fog lights are hazy",
            "Chips and scratches around the exterior",
            "Ding on the passenger's side quarter panel",
            "Passenger's side taillight is cracked",
            "Paint damage on the rear bumper",
            "Scratches on wheels",
            "Wear on interior panels and touch points",
            "Stains on carpets",
            "Some corrosion on underbody components and brake hardware",
            "TPMS warning light stays illuminated"
        ],
        "services": [
            "September 2022 (204,615 miles): Engine oil and filter changed",
            "May 2021 (194,152 miles): Engine oil and filter changed, induction system serviced"
        ],
        "included_items": [
            "2 keys, 2 remotes",
            "Owner's manual"
        ],
        "ownership_history": "The selling dealer acquired this 4Runner in February 2023.",
        "auction_stats": {
            "reserve_status": "No reserve",
            "auction_status": "Sold to",
            "highest_bid_value": "$8,350",
            "auction_date": "Mar 20, 2023 10:41 PM",
            "view_count": "9,929",
            "bid_count": "25",
            "bids": [
                "$8,350",
                "$8,250",
                "$8,129",
                "$7,777",
                "$7,657",
                "$7,557",
                "$7,400",
                "$7,300",
                "$7,169",
                "$7,069",
                "$6,969",
                "$6,700",
                "$6,600",
                "$6,500",
                "$6,400",
                "$6,300",
                "$6,000",
                "$5,900",
                "$5,800",
                "$5,600",
                "$5,500",
                "$5,100",
                "$5,000",
                "$4,900",
                "$4,420"
            ]
        }
    },
    "https://carsandbids.com/auctions/r4v52MD3/2022-ford-bronco-wildtrak": {
        "auction_title": "2022 Ford Bronco Wildtrak",
        "auction_subtitle": "EcoBoost V6, 4WD, Roush Intake and Exhaust System",
        "auction_quick_facts": {
            "Make": "Ford",
            "Model": "Bronco\nSave",
            "Mileage": "3,700",
            "VIN": "1FMDE5CP2NLB37998",
            "Title Status": "Clean (CA)",
            "Location": "Azusa, CA 91702",
            "Seller": "ivanmx86",
            "Engine": "2.7L Turbocharged V6",
            "Drivetrain": "4WD/AWD",
            "Transmission": "Automatic (10-Speed)",
            "Body Style": "SUV/Crossover",
            "Exterior Color": "Race Red",
            "Interior Color": "Sandstone/Black",
            "Seller Type": "Private Party"
        },
        "dougs_take": "There's a lot to like about the new Ford Bronco, and this example boasts a desirable configuration. It's a two-door model with the 2.7-liter EcoBoost V6, and it's finished in eye-catching Race Red. It also features some nice equipment like the Sasquatch and Mid packages, and the really cool Wildtrak bodyside graphics – plus, it touts a Roush intake and exhaust system, along with Baja Designs A-pillar and fog lights. This Bronco is also offered with a clean, accident-free Carfax report, further adding to the appeal.",
        "auction_highlights": [
            "The attached Carfax vehicle history report shows no accidents in this Bronco's past.",
            "A window sticker is provided in the photo gallery showing an MSRP of $51,895 when new. Notable equipment includes 17-inch aluminum beadlock-capable wheels with 35-inch tires, front and rear locking differentials, Bilstein shocks, LED headlights, Wildtrak bodyside graphics, a removable hardtop, dual-zone automatic climate control, a Terrain Management System with G.O.A.T. modes, a SYNC 4 infotainment system, blind-spot monitoring, lane-keeping assist, and automatic emergency braking.",
            "Modifications include a Roush intake, a Roush exhaust system, a Turbosmart blow-off valve, and Baja Designs Squadron A-pillar lights and yellow fog lights.",
            "The sixth-generation Bronco was introduced for the 2021 model year, ending a 25-year hiatus and nearly a decade of speculation about its return. Retro styling, body-on-frame construction, and a suite of off-road equipment help ensure this truck lives up to the Bronco name. It's not all old-school, however; modern features like an available 12-inch touchscreen and a wireless phone charger bring it into the 21st century.",
            "Power comes from a 2.7-liter twin-turbocharged EcoBoost V6, rated at up to 330 horsepower and 415 lb-ft of torque when using premium fuel, according to Ford. Output is sent to the rear or all four wheels via a 10-speed automatic transmission and a 2-speed transfer case."
        ],
        "auction_equipment": [
            "Sasquatch Package (17-inch aluminum beadlock-capable wheels, 35-inch tires, front and rear locking differentials, 4.7:1 final drive ratio, Bilstein shocks, and high-clearance fender flares)",
            "Mid Package (intelligent access with lock and unlock, heated front seats, remote start system, 110-volt outlet in the rear center floor console, illuminated vanity mirrors, ambient footwell lighting, dual-zone automatic climate control system, rear parking sensors, automatic high beams, blind-spot monitoring system with cross-traffic alert, lane-keeping assist, and pre-collision assist with automatic emergency braking)",
            "LED headlights",
            "Wildtrak bodyside graphics",
            "Removable hardtop",
            "8-inch digital display inside instrument cluster",
            "Terrain Management System with G.O.A.T. modes",
            "Auxiliary switches with pre-wiring",
            "SYNC 4 8-inch infotainment system"
        ],
        "modifications": [
            "Roush intake",
            "Roush exhaust system",
            "Turbosmart blow-off valve",
            "Baja Designs Squadron A-pillar lights and yellow fog lights",
            ".50 cal-style radio antenna",
            "Stickers shown in gallery"
        ],
        "known_flaws": [
            "Some scuffs on interior plastics"
        ],
        "services": [
            "September 2022 (2,197 miles): Maintenance inspection completed, recommended maintenance performed, tire condition and pressure checked",
            "September 2022 (1,765 miles): Maintenance inspection completed, tire condition and pressure checked"
        ],
        "included_items": [
            "2 sets of keys",
            "Owner's manual",
            "Window sticker",
            "Tool kit",
            "Factory exhaust components"
        ],
        "ownership_history": "The seller purchased this Bronco new in August 2022.",
        "auction_stats": {
            "reserve_status": "Reserve",
            "auction_status": "Sold to",
            "highest_bid_value": "$57,022",
            "auction_date": "Mar 20, 2023 10:31 PM",
            "view_count": "5,611",
            "bid_count": "30",
            "bids": [
                "$57,022",
                "$55,522",
                "$55,022",
                "$54,522",
                "$54,022",
                "$53,522",
                "$53,022",
                "$52,522",
                "$52,022",
                "$50,522",
                "$50,022",
                "$49,272",
                "$49,022",
                "$48,272",
                "$48,022",
                "$47,550",
                "$43,022",
                "$42,500",
                "$42,022",
                "$38,500",
                "$37,420",
                "$37,000",
                "$36,000",
                "$30,000",
                "$23,000",
                "$20,000",
                "$10,111",
                "$10,000",
                "$2,200",
                "$2,100"
            ]
        }
    },
    "https://carsandbids.com/auctions/KPGQgR17/2011-bmw-m3-convertible": {
        "auction_title": "2011 BMW M3 Convertible",
        "auction_subtitle": "V8 Power, Interlagos Blue Metallic, Mostly Unmodified",
        "auction_quick_facts": {
            "Make": "BMW",
            "Model": "M3\nSave",
            "Mileage": "90,200",
            "VIN": "WBSDX9C59BE399336",
            "Title Status": "Clean (VA)",
            "Location": "Manassas, VA 20111",
            "Seller": "kmr2288",
            "Engine": "4.0L V8",
            "Drivetrain": "Rear-wheel drive",
            "Transmission": "Automatic (7-Speed)",
            "Body Style": "Convertible",
            "Exterior Color": "Interlagos Blue Metallic",
            "Interior Color": "Palladium Silver",
            "Seller Type": "Private Party"
        },
        "dougs_take": "BMW's E9X-generation M3 has built up a cult following, largely thanks to its 4.0-liter V8 – it's the first, last, and only M3 powered by a V8. This particular M3 touts a gorgeous color combination – Interlagos Blue Metallic with a Palladium Silver interior – and it's been with its current owner since 2014, which is a great benefit. This M3 is also a convertible model, so you can especially enjoy the engine note with the roof down – and it's largely unmodified, with a clean, accident-free Carfax report adding buyer confidence.",
        "auction_highlights": [
            "The attached Carfax history report shows no accidents or mileage discrepancies in this M3’s past. It also shows that it's been registered to its current owner since 2014.",
            "A build sheet is provided in the photo gallery, and a partial list of notable equipment includes 19-inch Style 220M wheels, a variable M differential lock, a power-operated hardtop, Novillo leather upholstery and carbon fiber interior trim, heated and power-adjustable front seats, a navigation system, and more as detailed below. Modifications reported by the seller are limited to a tow hook-mounted front license plate bracket and tinted windows.",
            "BMW engineers had to balance horsepower and weight as they developed the first and only M3 equipped with a V8 engine. Released for 2008, and based on the E90-generation 3 Series, it won over skeptical enthusiasts by offering performance that approached supercar levels in a practical, daily-drivable, and relatively subtle package. Sedan, coupe, and convertible variants were offered.",
            "Power comes from an S65 4.0-liter V8, rated at 414 horsepower and 295 lb-ft of torque. Output is sent to the rear wheels via a 7-speed dual-clutch transmission."
        ],
        "auction_equipment": [
            "19-inch Style 220M wheels",
            "M3-specific suspension system",
            "Variable M differential lock",
            "Dynamic Stability Control (DSC)",
            "Adaptive xenon headlights",
            "Rain-sensing windshield wipers",
            "Power-adjustable and heated side mirrors",
            "Power-operated hardtop",
            "Novillo leather upholstery",
            "Heated and power-adjustable front seats with memory",
            "Carbon fiber interior trim",
            "Dual-zone automatic climate control system",
            "BMW iDrive infotainment system",
            "Navigation system",
            "Cruise control",
            "BMW Assist with Bluetooth compatibility",
            "Comfort Access keyless entry system"
        ],
        "modifications": [
            "Tow hook-mounted front license plate bracket",
            "Tinted windows"
        ],
        "known_flaws": [
            "Stone chips on front end and hood",
            "Scuffs on underside of front bumper",
            "Scratches on rear bumper",
            "Some curb rash on wheels",
            "Creases and wear on driver’s seat upholstery",
            "Some scratches and wear on interior plastic trim and touch points",
            "Stains on front passenger floor mat and trunk carpeting",
            "Some rust on the exhaust components"
        ],
        "services": [
            "January 2022: Engine oil and filter changed, valve cover gaskets, timing cover gaskets, and TPMS sensor replaced, coolant and power steering fluid flushed",
            "December 2019 (83,479 miles): Thermostat and A/C evaporator replaced",
            "July 2019: Blower motor wiring recall performed",
            "August 2018: Front and rear brake rotors, pads, and sensors replaced, brake fluid flushed",
            "August 2021 (88,869 miles): Tire repaired, two tires mounted",
            "December 2020 (86,932 miles): Fuel filler cap replaced",
            "October 2019 (82,357 miles): Tire(s) mounted and balanced",
            "July 2019 (81,253 miles): A/C refrigerant recharged, engine oil and filter changed"
        ],
        "included_items": [
            "2 keys",
            "Owner's manuals",
            "Available service records"
        ],
        "ownership_history": "The seller purchased this M3 in June 2014 with about 47,100 miles on it.",
        "auction_stats": {
            "reserve_status": "Reserve",
            "auction_status": "Sold to",
            "highest_bid_value": "$23,750",
            "auction_date": "Mar 20, 2023 10:25 PM",
            "view_count": "7,482",
            "bid_count": "27",
            "bids": [
                "$23,750",
                "$23,500",
                "$23,250",
                "$23,000",
                "$22,750",
                "$22,500",
                "$22,000",
                "$15,750",
                "$15,500",
                "$14,600",
                "$14,500",
                "$13,100",
                "$13,000",
                "$12,600",
                "$12,500",
                "$12,345",
                "$8,400",
                "$8,000",
                "$7,400",
                "$7,300",
                "$6,900",
                "$6,750",
                "$6,650",
                "$6,550",
                "$6,250",
                "$5,250",
                "$5,000"
            ]
        }
    },
    "https://carsandbids.com/auctions/3oeMDvJw/2011-audi-a8-42-quattro": {
        "auction_title": "2011 Audi A8 4.2 Quattro",
        "auction_subtitle": "NO RESERVE V8 Power, AWD, Cold Weather Package, Night Blue Pearl Effect",
        "auction_quick_facts": {
            "Make": "Audi",
            "Model": "A8\nSave",
            "Mileage": "112,000",
            "VIN": "WAUAVAFD7BN018245",
            "Title Status": "Clean (MI)",
            "Location": "Rochester, MI 48306",
            "Seller": "JoeFrancis",
            "Engine": "4.2L V8",
            "Drivetrain": "4WD/AWD",
            "Transmission": "Automatic (8-Speed)",
            "Body Style": "Sedan",
            "Exterior Color": "Night Blue Pearl Effect",
            "Interior Color": "Nougat Brown",
            "Seller Type": "Private Party"
        },
        "dougs_take": "The D4-generation Audi A8 is a nice luxury car, boasting modern styling, amenities, and – thanks to all-wheel drive – practicality in all climates. This particular example comes nicely equipped, offering luxury features like adaptive air suspension, LED headlights, and the Cold Weather Package – plus, it's finished in gorgeous Night Blue Pearl Effect over Nougat Brown. This A8 also touts an accident-free Carfax report for added peace of mind – AND it's offered with the thrill of no reserve. If you're looking for a relatively modern luxury sedan that will seriously impress for a fraction of its original price, you've found it.",
        "auction_highlights": [
            "The attached Carfax history report shows no accidents or mileage discrepancies in this A8's past.",
            "Factory equipment includes the Cold Weather packages, 19-inch alloy wheels, adaptive air suspension, a sunroof, leather upholstery, the Audi MMI Navigation Plus system, soft-close doors, and more as detailed below. The sole modification reported is tinted windows.",
            "The “D4” Audi A8 was produced from 2009 to 2017 as the German carmaker’s uber-luxury flagship sedan. It was offered with V6, V8, and W12 engines in North America.",
            "Power comes from a 4.2-liter V8, rated at 372 horsepower and 328 lb-ft of torque. Output is sent to all four wheels via an 8-speed automatic transmission and Audi's Quattro permanent all-wheel drive system."
        ],
        "auction_equipment": [
            "Cold Weather Package (heated steering wheel, heated rear seats, rear-seat pass-through with ski bag)",
            "19-inch alloy wheels",
            "Quattro permanent all-wheel drive system",
            "Adaptive air suspension",
            "Audi Drive Select",
            "LED headlights",
            "Power-adjustable, power-folding heated side mirrors",
            "Sunroof",
            "Leather upholstery",
            "Heated front seats",
            "Audi MMI Navigation Plus system",
            "Bose sound system",
            "Cruise control",
            "Audi parking system with rearview camera",
            "Soft-close doors"
        ],
        "modifications": [
            "Tinted windows"
        ],
        "known_flaws": [
            "Paint chips on front bumper and hood",
            "Curb rash on wheels",
            "2017 date codes on 3 tires",
            "Chip on windshield",
            "Rear sunshade motor operates intermittently"
        ],
        "services": [
            "July 2022 (106,533 miles): Engine oil and filter changed",
            "October 2021 (98,725 miles): Engine oil and filter changed",
            "December 2019 (87,883 miles): Engine oil and filter changed, spark plugs and valve cover gaskets replaced",
            "March 2019 (83,754 miles): Tires rotated, two-wheel alignment performed"
        ],
        "included_items": [
            "1 key",
            "Owner's manual"
        ],
        "ownership_history": "The seller acquired this A8 in October 2018 and has added approximately 35,000 miles since.",
        "auction_stats": {
            "reserve_status": "No reserve",
            "auction_status": "Sold to",
            "highest_bid_value": "$11,500",
            "auction_date": "Mar 20, 2023 10:16 PM",
            "view_count": "7,055",
            "bid_count": "23",
            "bids": [
                "$11,500",
                "$11,200",
                "$11,100",
                "$11,000",
                "$10,600",
                "$10,500",
                "$10,000",
                "$9,900",
                "$9,750",
                "$9,650",
                "$9,500",
                "$9,300",
                "$9,200",
                "$9,100",
                "$9,000",
                "$8,100",
                "$8,000",
                "$7,877",
                "$7,777",
                "$6,620",
                "$3,000",
                "$2,011",
                "$444"
            ]
        }
    },
    "https://carsandbids.com/auctions/K1d75lL0/2013-tesla-model-s-60": {
        "auction_title": "2013 Tesla Model S 60",
        "auction_subtitle": "~12,400 Miles, 1 Owner, Mostly Unmodified, Texas-Owned",
        "auction_quick_facts": {
            "Make": "Tesla",
            "Model": "Model S\nSave",
            "Mileage": "12,400",
            "VIN": "5YJSA1CGXDFP21504",
            "Title Status": "Clean (CA)",
            "Location": "Los Angeles, CA 90064",
            "Seller": "K488",
            "Engine": "Single Electric Motor",
            "Drivetrain": "Rear-wheel drive",
            "Transmission": "Automatic",
            "Body Style": "Sedan",
            "Exterior Color": "Silver",
            "Interior Color": "Grey",
            "Seller Type": "Dealer"
        },
        "dougs_take": "The Tesla Model S is an EV icon that offers handsome styling, impressive technology, and surprising practicality – and earlier examples like this one have become surprisingly affordable. This particular Model S is unlike most other earlier examples, as it was kept by a single owner since new, and it has covered only 12,400 miles – a truly impressive feat. It also boasts 19-inch wheels, a leather interior, and no major modifications, all of which enhance the appeal further. To top it off, this Model S comes with a clean, accident-free Carfax report that shows dry-climate Texas ownership since new, for added peace of mind.",
        "auction_highlights": [
            "The odometer currently displays about 12,400 miles.",
            "The attached Carfax history report indicates no accidents or mileage discrepancies; it also shows that this Model S has been registered to one owner in Texas since new.",
            "Factory equipment includes 19-inch wheels, leather upholstery, a 17-inch capacitive touchscreen, dual-zone automatic climate control, Bluetooth connectivity, and cruise control. The only modification reported by the selling dealer is tinted windows.",
            "Tesla introduced the Model S, the first car it developed in-house, in 2012. Still available new today, it was one of the first cars that proved EVs could be more than overgrown golf carts. It has gone through numerous powertrain and software evolutions during its life cycle.",
            "Power comes from a single electric motor, which draws electricity from an 60-kilowatt-hour lithium-ion battery pack to zap the rear wheels with 302 horsepower and 317 lb-ft of torque, according to third-party estimates. The EPA gave the 60 a maximum driving range rating of 208 miles in 2014."
        ],
        "auction_equipment": [
            "19-inch wheels",
            "Rain-sensing windshield wipers",
            "Leather upholstery",
            "Piano Black interior trim",
            "17-inch capacitive touchscreen",
            "7-speaker sound system",
            "Dual-zone automatic climate control",
            "Bluetooth connectivity",
            "Cruise control",
            "Keyless entry"
        ],
        "modifications": [
            "Tinted windows"
        ],
        "known_flaws": [
            "Chips and scratches on the front bumper and hood (pictured in the gallery)",
            "Scratches on wheels"
        ],
        "services": [],
        "included_items": [
            "2 keys",
            "Charging cable"
        ],
        "ownership_history": "The selling dealer acquired this Model S in July 2022 and has added approximately 4,500 miles since.",
        "auction_stats": {
            "reserve_status": "Reserve",
            "auction_status": "Reserve not met, bid to",
            "highest_bid_value": "$29,500",
            "auction_date": "Mar 20, 2023 10:08 PM",
            "view_count": "7,063",
            "bid_count": "23",
            "bids": [
                "$29,500",
                "$29,000",
                "$28,750",
                "$27,750",
                "$27,500",
                "$26,500",
                "$26,250",
                "$25,000",
                "$22,500",
                "$21,500",
                "$19,750",
                "$19,500",
                "$19,000",
                "$18,750",
                "$18,250",
                "$17,750",
                "$16,500",
                "$15,750",
                "$12,400",
                "$10,790",
                "$10,690",
                "$10,520",
                "$10,420"
            ]
        }
    },
    "https://carsandbids.com/auctions/3RbBVM0R/2005-mercedes-benz-slk55-amg": {
        "auction_title": "2005 Mercedes-Benz SLK55 AMG",
        "auction_subtitle": "355-hp V8, Retractable Hardtop, Mostly Unmodified",
        "auction_quick_facts": {
            "Make": "Mercedes-Benz",
            "Model": "SLK55 AMG\nSave",
            "Mileage": "86,700",
            "VIN": "WDBWK73F25F049605",
            "Title Status": "Clean (CA)",
            "Location": "Glendale, CA 91208",
            "Seller": "Vincent1",
            "Engine": "5.4L V8",
            "Drivetrain": "Rear-wheel drive",
            "Transmission": "Automatic (7-Speed)",
            "Body Style": "Convertible",
            "Exterior Color": "Telurium Silver",
            "Interior Color": "Black",
            "Seller Type": "Private Party"
        },
        "dougs_take": "I love the Mercedes-Benz SLK55 AMG, and I truly think it deserves more recognition in the enthusiast community as it packs a big punch from a muscular V8 in a small, Miata-sized body. This particular example has a few nice things going for it, as it boasts some great factory equipment, including the mandatory retractable hardtop, the clever Airscarf neck-level heaters, and a set of handsome 18-inch AMG wheels. It also comes with minimal modifications, and it touts a clean, accident-free Carfax report, further adding to the appeal.",
        "auction_highlights": [
            "The attached Carfax history report shows no accidents or mileage discrepancies in this SLK’s past.",
            "According to the build sheet provided in the gallery, factory equipment includes 18-inch AMG wheels, bi-xenon headlights, a power-retractable hardtop, Nappa leather upholstery, power-adjustable heated seats, Airscarf neck-level heaters, and more as listed below. Modifications reported by the seller are limited to clear side marker lights and a carbon fiber rear diffuser.",
            "Introduced for the 2005 model year, the \"R171\"-generation SLK features a number of revisions compared to its \"R170\" predecessor. Changes include a longer wheelbase, overall length and width, and an available 7-speed automatic transmission. The second-generation SLK also benefitted from a revised roof mechanism, which Mercedes-Benz states is deployable in 22 seconds and increases trunk storage while the roof is down.",
            "Power comes from an \"M113\" 5.4-liter V8, rated at 355 horsepower and 376 lb-ft of torque. Output is sent to the rear wheels through a 7-speed automatic transmission."
        ],
        "auction_equipment": [
            "18-inch AMG wheels",
            "Bi-xenon headlights with washers",
            "Rain-sensing windscreen wipers",
            "Power-retractable hardtop",
            "Nappa leather upholstery",
            "Power-adjustable heated seats",
            "AMG Aluminum interior trim",
            "Airscarf neck-level heaters",
            "Dual-zone automatic climate control",
            "Cruise control"
        ],
        "modifications": [
            "Clear side marker lights",
            "Carbon fiber rear diffuser"
        ],
        "known_flaws": [
            "Chipped paint on driver's side rocker panel",
            "Ding on the driver’s door",
            "Faded paint on the rear spoiler",
            "Curb rash on wheels",
            "Some wear on driver's seat",
            "Illuminated warning light for license plate bulbs",
            "The seller notes that the driver’s door speaker emits a scratching sound."
        ],
        "services": [
            "December 2019: Engine oil and filter changed, two tires mounted and balanced, four-wheel alignment performed",
            "May 2017: Tire checked",
            "October 2022 (85,594 miles): Engine oil and filter changed",
            "February 2022: Tires replaced",
            "March 2021 (69,120 miles): Engine and transmission mounts replaced, spark plugs and spark plug wires replaced, ignition coils replaced, transmission fluid flushed, transmission filter replaced, transmission pan gasket replaced"
        ],
        "included_items": [
            "1 key",
            "Owner's manuals"
        ],
        "ownership_history": "The seller purchased this SLK55 in October 2022 and added approximately 1,000 miles since.",
        "auction_stats": {
            "reserve_status": "Reserve",
            "auction_status": "Sold to",
            "highest_bid_value": "$15,500",
            "auction_date": "Mar 20, 2023 9:59 PM",
            "view_count": "7,151",
            "bid_count": "14",
            "bids": [
                "$15,500",
                "$15,250",
                "$15,000",
                "$13,950",
                "$13,850",
                "$13,750",
                "$13,350",
                "$13,250",
                "$12,850",
                "$12,750",
                "$12,400",
                "$12,200",
                "$11,500",
                "$2,005"
            ]
        }
    },
    "https://carsandbids.com/auctions/rG6oRJwK/1990-mazda-mx-5-miata": {
        "auction_title": "1990 Mazda MX-5 Miata",
        "auction_subtitle": "NO RESERVE 6-Speed Manual, Turbocharged 1.8L 4-Cylinder, Extensive Modifications",
        "auction_quick_facts": {
            "Make": "Mazda",
            "Model": "MX-5 Miata\nSave",
            "Mileage": "168,000 Miles Shown",
            "VIN": "JM1NA3514L0133225",
            "Title Status": "Clean (CA)",
            "Location": "San Miguel, CA 93451",
            "Seller": "nnowa07",
            "Engine": "1.8L Turbocharged I4",
            "Drivetrain": "Rear-wheel drive",
            "Transmission": "Manual (6-Speed)",
            "Body Style": "Convertible",
            "Exterior Color": "Red",
            "Interior Color": "Black",
            "Seller Type": "Private Party"
        },
        "dougs_take": "The NA Mazda MX-5 Miata is an absolute icon in the enthusiast world, as it's a nimble car that's fun to drive, and it carries a huge aftermarket support system that can fulfill almost any build desire an owner wants. This particular NA is an early model that touts a boosted and intercooled 1.8-liter engine, a 6-speed manual transmission, and a lot of performance modifications that should make for a thrilling driving experience – in fact, an included dyno sheet shows this Miata is putting down 342 horsepower at the rear wheels! This potent roadster also comes with a clean, accident-free Carfax report that shows warm-climate Georgia and California ownership from new – AND it's offered with the thrill of no reserve.",
        "auction_highlights": [
            "This Miata is equipped with a turbocharged 1.8-liter engine and a 6-speed manual transmission.",
            "The attached Carfax history report indicates no accidents. It also shows this car has been registered in Georgia and California since new.",
            "Factory equipment includes pop-up headlights, a folding soft top, cloth upholstery, a driver's airbag, and manual windows.",
            "A partial list of other modifications reported by the seller includes a Pulsar Turbo GTX2867R turbocharger, a front mount intercooler with GReddy blow-off valve, a MegaSquirt Gen 2 PnP ECU (tuned on E85 fuel), a MAC electronic boost controller, a KRAKEN turbo exhaust manifold and downpipe, a Flyin' Miata Happy Meal clutch kit, 15-inch Advanti Storm wheels, Feal Suspension 441 coilovers, and a Hard Dog double roll bar.",
            "Introduced in 1989, the first-generation NA Mazda MX-5 Miata is beloved for being a fun, accessible, lightweight roadster that is an absolute joy to drive at any speed. Its excellent build quality and abundant aftermarket support have given the NA Miata a cult-like following.",
            "Power comes from a turbocharged and intercooled 1.8-liter inline-4. An included dyno readout shows this Miata is making 342 horsepower and 311 lb-ft of torque at the wheels, and output is sent to the rear axle through a 6-speed manual transmission."
        ],
        "auction_equipment": [
            "Pop-up headlights",
            "Folding soft top",
            "Cloth upholstery",
            "Driver's airbag",
            "Manual windows"
        ],
        "modifications": [
            "1.8-liter engine donated from a 1997 Miata with 88,000 miles (engine block honed and rebuilt by B&W Automotive, installed at 151,000 indicated miles)",
            "OEM pistons reconditioned",
            "New OEM piston rings",
            "Forged connecting rods",
            "King Racing connecting rod bearings",
            "New OEM main bearings",
            "Crankshaft polished",
            "Cylinder head hot tanked, cleaned, and resurfaced (new OEM valve stem seals)",
            "New front and rear main seals",
            "Pulsar Turbo GTX2867R turbocharger",
            "1000cc fuel injectors",
            "Deatschwerks DW200 fuel pump",
            "NB Miata throttle body",
            "Bosch R8 coil packs with FlowForce PnP setup",
            "Front mount intercooler with GReddy blow-off valve",
            "MegaSquirt Gen 2 PnP ECU (tuned on E85 fuel)",
            "MAC electronic boost controller",
            "Custom intake system",
            "KRAKEN turbo exhaust manifold and downpipe",
            "Custom 3-inch exhaust pipe with dual-tip exhaust",
            "A/C components removed",
            "Flyin' Miata Happy Meal clutch kit",
            "6-speed manual transmission",
            "Flyin' Miata Delrin shifter",
            "3.63 rear differential (calibrated speedometer gear)",
            "15-inch Advanti Storm wheels",
            "245/40 Hankook Ventus R-S4 tires",
            "1997 Miata M-Edition front brake calipers and rotors",
            "Porterfield R4-S brake pads",
            "Feal Suspension 441 coilovers",
            "Flyin' Miata frame rail braces",
            "Hard Dog double roll bar",
            "Innovative Mounts engine mounts",
            "Manual steering rack conversion with bump steer spacers",
            "Aluminum undertray",
            "Aftermarket front lip",
            "Aftermarket front turn signal intake ports",
            "LED headlights and rear turn signal lights",
            "Sparco driver's seat",
            "Takata 4-point safety harness",
            "RevLimiter primary instrument overlays",
            "Auxiliary gauges in center stack, with carbon fiber-look bezel",
            "Jass Performance center console delete and carpet kit",
            "Delrin door bushings",
            "Pioneer head unit"
        ],
        "known_flaws": [
            "Scratches and chips on front end",
            "Some scratches, imperfections, and dings around exterior (some touched up)",
            "Right fender is color mismatched",
            "Wear on driver's seat",
            "Scratches on interior plastics",
            "The seller reports that cold starts below 50 degrees can take longer than normal."
        ],
        "services": [
            "July 2022 (166,234 miles): California emissions test performed",
            "December 2021 (162,217 miles): Alignment performed",
            "May 2021 (159,066 miles): Vehicle serviced, tire repaired, alignment performed",
            "February 2021: Alignment performed",
            "September 2020: California emissions test performed",
            "Oil pump replaced",
            "OEM head gasket installed",
            "Accessory belts replaced",
            "Timing belt and water pump replaced",
            "Tie rods, control arms, and various bushings replaced",
            "Engine and transmission oil, differential oil, brake fluid, and coolant changed",
            "Various seals replaced",
            "Spark plugs replaced"
        ],
        "included_items": [
            "1 key",
            "Owner's manual",
            "Removed A/C components",
            "Uninstalled Sparco passenger seat"
        ],
        "ownership_history": "The seller states that they purchased this Miata in August 2020, and have added approximately 12,000 miles since.",
        "auction_stats": {
            "reserve_status": "No reserve",
            "auction_status": "Sold to",
            "highest_bid_value": "$10,300",
            "auction_date": "Mar 20, 2023 9:51 PM",
            "view_count": "11,587",
            "bid_count": "13",
            "bids": [
                "$10,300",
                "$10,100",
                "$10,000",
                "$9,500",
                "$9,400",
                "$8,000",
                "$5,500",
                "$5,400",
                "$5,200",
                "$3,000",
                "$1,000",
                "$500",
                "$100"
            ]
        }
    },
    "https://carsandbids.com/auctions/rNXBxqgX/2021-volkswagen-gti-se": {
        "auction_title": "2021 Volkswagen GTI SE",
        "auction_subtitle": "1 Owner, Turbo 4-Cylinder, APR Stage 1 Tune",
        "auction_quick_facts": {
            "Make": "Volkswagen",
            "Model": "GTI\nSave",
            "Mileage": "36,100",
            "VIN": "3VW6T7AU3MM003857",
            "Title Status": "Clean (NY)",
            "Location": "New York, NY 10025",
            "Seller": "s0rensj",
            "Engine": "2.0L Turbocharged I4",
            "Drivetrain": "Front-wheel drive",
            "Transmission": "Automatic (7-Speed)",
            "Body Style": "Hatchback",
            "Exterior Color": "Pure White",
            "Interior Color": "Titan Black",
            "Seller Type": "Private Party"
        },
        "dougs_take": "The Mk7.5 Volkswagen GTI is an exciting hot hatchback, with a fun driving character, a nice interior, handsome styling, AND the added practicality of a four-door hatchback design. This particular GTI is finished in classic Pure White, and it boasts some great factory equipment including adaptive LED headlights, heated front seats, and a navigation system. It also features an APR Stage 1 tune, which should make it especially fun to drive – and it touts a single owner, further adding to the appeal.",
        "auction_highlights": [
            "The attached Carfax history report shows no mileage discrepancies in this GTI’s past. It also confirms that this is a 1-owner car.",
            "According to the window provided in the gallery, factory equipment includes 18-inch wheels, adaptive LED headlights, a sunroof, leather upholstery, heated front sport seats, a navigation system, and more as listed below. Modifications reported by the seller are limited to an APR Stage 1 tune.",
            "The Mk7 Golf was introduced in 2012 on the automaker's new modular \"MQB\" platform, and the mid-cycle update that arrived in 2018 is commonly referred to as the Mk7.5. Changes for the 2019 model year included newly-standard collision-avoidance tech and a bump of 8 horsepower. S, SE, and Autobahn trim levels were available, and the Experience Package was added to the options roster.",
            "Power comes from a 2.0-liter turbocharged inline-4, rated at 228 horsepower and 258 lb-ft of torque in stock form. Due to the modifications performed to this GTI, it may produce more power, but a dyno sheet was not provided to confirm. Output is sent to the front wheels via a 7-speed dual-clutch automatic transmission."
        ],
        "auction_equipment": [
            "18-inch wheels",
            "Adaptive LED headlights",
            "LED taillights",
            "Power-operated sunroof",
            "Leather upholstery",
            "Heated front sport seats",
            "MIB3 Discover Media infotainment system",
            "Navigation system",
            "Air conditioning",
            "6-speaker sound system",
            "Rear-view camera",
            "Cruise control"
        ],
        "modifications": [
            "APR Stage 1 tune"
        ],
        "known_flaws": [
            "The attached Carfax report indicates that this GTI sustained “minor damage” to the front in November 2022. The seller states that this was a low-speed rear-end collision and that the hood, front grille, and one of the headlights were replaced.",
            "Paint chips on the hood, and rear bumper (pictured in the photo gallery)",
            "Some curb rash on the rear wheels"
        ],
        "services": [
            "February 2023 (35,258 miles): Maintenance inspection completed, alignment performed, mirror(s) checked",
            "February 2023 (34,547 miles): Wipers replaced, maintenance inspection completed",
            "September 2022 (29,011 miles): Vehicle serviced",
            "September 2022 (28,690 miles): Engine oil and filter changed, differential fluid flushed, two tires mounted and balanced, four-wheel alignment performed",
            "March 2022 (18,214 miles): Tires rotated and balanced, four-wheel alignment performed, brakes checked"
        ],
        "included_items": [
            "2 keys",
            "Owner's manual",
            "Window sticker",
            "CravenSpeed Platypus front license plate mount"
        ],
        "ownership_history": "The seller purchased this GTI new in April 2021.",
        "auction_stats": {
            "reserve_status": "Reserve",
            "auction_status": "Sold to",
            "highest_bid_value": "$22,750",
            "auction_date": "Mar 20, 2023 9:42 PM",
            "view_count": "9,130",
            "bid_count": "51",
            "bids": [
                "$22,750",
                "$22,500",
                "$22,250",
                "$22,000",
                "$21,750",
                "$21,500",
                "$21,250",
                "$21,000",
                "$20,750",
                "$20,500",
                "$20,250",
                "$19,888",
                "$19,500",
                "$19,000",
                "$18,500",
                "$17,750",
                "$17,500",
                "$17,250",
                "$17,000",
                "$16,250",
                "$16,000",
                "$15,750",
                "$15,500",
                "$15,000",
                "$14,000",
                "$13,400",
                "$13,300",
                "$13,200",
                "$13,100",
                "$13,000",
                "$10,000",
                "$9,900",
                "$9,800",
                "$9,700",
                "$9,600",
                "$9,300",
                "$9,000",
                "$7,900",
                "$7,500",
                "$7,300",
                "$7,200",
                "$7,100",
                "$7,000",
                "$6,100",
                "$5,955",
                "$5,855",
                "$5,755",
                "$5,555",
                "$3,500",
                "$1,444",
                "$999"
            ]
        }
    },
    "https://carsandbids.com/auctions/KZjWgzjN/2018-toyota-land-cruiser": {
        "auction_title": "2018 Toyota Land Cruiser",
        "auction_subtitle": "V8 Power, 4WD, Blue Onyx Pearl, Some Modifications",
        "auction_quick_facts": {
            "Make": "Toyota",
            "Model": "Land Cruiser\nSave",
            "Mileage": "80,100",
            "VIN": "JTMCY7AJ6J4064611",
            "Title Status": "Clean (TX)",
            "Location": "Frisco, TX 75033",
            "Seller": "Rocky4",
            "Engine": "5.7L V8",
            "Drivetrain": "4WD/AWD",
            "Transmission": "Automatic (8-Speed)",
            "Body Style": "SUV/Crossover",
            "Exterior Color": "Blue Onyx Pearl",
            "Interior Color": "Terra",
            "Seller Type": "Private Party"
        },
        "dougs_take": "The Land Cruiser has unfortunately been cancelled here in the U.S., which makes the later 200-Series models of the iconic SUV especially desirable – as they were the last Land Cruiser models we may ever get. This particular 2018 Land Cruiser features a gorgeous color combination – Blue Onyx Pearl with a Terra interior – and it's nicely equipped with heated and ventilated front seats, heated second-row seats, and Dynamic Radar Cruise Control. It's also mostly unmodified, with some upgrades to improve its towing capabilities and a remote start system being the only changes from stock – AND it comes with a clean, accident-free Carfax report, for added peace of mind.",
        "auction_highlights": [
            "The attached Carfax vehicle history report shows no accidents or mileage discrepancies in this Land Cruiser's past. It also confirms that this is a one-owner SUV.",
            "Factory equipment includes 18-inch alloy wheels, Multi-Terrain Select, a Torsen locking limited-slip center differential, Kinetic Dynamic Suspension System (KDSS), perforated leather upholstery, heated and ventilated front seats, heated second-row seats, and a JBL audio system, among others listed below.",
            "Modifications reported by the seller include an AirLift 5000 suspension kit with wireless controller, REDARC Tow-Pro Elite brake controller, and a remote start system.",
            "Introduced for the 2008 model year, the 200-Series Land Cruiser is notable for maintaining its reputation for off-road prowess while further increasing the luxury aspects of the truck. In 2016 the 200-Series was refreshed with an updated interior and exterior, new 18-inch alloy wheels, larger front disc brakes, and a new 8-speed electronically-controlled automatic transmission, among other modern convenience updates.",
            "Power comes from a \"3UR-FE\" 5.7-liter V8, rated at 381 horsepower and 401 lb-ft of torque. Output is sent to all four wheels via an 8-speed automatic transmission."
        ],
        "auction_equipment": [
            "18-inch alloy wheels",
            "Torsen locking limited-slip center differential",
            "Kinetic Dynamic Suspension System (KDSS)",
            "Multi-Terrain Select",
            "Hill-Start Assist",
            "LED headlights",
            "Power sunroof",
            "Semi-aniline perforated leather upholstery",
            "Power-adjustable, heated, and ventilated front seats",
            "Heated second-row seats",
            "4-zone automatic climate control",
            "JBL sound system",
            "Center cooler box",
            "Rear-seat entertainment system",
            "Toyota Safety Sense",
            "Pre-Collision System with Pedestrian Detection",
            "Lane Departure Alert",
            "Rear Cross Traffic Alert",
            "Dynamic Radar Cruise Control"
        ],
        "modifications": [
            "AirLift 5000 suspension kit with wireless controller",
            "REDARC Tow-Pro Elite brake controller",
            "Remote start system"
        ],
        "known_flaws": [
            "Some scratches and chips around the exterior (pictured in the gallery)",
            "Cracked front plate backing",
            "Some rust on the tow hitch receiver",
            "Some dings on the roof",
            "Creases on the front seat bolsters",
            "Indents in the front passenger's seat, the second-row center seat, and the third-row seats",
            "Some wear on interior touch points",
            "The seller reports that the TPMS light is illuminated intermittently."
        ],
        "services": [
            "October 2022: Windshield installed",
            "November 2021: Engine oil and filter changed, engine air filter replaced, anti-corrosion battery terminal pads installed, tires rotated, multi-point inspection completed",
            "June 2021: Engine oil and filter changed, multi-point inspection performed, cabin air filter replaced",
            "April 2021: Tire(s) replaced",
            "January 2021: Engine oil and filter changed, front brake pads, battery, wiper(s) replaced",
            "September 2020 (56,860 miles): Maintenance inspection completed, engine oil and filter changed, tires rotated",
            "September 2020: Tire(s) balanced and rotated",
            "February 2020 (48,422 miles): Maintenance inspection completed, engine oil and filter changed, tires rotated",
            "August 2019 (36,483 miles): Maintenance inspection completed, engine oil and filter changed, tires rotated, tire repaired",
            "March 2019 (24,225 miles): Recommended maintenance performed, maintenance inspection completed, engine oil and filter changed"
        ],
        "included_items": [
            "1 key",
            "Owner's manual",
            "Service records",
            "Remote and headsets for the rear-seat entertainment system"
        ],
        "ownership_history": "The seller acquired this Land Cruiser in February 2021.",
        "auction_stats": {
            "reserve_status": "Reserve",
            "auction_status": "Sold to",
            "highest_bid_value": "$66,000",
            "auction_date": "Mar 20, 2023 9:34 PM",
            "view_count": "14,335",
            "bid_count": "9",
            "bids": [
                "$66,000",
                "$65,500",
                "$65,000",
                "$61,000",
                "$60,500",
                "$60,000",
                "$45,000",
                "$30,000",
                "$25,000"
            ]
        }
    },
    "https://carsandbids.com/auctions/9QZ7qYpk/2009-porsche-cayenne": {
        "auction_title": "2009 Porsche Cayenne",
        "auction_subtitle": "NO RESERVE AWD, Mostly Unmodified, Accident-Free Carfax Report",
        "auction_quick_facts": {
            "Make": "Porsche",
            "Model": "Cayenne\nSave",
            "Mileage": "110,500",
            "VIN": "WP1AA29P29LA08978",
            "Title Status": "Clean (PA)",
            "Location": "King Of Prussia, PA 19406",
            "Seller": "MotorcarsOfTheMainLine",
            "Engine": "3.6L V6",
            "Drivetrain": "4WD/AWD",
            "Transmission": "Automatic (6-Speed)",
            "Body Style": "SUV/Crossover",
            "Exterior Color": "Crystal Silver Metallic",
            "Interior Color": "Black",
            "Seller Type": "Dealer"
        },
        "dougs_take": "The Porsche Cayenne is an excellent daily driver that's spacious, luxurious, relatively quick, and surprisingly capable off the beaten path. This is post-facelift, first-generation Cayenne, so it features an updated design inside and out – and it's powered by a 3.6-liter V6 rated at a surprisingly potent 290 horsepower. While this Cayenne is an entry-level model, it boasts a fairly long list of features including roof rails, heated front seats, and a Bose surround sound system. It also touts a clean, accident-free Carfax report and it's very nearly unmodified – and no reserve means someone will be taking this Cayenne home at the end of the auction.",
        "auction_highlights": [
            "The attached Carfax history report lists no accidents in this SUV's past.",
            "Factory equipment includes 19-inch wheels, roof rails, heated and power-adjustable comfort front seats, a heated steering wheel with a thicker rim, a power-adjustable steering column, a power-operated hatch, a Bose surround sound system, plus front and rear parking sensors, according to a build sheet pictured in the gallery. The only modification reported by the selling dealer is a set of halogen headlights that replace the factory-fitted bi-xenon units.",
            "The first-generation Cayenne made its hugely controversial American debut for the 2003 model year, and it quickly won over skeptics with its unusual blend of on-road performance and off-road prowess. It was updated for 2008 with a new-look design and more technology, and it retired as the best-selling member of the Porsche range in 2010.",
            "Power comes from a 3.6-liter V6, rated at 290 horsepower and 273 lb-ft of torque. It spins the four wheels via a 6-speed Tiptronic automatic transmission."
        ],
        "auction_equipment": [
            "19-inch wheels",
            "Variable power steering system",
            "Fog lights",
            "Roof rails",
            "Moonroof",
            "Leather upholstery",
            "Heated and power-adjustable comfort front seats",
            "Memory function for the front passengers",
            "Heated steering wheel with thicker rim",
            "Power-adjustable steering column",
            "Heated and power-folding door mirrors",
            "Power-operated hatch",
            "Porsche Communication Management infotainment system",
            "Bose surround sound system",
            "Navigation system",
            "Front and rear parking sensors"
        ],
        "modifications": [
            "Halogen headlights"
        ],
        "known_flaws": [
            "Chips on the front end",
            "Scratches on the rear bumper",
            "Scratches on the wheels",
            "Faded finish on the center caps",
            "2017 date code on the tires",
            "Wear on the driver's seat's outer bolsters",
            "Some scratches on the door panels"
        ],
        "services": [],
        "included_items": [
            "1 key",
            "Owner's manuals",
            "Rubber floor and trunk mats"
        ],
        "ownership_history": "The selling dealer purchased this Cayenne in 2023.",
        "auction_stats": {
            "reserve_status": "No reserve",
            "auction_status": "Sold to",
            "highest_bid_value": "$11,069",
            "auction_date": "Mar 20, 2023 9:27 PM",
            "view_count": "5,675",
            "bid_count": "19",
            "bids": [
                "$11,069",
                "$10,900",
                "$10,800",
                "$10,700",
                "$10,600",
                "$10,500",
                "$10,333",
                "$10,200",
                "$10,100",
                "$10,000",
                "$9,899",
                "$9,666",
                "$9,505",
                "$9,305",
                "$9,200",
                "$9,088",
                "$8,988",
                "$8,888",
                "$1,000"
            ]
        }
    },
    "https://carsandbids.com/auctions/3zYRJJqz/2021-rolls-royce-ghost": {
        "auction_title": "2021 Rolls-Royce Ghost",
        "auction_subtitle": "Twin-Turbo V12, Rear-Seat Entertainment System, Mostly Unmodified",
        "auction_quick_facts": {
            "Make": "Rolls-Royce",
            "Model": "Ghost\nSave",
            "Mileage": "26,000",
            "VIN": "SCATV0C08MU205534",
            "Title Status": "Clean (FL)",
            "Location": "Orlando, FL 32809",
            "Seller": "mmgcars",
            "Engine": "6.75L Turbocharged V12",
            "Drivetrain": "4WD/AWD",
            "Transmission": "Automatic (8-Speed)",
            "Body Style": "Sedan",
            "Exterior Color": "Arctic White",
            "Interior Color": "Black/Forge Yellow",
            "Seller Type": "Dealer"
        },
        "dougs_take": "Although the Ghost is the \"entry-level\" Rolls-Royce, it's still one of the most impressive luxury cars on the market today. The Ghost boasts a stately exterior design, an absolutely lavish interior, and a powerful, 6.75-liter twin-turbo V12. This example touts some great equipment, too – including elegant Forge Yellow accents, the Shooting Star headliner, AND a rear-seat entertainment system. It also benefits from a clean, accident-free Carfax report, and it's very nearly unmodified – so there's a lot to like about this Ghost. All-wheel-drive makes it viable as a year-round driver (your chauffeur will thank you!), and depreciation means you can own this Ghost for significantly less than it cost new a couple of years ago.",
        "auction_highlights": [
            "The attached Carfax history report lists no accidents in this sedan's past.",
            "Factory equipment includes 21-inch wheels, floating center caps, an air suspension system, a rear-wheel steering system, a power-operated Spirit of Ecstasy emblem, soft-close doors, power-operated rear doors with integrated umbrellas, a massage function for the front passengers, heated rear seats, tablets integrated into the front seatbacks, a Shooting Star headliner, and a rear-seat entertainment system. The only modification reported by the selling dealer is a window tint.",
            "Rolls-Royce's second-generation Ghost went on sale for 2021. While the design team's edits were relatively light, the evolutionary changes hid significant updates including an architecture shared with the bigger Phantom, a quieter cabin, and a redesigned suspension system tuned with an eye on comfort. Production of the Ghost – which is Rolls-Royce's entry-level model – continues today.",
            "Power comes from a 6.75-liter twin-turbocharged V12, rated at 563 horsepower and 627 lb-ft of torque. It spins the four wheels via a satellite-aided 8-speed automatic transmission."
        ],
        "auction_equipment": [
            "21-inch wheels",
            "Floating center caps",
            "Air suspension system",
            "Rear-wheel steering system",
            "Laser headlights",
            "Power-operated Spirit of Ecstasy emblem",
            "LED rear lights",
            "Power-operated rear doors with integrated umbrellas",
            "Soft-close doors",
            "Leather upholstery",
            "Heated, ventilated, and power-adjustable front seats",
            "Massage function for the front passengers",
            "Heated rear seats",
            "Heated steering wheel",
            "12.3-inch digital instrument cluster",
            "Tablets integrated into the front seatbacks",
            "Shooting Star headliner",
            "Navigation system",
            "Rear-seat entertainment system",
            "Adaptive cruise control",
            "Head-up display",
            "Front and rear parking sensors"
        ],
        "modifications": [
            "Tinted windows"
        ],
        "known_flaws": [
            "Scratches on the driver-side front wheel",
            "Some wear on the driver's seat's outer bolsters",
            "Indent in the rear center seat"
        ],
        "services": [
            "February 2022 (21,578 miles): 30,000-mile service performed and engine oil and filter changed"
        ],
        "included_items": [
            "1 key"
        ],
        "ownership_history": "The selling dealer purchased this Ghost in 2023.",
        "auction_stats": {
            "reserve_status": null,
            "auction_status": null,
            "highest_bid_value": null,
            "auction_date": null,
            "view_count": null,
            "bid_count": null,
            "bids": []
        }
    },
    "https://carsandbids.com/auctions/9lbzynqm/2015-bmw-m6-gran-coupe": {
        "auction_title": "2015 BMW M6 Gran Coupe",
        "auction_subtitle": "~13,800 Miles, Executive Package, Twin-Turbo V8",
        "auction_quick_facts": {
            "Make": "BMW",
            "Model": "M6 Gran Coupe\nSave",
            "Mileage": "13,800",
            "VIN": "WBS6C9C51FD467631",
            "Title Status": "Clean (IN)",
            "Location": "Norwalk, CT 06854",
            "Seller": "blackbridgemotors",
            "Engine": "4.4L Turbocharged V8",
            "Drivetrain": "Rear-wheel drive",
            "Transmission": "Automatic (7-Speed)",
            "Body Style": "Sedan",
            "Exterior Color": "Alpine White",
            "Interior Color": "Black",
            "Seller Type": "Dealer"
        },
        "dougs_take": "The BMW M6 Gran Coupe is a fantastic car that boasts truly gorgeous styling, massive power, and great technology. This particular example touts low mileage, with just 13,800 miles on the odometer, and it's nearly unmodified. It also features some desirable factory equipment, including the Executive Package, 20-inch Style 343 wheels, adaptive LED headlights, and soft-close doors. This M6 also comes with a clean, accident-free Carfax report, which always enhances the appeal.",
        "auction_highlights": [
            "The attached Carfax vehicle history report shows no accidents or mileage discrepancies in this M6's past.",
            "Factory equipment includes the Executive Packages, 20-inch Style 343 wheels, adaptive LED headlights, a carbon fiber roof panel, a full Merino leather interior, heated and power-adjustable front seats, carbon fiber interior trim, automatic climate control, and a navigation system, among others listed below.",
            "Modifications reported by the selling dealer include factory wheels painted black and paint protection film on the hood, front fenders, and door sills.",
            "Called F06 internally, the first four-door 6 Series made its debut for the 2013 model year as an alternative to the Audi A7 and the Mercedes-Benz CLS. The Gran Coupe was closely related to the 5 Series under the sheet metal, and the M6 was positioned at the very top of the range at the intersection of performance and luxury. BMW replaced the 6 Series Gran Coupe with the 8 Series Gran Coupe, and the M6 became the M8.",
            "Power comes from an S63 4.4-liter twin-turbocharged V8, rated at 560 horsepower and 500 lb-ft of torque. Output is sent to the rear wheels via a 7-speed dual-clutch automatic transmission."
        ],
        "auction_equipment": [
            "Executive Package (heated steering wheel, power rear window sunshade, rear-side window sunshades, front ventilated seats, active front seats, heated rear seats, head-up display, ﻿﻿Bang & Olufsen sound system)",
            "20-inch Style 343 wheels",
            "Electronic Damper Control (EDC)",
            "Adaptive LED headlights",
            "Carbon fiber roof",
            "Full Merino leather interior",
            "Heated and power-adjustable front seats",
            "Soft-close automatic doors",
            "Comfort Access keyless entry",
            "Carbon fiber interior trim",
            "4-zone automatic climate control",
            "Navigation system",
            "Park Distance Control (PDC)",
            "Driving Assistant",
            "Lane change warning",
            "Surround View"
        ],
        "modifications": [
            "Factory wheels painted black",
            "Paint protection film on the hood, front fenders, and door sills"
        ],
        "known_flaws": [
            "Some rock chips on front bumper; scratches on front bumper",
            "Touch up paint on rear bumper",
            "Scratches on wheels",
            "2016 date codes on tires",
            "Wear on driver's seat's outer bolster"
        ],
        "services": [
            "June 2022 (13,361 miles): A/C system checked, tire condition and pressure checked",
            "January 2022 (12,395 miles): Battery/charging system checked, brakes checked, tire condition and pressure checked",
            "December 2021 (12,043 miles): Maintenance inspection completed, oil and filter changed, A/C refrigerant recharged, A/C and heating system checked, emission system checked, A/C compressor replaced",
            "February 2018 (10,142 miles): Brake fluid flushed/changed, oil and filter changed, wiper(s) replaced, battery replaced, cabin air filter replaced/cleaned, rear brake pads replaced, rear brake rotor(s) replaced"
        ],
        "included_items": [
            "1 key",
            "Owner's manual"
        ],
        "ownership_history": "The selling dealer acquired this BMW earlier in 2023 and has added approximately 50 miles since.",
        "auction_stats": {
            "reserve_status": "Reserve",
            "auction_status": "Reserve not met, bid to",
            "highest_bid_value": "$43,750",
            "auction_date": "Mar 20, 2023 9:20 PM",
            "view_count": "12,107",
            "bid_count": "49",
            "bids": [
                "$43,750",
                "$43,500",
                "$43,000",
                "$42,500",
                "$42,000",
                "$41,000",
                "$40,000",
                "$39,250",
                "$39,000",
                "$38,250",
                "$38,000",
                "$36,000",
                "$35,750",
                "$35,500",
                "$35,250",
                "$34,900",
                "$34,500",
                "$34,000",
                "$33,750",
                "$33,500",
                "$33,250",
                "$33,000",
                "$32,750",
                "$32,500",
                "$32,250",
                "$32,000",
                "$31,500",
                "$31,250",
                "$31,000",
                "$30,750",
                "$30,500",
                "$30,000",
                "$29,250",
                "$29,000",
                "$27,750",
                "$27,500",
                "$27,250",
                "$27,000",
                "$25,250",
                "$25,000",
                "$23,000",
                "$22,222",
                "$20,000",
                "$15,000",
                "$11,111",
                "$10,500",
                "$10,000",
                "$5,555",
                "$500"
            ]
        }
    },
    "https://carsandbids.com/auctions/rb1dMRPd/2001-ford-f-250-super-duty-xlt-4x4": {
        "auction_title": "2001 Ford F-250 Super Duty XLT 4x4",
        "auction_subtitle": "7.3L Turbodiesel V8, 4WD, Some Modifications, New Mexico-Owned",
        "auction_quick_facts": {
            "Make": "Ford",
            "Model": "F-250\nSave",
            "Mileage": "142,200",
            "VIN": "1FTNX21F21EA35000",
            "Title Status": "Clean (NM)",
            "Location": "Albuquerque, NM 87114",
            "Seller": "DillonDeluca",
            "Engine": "7.3L Turbodiesel V8",
            "Drivetrain": "4WD/AWD",
            "Transmission": "Automatic (4-Speed)",
            "Body Style": "Truck",
            "Exterior Color": "Dark Highland Green",
            "Interior Color": "Medium Parchment",
            "Seller Type": "Private Party"
        },
        "dougs_take": "Ford Super Duty trucks are well-known for towing and hauling big loads, and this particular F-250 XLT offers a robust 7.3-liter turbodiesel V8 with over 500 lb-ft of torque, 4-wheel drive, and a limited-slip rear differential. This F-250 is also finished in attractive (and uncommon) Dark Highlander Green, and it features some great upgrades like a rear air suspension system, an MBRP exhaust system, and an upgraded sound system. Plus, this F-250 comes with a clean, accident-free Carfax report, showing dry-climate New Mexico ownership from new, for added buyer confidence.",
        "auction_highlights": [
            "The attached Carfax history report shows no accidents or mileage discrepancies in this F-250’s past. It also shows that it's been registered in New Mexico since new and to 1 owner until 2022.",
            "According to the window sticker pictured in the photo gallery, this F-250 had an original MSRP of $37,425 and came equipped with the Off-Road Package, 16-inch Delux aluminum wheels, an electronic shift-on-the-fly 4-wheel-drive system, a 3.73-ratio limited-slip rear differential, cloth upholstery, front and rear bench seats, air conditioning, and more as detailed below.",
            "Modifications reported by the seller include a rear air suspension conversion, an on-board 2.5-gallon air tank with compressor, a 4-inch MBRP exhaust system, 2017+ Ford F-250 tow mirrors, bed rails for a 5th-wheel hitch, a 2.5-inch industrial-duty tow hitch, an upgraded sound system with a 10-inch subwoofer, an air horn, a Pioneer touchscreen head unit with Apple CarPlay compatibility, and a back-up camera. A 5th wheel hitch is included in the sale.",
            "Part of Ford's perennially popular F-Series line of trucks, the Super Duty made its debut for 1999 with powerful engines, a beefier suspension system than the smaller F-150, and a reinforced frame. The range included F-250, F-350, and F-450 models available in a dizzying number of configurations including stripped-out workhorses and lavish highway cruisers. All had at least one thing in common: they were built specifically for towing and hauling.",
            "Power comes from a 7.3-liter \"Power Stroke\" turbodiesel V8, rated at 250 horsepower and 505 lb-ft of torque. Output is sent to the rear or all-four wheels via a 4-speed automatic transmission and a 2-speed transfer case."
        ],
        "auction_equipment": [
            "Off-Road Package",
            "16-inch Delux aluminum wheels",
            "Electronic shift-on-the-fly 4-wheel-drive system",
            "2-speed transfer case",
            "3.73-ratio limited-slip rear differential",
            "Chrome bumpers",
            "Trailer hitch receiver",
            "Power-adjustable side mirrors",
            "Cloth upholstery",
            "Front and rear bench seats",
            "Sliding rear window",
            "Air conditioning",
            "Cruise control",
            "Remote keyless entry"
        ],
        "modifications": [
            "Rear air suspension conversion",
            "On-board 2.5-gallon air tank with compressor",
            "4-inch MBRP turbo-back exhaust system",
            "S&B air intake",
            "Aftermarket running boards",
            "2017+ Ford F-250 tow mirrors",
            "Side window rain guards",
            "Lockable hard tonneau cover",
            "Bed rails for 5th wheel hitch",
            "SwingCase bed storage box",
            "2.5-inch industrial-duty tow hitch",
            "A-pillar gauges for transmission temperature, exhaust temperature, and boost pressure",
            "Tekonsha brake controller",
            "Upgraded sound system with 10-inch subwoofer",
            "Air horn",
            "Pioneer touchscreen head unit with Apple CarPlay compatibility",
            "Back-up camera",
            "12v outlet converted to USB"
        ],
        "known_flaws": [
            "Various scratches, chips, and dings throughout (some pictured in the gallery)",
            "Weathered window seals",
            "Crack in windshield (pictured in the gallery)",
            "Wear in bed",
            "Wear on driver’s seat bolsters",
            "Some wear and discoloration on seat upholstery",
            "Some scratches and wear on interior plastic trim and touch points"
        ],
        "services": [
            "March 2023 (142,167 miles): Engine oil and filter changed",
            "June 2019 (127,109 miles): Transmission fluid changed",
            "October 2011 (95,563 miles): Transmission replaced"
        ],
        "included_items": [
            "3 keys and 2 remote key fobs",
            "Owner's manuals",
            "Window sticker",
            "Service records",
            "5th wheel hitch (not currently installed)",
            "Steering wheel cover",
            "Center console cupholder extension",
            "All-weather floor mats",
            "Spare passenger-side window motor"
        ],
        "ownership_history": "The seller purchased this F-250 in January 2022 and has added approximately 5,600 miles since. ",
        "auction_stats": {
            "reserve_status": "Reserve",
            "auction_status": "Sold to",
            "highest_bid_value": "$16,856",
            "auction_date": "Mar 20, 2023 9:14 PM",
            "view_count": "8,764",
            "bid_count": "22",
            "bids": [
                "$16,856",
                "$16,606",
                "$16,356",
                "$16,093",
                "$15,843",
                "$15,500",
                "$15,250",
                "$15,000",
                "$14,100",
                "$13,500",
                "$13,300",
                "$13,200",
                "$13,000",
                "$12,300",
                "$12,200",
                "$12,100",
                "$12,000",
                "$10,000",
                "$6,500",
                "$5,555",
                "$5,055",
                "$4,073"
            ]
        }
    },
    "https://carsandbids.com/auctions/rxLYLOnB/2002-acura-rsx-type-s": {
        "auction_title": "2002 Acura RSX Type-S",
        "auction_subtitle": "NO RESERVE 1 Owner, 6-Speed Manual, 200-hp 4-Cylinder, Mostly Unmodified",
        "auction_quick_facts": {
            "Make": "Acura",
            "Model": "RSX\nSave",
            "Mileage": "94,000",
            "VIN": "JH4DC53042C034928",
            "Title Status": "Clean (OH)",
            "Location": "Cincinnati, OH 45249",
            "Seller": "alex1970",
            "Engine": "2.0L I4",
            "Drivetrain": "Front-wheel drive",
            "Transmission": "Manual (6-Speed)",
            "Body Style": "Coupe",
            "Exterior Color": "Satin Silver Metallic",
            "Interior Color": "Ebony",
            "Seller Type": "Private Party"
        },
        "dougs_take": "The Acura RSX Type-S is a cool and sporty car that follows a recipe for fun that Acura has long since moved on from. It's small and lightweight, and it boasts a 6-speed manual transmission, and it touts a punchy 2.0-liter engine. This particular RSX is a one-owner car that's nearly unmodified – both of which are great benefits. Plus, this RSX comes with a clean, accident-free Carfax report – AND it's offered with the added excitement of no reserve.",
        "auction_highlights": [
            "This RSX features the desirable 6-speed manual transmission.",
            "The attached Carfax history report shows no accidents or mileage discrepancies in this RSX’s past. It also shows that it's been registered to 1 owner since new.",
            "According to the window sticker pictured in the photo gallery, this RSX had an original MSRP of $23,670 and came equipped with 16-inch alloy wheels, a power sunroof, leather upholstery, automatic climate control, a 6-disc in-dash CD changer, and more as detailed below. Modifications reported by the seller are limited to tinted windows.",
            "The RSX replaced the Integra for the 2002 model year in the US with similar dimensions but revised styling inside and out, more power from new K-Series 4-cylinder engines, and a strut-type front suspension. The Type-S built upon the base model with a stiffened suspension and a sportier version of the 4-cylinder, plus an exclusive 6-speed manual transmission.",
            "Power comes from a K20A2 2.0-liter inline-4, rated at 200 horsepower and 142 lb-ft of torque. Output is sent to the front wheels via a 6-speed manual transmission."
        ],
        "auction_equipment": [
            "16-inch alloy wheels",
            "Power sunroof",
            "Leather upholstery",
            "Leather-wrapped steering wheel",
            "Automatic climate control",
            "Acura/Bose AM/FM/CD/Cassette stereo with 6-disc in-dash CD changer",
            "7-speaker sound system",
            "Power windows, side mirrors, and door locks"
        ],
        "modifications": [
            "Tinted windows"
        ],
        "known_flaws": [
            "Various scratches and chips around the exterior (some touched-up)",
            "Dent on hood",
            "Dings on front bumper and passenger-side door (pictured in the gallery)",
            "Peeling finish on window surrounds",
            "Curb rash on driver-side front wheel",
            "2011 date codes on tires",
            "Creases and wear on leather upholstery",
            "Some scratches and wear on interior plastic trim and touch points",
            "1 remote fob does not work",
            "Some rust on engine bay brackets and fasteners and underbody components (pictured in the gallery)"
        ],
        "services": [
            "May 2022 (93,750 miles): Engine oil and filter changed",
            "March 2022 (93,700 miles): Battery replaced",
            "April 2021 (93,300 miles): Engine oil and filter changed",
            "December 2019 (92,450 miles): Engine oil and filter changed",
            "July 2018 (91,000 miles): Engine oil and filter changed"
        ],
        "included_items": [
            "2 keys, 2 remote fobs (one does not work), and 1 valet key",
            "Owner's manual",
            "Window sticker",
            "Available service records",
            "Wheel locks and key",
            "Trunk mat"
        ],
        "ownership_history": "The seller purchased this RSX new in July 2002.",
        "auction_stats": {
            "reserve_status": "No reserve",
            "auction_status": "Sold to",
            "highest_bid_value": "$14,000",
            "auction_date": "Mar 20, 2023 9:02 PM",
            "view_count": "7,978",
            "bid_count": "9",
            "bids": [
                "$14,000",
                "$12,500",
                "$11,500",
                "$10,000",
                "$8,500",
                "$4,250",
                "$4,004",
                "$2,002",
                "$100"
            ]
        }
    },
    "https://carsandbids.com/auctions/9ldR5JLE/1996-porsche-911-carrera-4-cabriolet": {
        "auction_title": "1996 Porsche 911 Carrera 4 Cabriolet",
        "auction_subtitle": "6-Speed Manual, 1 Owner Since 2007, Sport Seats, Mostly Unmodified",
        "auction_quick_facts": {
            "Make": "Porsche",
            "Model": "911\nSave",
            "Mileage": "157,500 Miles Shown - TMU",
            "VIN": "WP0CA2999TS341221",
            "Title Status": "Clear (BC, Canada)",
            "Location": "Surrey, BC, Canada",
            "Seller": "Waltsu",
            "Engine": "3.6L Flat-6",
            "Drivetrain": "4WD/AWD",
            "Transmission": "Manual (6-Speed)",
            "Body Style": "Convertible",
            "Exterior Color": "Black",
            "Interior Color": "Cashmere Beige",
            "Seller Type": "Private Party"
        },
        "dougs_take": "I adore the 993 Porsche 911 as it combines truly beautiful looks with the last of the air-cooled flat-6 engines from Porsche — and this one touts some great benefits. It features some desirable factory equipment, namely a 6-speed manual transmission, all-wheel drive, sports seats, and gorgeous 18-inch wheels. Other benefits include limited modifications and some encouraging recent service history — and this 993 has been kept by the seller since 2007, which adds more peace of mind. The 993 continues to appreciate in the minds of enthusiasts, and I'm always thrilled to see them on Cars & Bids.",
        "auction_highlights": [
            "This 993 is equipped with the desirable 6-speed manual transmission.",
            "This Porsche is a Canadian-spec 993 that’s titled and located in Surrey, BC, Canada. The odometer displays in metric units and currently indicates approximately 253,400 kilometers or 157,500 miles.",
            "Factory equipment includes 18-inch alloy wheels, fog lights, a power-retractable soft top, a power-operated rear spoiler, leather upholstery, power-adjustable front seats, air conditioning, and a CD player, among others listed below. The seller reports modifications are limited to lowered suspension.",
            "The 993 911 was sold for the 1995 to 1998 model years and represented the last – and most powerful – generation of air-cooled 911s. Available as a coupe, cabriolet, and Targa, and with rear- or all-wheel drive, the 993 was an evolution of the 964 it replaced with a more modern look and redesigned rear suspension system.",
            "Power comes from a 3.6-liter air-cooled flat-6, rated at 282 horsepower and 250 lb-ft of torque. Output is sent to all four wheels via a 6-speed manual transmission."
        ],
        "auction_equipment": [
            "18-inch alloy wheels",
            "Fog lights",
            "Power-retractable soft top",
            "Wind deflector",
            "Power-operated rear spoiler",
            "Sport front seats (power-adjustable)",
            "Leather upholstery",
            "Leather-wrapped steering wheel",
            "Air conditioning",
            "CD player",
            "Power-operated windows, door locks, and mirrors"
        ],
        "modifications": [
            "Lowered suspension"
        ],
        "known_flaws": [
            "Although the included Carfax report indicates no accidents in this 911‘s past, the seller reports that in October 2017, the vehicle was rear-ended in a school zone; the seller reports the damage was minor. The seller also reports that in August 2010, the vehicle hit a curb while avoiding a dog; the front fender was repaired, and a wheel, steering knuckle, and lower control arm were replaced. The seller states the detailed list of items replaced is available upon request. Please contact the seller with any questions.",
            "The seller states the odometer stopped working in 2018 and was repaired in 2019. The seller estimates the reading may be low by approximately 1,500 kilometers or roughly 1,000 miles, and an invoice related to the repair is included in the gallery. As a result, this 993 is listed as True Mileage Unknown or TMU; the odometer currently displays 253,400 kilometers or 157,500 miles.",
            "Rust bubble on passenger door (pictured in gallery)",
            "Paint chips on forward-facing surfaces",
            "Scuff marks near taillights",
            "Soft top occasionally fails to engage when closing; adjustment needed",
            "Rear decklid struts need replacement",
            "Driver's seat leather cracking and wear on bolster",
            "Some fading and wear on interior leather surfaces",
            "Some wear on footwell carpet",
            "Some rust on exhaust system components"
        ],
        "services": [
            "July 2021 (156,120 miles): Fuel pump relay replaced",
            "April 2021 (155,612 miles): Valve cover and timing chain cover gaskets replaced, exhaust welds repaired, air distributor block replaced, new clutch pedal pad installed, spark plugs replaced, distributor cap/rotor replaced, ignition wires replaced",
            "October 2019 (153,901 miles): Odometer repaired",
            "August 2019: Soft top replaced",
            "April 2019 (153,901 miles): Engine oil and filter changed, cooling fan and air conditioning belts replaced, transmission fluid changed, front differential fluid changed, brake pads replaced, brake rotors replaced, brake wear sensors replaced, 4 tires replaced, window switches replaced"
        ],
        "included_items": [
            "2 keys and 2 fobs",
            "Owner's manual",
            "Car cover"
        ],
        "ownership_history": "The seller purchased this 911 in 2007 and has added approximately 104,500 miles since.",
        "auction_stats": {
            "reserve_status": "Reserve",
            "auction_status": "Sold to",
            "highest_bid_value": "$40,993",
            "auction_date": "Mar 20, 2023 8:56 PM",
            "view_count": "17,799",
            "bid_count": "31",
            "bids": [
                "$40,993",
                "$40,243",
                "$39,993",
                "$38,993",
                "$38,500",
                "$37,993",
                "$34,993",
                "$33,993",
                "$31,993",
                "$30,993",
                "$28,996",
                "$28,000",
                "$27,000",
                "$25,000",
                "$19,996",
                "$19,250",
                "$19,000",
                "$17,993",
                "$17,000",
                "$16,250",
                "$16,000",
                "$14,993",
                "$13,888",
                "$12,600",
                "$12,500",
                "$11,500",
                "$11,111",
                "$5,100",
                "$5,000",
                "$3,000",
                "$1,996"
            ]
        }
    },
    "https://carsandbids.com/auctions/rkZZOWNK/2008-lamborghini-gallardo-spyder": {
        "auction_title": "2008 Lamborghini Gallardo Spyder",
        "auction_subtitle": "~12,600 Miles, V10 Power, AWD, Rosso Vik, Unmodified",
        "auction_quick_facts": {
            "Make": "Lamborghini",
            "Model": "Gallardo\nSave",
            "Mileage": "12,600",
            "VIN": "ZHWGU22T08LA07427",
            "Title Status": "Clean (NY)",
            "Location": "Tyngsboro, MA 01879",
            "Seller": "ModernAutoSales",
            "Engine": "5.0L V10",
            "Drivetrain": "4WD/AWD",
            "Transmission": "Automatic (6-Speed)",
            "Body Style": "Convertible",
            "Exterior Color": "Rosso Vik",
            "Interior Color": "Nero",
            "Seller Type": "Dealer"
        },
        "dougs_take": "The Lamborghini Gallardo Spyder is a wonderful exotic car with a glorious naturally-aspirated V10, all-wheel drive, and timeless styling. This particular Gallardo Spyder is especially desirable, as it’s finished in the amazing Rosso Vik – and it touts just 12,600 miles. It’s also equipped with some great factory equipment, including the Interior Leather Package II, power-adjustable heated seats, and those beautiful 19-inch Callisto wheels. This Gallardo is also completely unmodified, and it's offered with a clean, accident-free Carfax report, further adding to the appeal. These baby Lambos represent a phenomenal value, and I’m certain the next owner will love all of the driving thrills this Gallardo has to offer.",
        "auction_highlights": [
            "The odometer currently displays approximately 12,600 miles.",
            "The attached Carfax history report shows no accidents or mileage discrepancies in this Gallardo’s past.",
            "According to the Monroney Label provided in the gallery, factory equipment includes the Interior Leather Package II, 19-inch Callisto wheels, bi-xenon headlights, a power-operated soft top, power-adjustable heated seats, a navigation system, dual-zone automatic climate control, and more as detailed below. No modifications have been reported by the selling dealer.",
            "Launched for 2004, the Gallardo filled a gap in the Lamborghini range that had remained empty for over a decade. It was smaller and more affordable than the V12-powered Murciélago, so it made the brand accessible to a wider target audience and landed in a segment dominated by arch-nemesis Ferrari. With sharp lines and a sonorous V10 engine, the Gallardo remained in production until 2014, when it was replaced by the Huracán. It retired as the best-selling member of the Lamborghini range to date.",
            "Power comes from a 5.0-liter V10, rated at 512 horsepower and 376 lb-ft of torque. Output is sent to all four wheels via a 6-speed automated manual transmission and a permanent all-wheel drive system."
        ],
        "auction_equipment": [
            "Interior Leather Package II (extended leather upholstery, brushed stainless steel kickplates)",
            "19-inch Callisto wheels",
            "Bi-xenon headlights",
            "Power-operated soft top",
            "Alcantara interior trim",
            "Power-adjustable heated seats",
            "Navigation system",
            "Dual-zone automatic climate control",
            "Wind deflector",
            "Rear-view camera"
        ],
        "modifications": [],
        "known_flaws": [
            "Some scratches on the driver-side front wheel",
            "Wear on the reverse button"
        ],
        "services": [
            "November 2022 (12,521 miles): New Michelin Pilot Sport 4S tires fitted",
            "November 2022 (12,517 miles): Engine oil and filter change, A/C evacuated and recharged"
        ],
        "included_items": [
            "2 keys",
            "Owner's manual",
            "Monroney Label"
        ],
        "ownership_history": "The selling dealer acquired this Gallardo in October 2022.",
        "auction_stats": {
            "reserve_status": "Reserve",
            "auction_status": "Sold to",
            "highest_bid_value": "$113,420",
            "auction_date": "Mar 20, 2023 8:46 PM",
            "view_count": "15,701",
            "bid_count": "60",
            "bids": [
                "$113,420",
                "$112,500",
                "$112,000",
                "$111,500",
                "$111,000",
                "$110,500",
                "$110,000",
                "$109,500",
                "$109,000",
                "$108,500",
                "$108,000",
                "$107,500",
                "$107,000",
                "$106,500",
                "$106,000",
                "$105,500",
                "$105,000",
                "$104,500",
                "$104,000",
                "$103,500",
                "$102,000",
                "$101,000",
                "$99,000",
                "$98,000",
                "$97,000",
                "$94,000",
                "$93,000",
                "$91,500",
                "$91,000",
                "$90,000",
                "$89,500",
                "$89,000",
                "$88,000",
                "$87,500",
                "$86,000",
                "$85,500",
                "$85,000",
                "$81,500",
                "$81,000",
                "$80,000",
                "$79,500",
                "$79,000",
                "$76,000",
                "$75,000",
                "$73,009",
                "$72,500",
                "$72,000",
                "$71,500",
                "$70,500",
                "$70,000",
                "$55,000",
                "$53,333",
                "$50,000",
                "$48,888",
                "$47,555",
                "$35,791",
                "$35,000",
                "$26,000",
                "$25,000",
                "$690"
            ]
        }
    },
    "https://carsandbids.com/auctions/3Bw508Az/2009-bmw-535i-xdrive-sports-wagon": {
        "auction_title": "2009 BMW 535i xDrive Sports Wagon",
        "auction_subtitle": "NO RESERVE Turbo 6-Cylinder, AWD, Premium Package, Deep Green Metallic, Unmodified",
        "auction_quick_facts": {
            "Make": "BMW",
            "Model": "535i\nSave",
            "Mileage": "117,900",
            "VIN": "WBAPT73579CX02704",
            "Title Status": "Clean (MA)",
            "Location": "Cambridge, MA 02139",
            "Seller": "rpayson1",
            "Engine": "3.0L Turbocharged I6",
            "Drivetrain": "4WD/AWD",
            "Transmission": "Automatic (6-Speed)",
            "Body Style": "Wagon",
            "Exterior Color": "Deep Green Metallic",
            "Interior Color": "Black",
            "Seller Type": "Private Party"
        },
        "dougs_take": "BMW wagons are excellent cars, and they've been a huge success on Cars & Bids – no surprise, as they combine excellent driving performance with good practicality. The E61 5 Series was the final 5 Series wagon BMW offered in the U.S. – and this particular example has a LOT going for it. It's a 535i model that touts all-wheel drive and a potent turbocharged 6-cylinder engine, and it's finished in a gorgeous Deep Green Metallic over black color combination. It also features some nice equipment like the Premium and Cold Weather packages, 17-inch Style 277 wheels, a panoramic sunroof, and a Logic7 surround sound system – plus, it's unmodified, which is a great benefit. On top of all that, this 535i wagon comes with a clean, accident-free Carfax report – AND it's offered with the thrill of no reserve.",
        "auction_highlights": [
            "The attached Carfax history report shows no accidents or mileage discrepancies in this 535i’s past.",
            "According to the build sheet provided in the gallery, factory equipment includes the Premium and Cold Weather packages, 17-inch Style 277 wheels, a panoramic sunroof, rear side window sunshades, Comfort Access keyless entry, Park Distance Control (PDC), a navigation system with RTTI, and a Logic7 surround sound system with DSP. The seller reports no modifications.",
            "Called E60 internally, the fifth-generation 5 Series made its American debut for 2004 and the E61 wagon arrived in 2006. Both were styled under the guidance of Chris Bangle and their design left no one indifferent. Inside, the E61 was more luxurious than its predecessor, and it offered drivers a longer list of technology features, but it continued to stand out with engaging handling and a cavernous trunk.",
            "BMW sold 9,885 units of the E61 in America. It was the final 5 Series wagon available here.",
            "Power comes from an \"N54\" 3.0-liter turbocharged straight-6, rated at 300 horsepower and 300 lb-ft of torque. Output is sent to all four wheels via a 6-speed automatic transmission and BMW's permanent xDrive all-wheel drive system."
        ],
        "auction_equipment": [
            "Premium Package (Dakota leather upholstery, integrated universal garage door opener, automatic-dimming rear-view mirror, power-folding side-view mirrors, automatic tailgate)",
            "Cold Weather Package (3-stage heated front seats, heated steering wheel, headlight cleaning system, ski bag)",
            "17-inch Style 277 wheels",
            "Adaptive xenon headlights",
            "Roof rails",
            "Panoramic sunroof",
            "Power-adjustable front seats with memory function",
            "Rear side window sunshades",
            "Dual-zone automatic climate control",
            "Comfort Access keyless entry",
            "Park Distance Control (PDC)",
            "Cruise control",
            "Navigation system with RTTI",
            "Logic7 surround sound system with DSP"
        ],
        "modifications": [],
        "known_flaws": [
            "Paint chips, scratches, and dings around the exterior",
            "Dents with paint damage ahead of the passenger's side rear wheel",
            "Scratches on wheels",
            "Tires are worn; 1 tire is mismatched",
            "Creases and wear on seats",
            "Wear on interior touchpoints",
            "\"PDC malfunction!\" error message is displayed",
            "The seller reports an oil leak."
        ],
        "services": [
            "December 2022 (117,782 miles): Transmission fluid changed, transmission mechatronics sleeve, transmission pan and pan bolts, transmission filter, and valve body seals replaced",
            "August 2022 (114,671 miles): Coolant expansion tank replaced, coolant changed",
            "July 2022 (113,082 miles): Engine oil and filter changed, right front CV axle and left front wheel speed sensor replaced",
            "January 2022 (108,353 miles): Engine oil and filter changed, battery, right wiper blade arm, hood struts, and engine ground strap replaced",
            "June 2021 (102,983 miles): Engine oil and filter changed, coolant flushed",
            "November 2020 (97,118 miles): Engine oil and filter changed, sunroof sun shade reinstalled, interior trim replaced",
            "July 2020 (91,693 miles): Engine oil and filter changed, turbochargers replaced, brake pads and rotors, boost control valves, vacuum lines, and low-pressure fuel sensor replaced",
            "February 2020 (85,199 miles): Driver's side xenon headlight bulb replaced",
            "February 2020 (85,099 miles): Engine oil and filter changed, engine cooler gasket, engine oil filter housing gasket and cap, drive belt tensioner and pulleys, and exhaust and intake VANOS adjusters replaced",
            "October 2019 (79,711 miles): Engine oil and filter changed, valve cover, valve cover gasket, and ignition coils replaced",
            "July 2019: Engine oil and filter changed, brake fluid changed, diversity antenna replaced",
            "November 2018: Engine oil and filter changed, interior trim and trunk lock actuator replaced, door seals repaired"
        ],
        "included_items": [
            "2 key fobs",
            "Owner's manuals",
            "Service records",
            "Roof rack cross bars",
            "Cargo cover",
            "Rubber floor mats and cargo mat",
            "BMW first aid kit"
        ],
        "ownership_history": "The seller purchased this 535i in August 2018 and has added approximately 54,000 miles since.",
        "auction_stats": {
            "reserve_status": "No reserve",
            "auction_status": "Sold to",
            "highest_bid_value": "$7,700",
            "auction_date": "Mar 20, 2023 8:38 PM",
            "view_count": "10,664",
            "bid_count": "19",
            "bids": [
                "$7,700",
                "$7,500",
                "$7,200",
                "$7,000",
                "$6,600",
                "$6,500",
                "$6,000",
                "$5,878",
                "$5,778",
                "$5,678",
                "$5,100",
                "$4,951",
                "$4,500",
                "$3,939",
                "$3,439",
                "$3,339",
                "$2,333",
                "$2,222",
                "$2,000"
            ]
        }
    },
    "https://carsandbids.com/auctions/KDggM7RM/1991-acura-nsx": {
        "auction_title": "1991 Acura NSX",
        "auction_subtitle": "~61,400 Miles, 5-Speed Manual, Mostly Unmodified",
        "auction_quick_facts": {
            "Make": "Acura",
            "Model": "NSX\nSave",
            "Mileage": "61,400",
            "VIN": "JH4NA1156MT003054",
            "Title Status": "Clean (KS)",
            "Location": "Stilwell, KS 66085",
            "Seller": "Grasutu",
            "Engine": "3.0L V6",
            "Drivetrain": "Rear-wheel drive",
            "Transmission": "Manual (5-Speed)",
            "Body Style": "Coupe",
            "Exterior Color": "Berlina Black",
            "Interior Color": "Ivory",
            "Seller Type": "Dealer"
        },
        "dougs_take": "The original Acura NSX is one of the most iconic Japanese sports cars ever made, boasting a high-revving V6 mounted in the middle, fantastic handling, and styling that still looks gorgeous even after all these years. This particular NSX has a lot going for it, including the highly desirable 5-speed manual transmission and an attractive color combination. It also boasts a reasonably low 61,400 miles, and the only change from stock is tinted windows. It also makes me especially happy to see this particular Acura again, as it was our first NSX on Cars & Bids – and I'm sure the next owner will enjoy the thrills it has to offer!",
        "auction_highlights": [
            "This NSX features the desirable 5-speed manual transmission, and the odometer currently displays approximately 61,400 miles.",
            "The attached Carfax history report has a few gaps but shows no accidents for the given time period.",
            "Factory equipment includes 15-inch front, and 16-inch rear forged wheels, a Torque Control differential, pop-up headlights, leather upholstery, power-adjustable seats, an Acura Bose sound system, and more as listed below. Modifications reported by the selling dealer are limited to tinted windows.",
            "Sold as a Honda in global markets, the first-generation Acura NSX made its debut for 1991 as a user-friendly supercar with Ferrari-like performance and Japanese reliability. Aluminum construction kept weight in check, and the NSX stood out as the first production car equipped with titanium connecting rods. Production of the original NSX ended in 2005.",
            "Power comes from a 3.0-liter V6, rated at 270 horsepower and 210 lb-ft of torque. Output is sent to the rear wheels via a 5-speed manual transmission."
        ],
        "auction_equipment": [
            "15-inch front, 16-inch rear forged wheels",
            "Torque Control differential",
            "Pop-up headlights",
            "Leather upholstery",
            "Power-adjustable seats",
            "Acura Bose sound system",
            "Automatic climate control",
            "Traction control",
            "Cruise control"
        ],
        "modifications": [
            "Tinted windows"
        ],
        "known_flaws": [
            "Paint chips on the hood",
            "Some wear and creases on the driver’s seat"
        ],
        "services": [
            "July 2018 (58,545 miles): Timing belt, drive belts, and water pump replaced, coolant flushed",
            "November 2011 (52,873 miles): Transmission housing replaced, oil pan gasket replaced, left axle rebuilt, ABS service performed"
        ],
        "included_items": [
            "3 keys",
            "Owner's manual",
            "Service records"
        ],
        "ownership_history": "The selling dealer acquired this NSX in April 2021 and has added approximately 800 miles since. It was previously sold on Cars & Bids in July 2020, and the auction is viewable here.",
        "auction_stats": {
            "reserve_status": "Reserve",
            "auction_status": "Sold to",
            "highest_bid_value": "$82,000",
            "auction_date": "Mar 20, 2023 8:36 PM",
            "view_count": "32,586",
            "bid_count": "33",
            "bids": [
                "$82,000",
                "$81,000",
                "$80,500",
                "$80,000",
                "$79,500",
                "$79,000",
                "$78,500",
                "$78,000",
                "$77,500",
                "$77,000",
                "$76,500",
                "$76,000",
                "$75,500",
                "$75,000",
                "$63,669",
                "$58,500",
                "$58,000",
                "$57,500",
                "$57,000",
                "$56,500",
                "$56,000",
                "$55,500",
                "$55,000",
                "$53,000",
                "$51,500",
                "$50,000",
                "$45,750",
                "$45,250",
                "$44,444",
                "$43,000",
                "$20,000",
                "$15,000",
                "$1,991"
            ]
        }
    },
    "https://carsandbids.com/auctions/98OWAqX2/2009-mercedes-benz-cl600": {
        "auction_title": "2009 Mercedes-Benz CL600",
        "auction_subtitle": "Twin-Turbo V12, Night View Assist, Florida-Owned, Mostly Unmodified",
        "auction_quick_facts": {
            "Make": "Mercedes-Benz",
            "Model": "CL600\nSave",
            "Mileage": "76,300",
            "VIN": "WDDEJ76X89A020137",
            "Title Status": "Clean (FL)",
            "Location": "Apopka, FL 32703",
            "Seller": "enthusiasteuros",
            "Engine": "5.5L Turbocharged V12",
            "Drivetrain": "Rear-wheel drive",
            "Transmission": "Automatic (5-Speed)",
            "Body Style": "Coupe",
            "Exterior Color": "Black",
            "Interior Color": "Black",
            "Seller Type": "Dealer"
        },
        "dougs_take": "The C216 Mercedes-Benz CL-Class is an elegant grand tourer that touts understated styling, a luxurious interior, and the latest technology that Mercedes-Benz offered during that era. This particular example is a CL600, which boasts tremendous power from its twin-turbocharged V12 – and a long list of desirable equipment that includes Active Body Control (ABC), Drive-Dynamic multicontour seats, Distronic Plus adaptive cruise control, and Night View Assist. It also comes with minimal modifications and a clean, accident-free Carfax report, showing warm-weather Florida ownership from new.",
        "auction_highlights": [
            "The attached Carfax history report shows no accidents or mileage discrepancies; it also shows that this CL600 has been registered in Florida since new.",
            "According to the build sheet provided in the gallery, factory equipment includes 19-inch wheels, Active Body Control (ABC) adaptive suspension, adaptive bi-xenon headlights, a power sunroof, Drive-Dynamic multicontour heated and active ventilated front seats, a heated wood and leather steering wheel, a Harman/Kardon sound system, Distronic Plus adaptive cruise control, Night View Assist, and more as detailed below. Modifications reported by the selling dealer are limited to tinted windows and wheels refinished in gray.",
            "Introduced for the 2007 model year, the “C216” CL-Class was based on the “W221” S-Class as Mercedes-Benz's flagship coupe. It was available only with V8 and V12 engines. The CL600 represented the top of the non-AMG-tuned range, featuring a powerful twin-turbocharged 5.5-liter V12 that gave it a 0-60 mph time of 4.5 seconds, advanced tech features, and a cabin made out of the finest materials.",
            "Power comes from a twin-turbocharged 5.5-liter V12 engine, rated at 510 horsepower and 612 lb-ft of torque. Output is sent to the rear wheels via a 5-speed automatic transmission."
        ],
        "auction_equipment": [
            "19-inch wheels",
            "Active Body Control (ABC) adaptive suspension",
            "Adaptive bi-xenon headlights",
            "Power sunroof",
            "Exclusive leather upholstery",
            "Drive-Dynamic multicontour heated and active ventilated front seats",
            "Heated wood and leather steering wheel",
            "Burl Walnut wood trim",
            "Dual-zone automatic climate control system",
            "Harman/Kardon sound system",
            "Comand infotainment system with DVD player",
            "Navigation system",
            "Rearview camera",
            "Distronic Plus adaptive cruise control",
            "Parking Guidance system",
            "Blind Spot Assistant",
            "Keyless Go system",
            "Night View Assist"
        ],
        "modifications": [
            "Wheels refinished in gray",
            "Tinted windows"
        ],
        "known_flaws": [
            "Paint chips on the hood",
            "Scratches and chips on both bumpers",
            "2016 date codes on rear tires",
            "Creases on front seats",
            "Wear on interior touch points",
            "Wavy upholstery on interior door panels",
            "TPMS warning light is illuminated"
        ],
        "services": [],
        "included_items": [
            "2 keys",
            "Owner's manual",
            "First aid kit"
        ],
        "ownership_history": "The selling dealer acquired this CL600 in February 2023.",
        "auction_stats": {
            "reserve_status": null,
            "auction_status": null,
            "highest_bid_value": null,
            "auction_date": null,
            "view_count": null,
            "bid_count": null,
            "bids": []
        }
    }
}