{
    "https://carsandbids.com/auctions/3oRMGv6a/2005-mercedes-benz-e55-amg-sedan": {
        "auction_title": "2005 Mercedes-Benz E55 AMG Sedan",
        "auction_subtitle": "469-hp Supercharged V8, Unmodified, California-Owned",
        "auction_quick_facts": {
            "Make": "Mercedes-Benz",
            "Model": "E55 AMG\nSave",
            "Mileage": "77,800",
            "VIN": "WDBUF76J65A742489",
            "Title Status": "Clean (CA)",
            "Location": "Thousand Oaks, CA 91362",
            "Seller": "imans5988",
            "Engine": "5.4L Supercharged V8",
            "Drivetrain": "Rear-wheel drive",
            "Transmission": "Automatic (5-Speed)",
            "Body Style": "Sedan",
            "Exterior Color": "Black",
            "Interior Color": "Black",
            "Seller Type": "Private Party"
        },
        "dougs_take": "The W211 Mercedes-Benz E55 AMG is an amazing sports sedan that combines handsome styling with great performance from its supercharged V8 – and surprisingly good reliability compared to other modern AMG models. This particular E55 AMG is finished in a classy black on black color combination, and it boasts with some desirable equipment, including the Lighting Package, 4-zone automatic climate control, and a Harman Kardon sound system. It also touts no modifications and warm climate California ownership since new, which are great benefits that add to the appeal.",
        "auction_highlights": [
            "The attached Carfax history report shows no mileage discrepancies; it also shows that this E55 has been registered in California since new.",
            "According to the build sheet provided in the gallery, factory equipment includes the Lighting Package, 18-inch AMG twin-spoke wheels, an AMG high-performance braking system, heated and power-adjustable multicontour front seats, an AMG sports steering wheel, a power rear sunshade, and a Harman Kardon sound system. The seller reports no modifications.",
            "Mercedes-Benz launched the W211-generation E-Class for the 2003 model year. Stylists brought the sedan into the 21st century with a much sleeker design, and engineers went to great lengths to make the W211 more enjoyable to drive than its predecessor. The supercharged E55 reigned over the range by offering supercar-like power, gargantuan brakes, and a long list of features in a subtle package.",
            "Power comes from a 5.4-liter supercharged V8, rated at 469 horsepower and 516 lb-ft of torque. Called M113K internally, it spins the rear wheels via a 5-speed automatic transmission."
        ],
        "auction_equipment": [
            "Lighting Package (bi-xenon low-beam and high-beam headlights with Active Curve Illumination, heated headlight washers)",
            "18-inch AMG twin-spoke wheels",
            "Airmatic air suspension system",
            "AMG high-performance braking system",
            "AMG sports exhaust system with four chrome outlets",
            "AMG-specific body kit",
            "Power trunk lid",
            "Power sunroof",
            "Leather upholstery",
            "Heated and power-adjustable multicontour front seats",
            "AMG sports steering wheel",
            "Power-adjustable steering column",
            "Power rear sunshade",
            "Black Birdseye Maple wood trim",
            "4-zone automatic climate control",
            "Navigation system",
            "6-disc CD changer",
            "Harman Kardon sound system"
        ],
        "modifications": [],
        "known_flaws": [
            "The attached Carfax history report notes that this E55 sustained \"minor damage\" in January 2020.",
            "Paint chips on forward-facing surfaces",
            "Curb rash and worn finish on wheels",
            "Creases and wear on front seats"
        ],
        "services": [
            "December 2020 (57,107 miles): Starter motor replaced",
            "December 2020 (57,084 miles): Engine oil and filter changed, transmission pan gasket, filter, and fluid changed, horns and wipers replaced",
            "December 2019 (54,871 miles): Engine oil and filter changed, valve cover gaskets, spark plugs, and ignition cables replaced",
            "August 2019 (54,054 miles): Front passenger door lock actuator replaced",
            "May 2019 (53,210 miles): Front air suspension struts, tires, and battery replaced, four-wheel alignment performed"
        ],
        "included_items": [
            "1 key",
            "Owner's manual"
        ],
        "ownership_history": "The seller purchased this E55 in July 2021 and has added approximately 20,000 miles since.",
        "auction_stats": {
            "reserve_status": "Reserve",
            "auction_status": "Sold to",
            "highest_bid_value": "$26,500",
            "auction_date": "Apr 6, 2023 11:10 PM",
            "view_count": "11,337",
            "bid_count": "36",
            "bids": [
                "$26,500",
                "$26,000",
                "$25,750",
                "$25,500",
                "$25,000",
                "$24,500",
                "$24,250",
                "$24,000",
                "$23,000",
                "$22,500",
                "$22,000",
                "$21,500",
                "$20,750",
                "$20,500",
                "$19,000",
                "$18,500",
                "$17,750",
                "$17,500",
                "$16,500",
                "$13,069",
                "$12,881",
                "$12,000",
                "$11,189",
                "$11,069",
                "$10,800",
                "$10,555",
                "$10,400",
                "$10,000",
                "$9,400",
                "$9,000",
                "$8,400",
                "$8,100",
                "$8,000",
                "$7,100",
                "$6,969",
                "$5,000"
            ]
        }
    },
    "https://carsandbids.com/auctions/rMM7NG4o/2005-subaru-legacy-25-gt-wagon": {
        "auction_title": "2005 Subaru Legacy 2.5 GT Wagon",
        "auction_subtitle": "NO RESERVE Turbocharged Flat-4, AWD, Some Modifications, Engine Replaced in 2020",
        "auction_quick_facts": {
            "Make": "Subaru",
            "Model": "Legacy\nSave",
            "Mileage": "138,500",
            "VIN": "4S3BP686154317589",
            "Title Status": "Clean (IL)",
            "Location": "Chicago, IL 60618",
            "Seller": "samlo_",
            "Engine": "2.5L Turbocharged Flat-4",
            "Drivetrain": "4WD/AWD",
            "Transmission": "Automatic (5-Speed)",
            "Body Style": "Wagon",
            "Exterior Color": "Brilliant Silver Metallic",
            "Interior Color": "Black/Gray",
            "Seller Type": "Private Party"
        },
        "dougs_take": "I think the 2005 Subaru Legacy GT hails from the most attractive generation of the Legacy – and this wagon version is extremely cool, touting all-wheel drive, a limited-slip rear differential, and a powerful turbocharged flat-4. This particular \"LGT\" features some great modifications that make it even more thrilling to drive, including a VF52 turbocharger, an HKS cat-back exhaust system, and Bilstein shocks and struts. It also boasts some nice recent maintenance and a clean, accident-free Carfax report, for additional peace of mind – AND it's offered with the excitement of no reserve!",
        "auction_highlights": [
            "The attached Carfax history report lists no accidents or mileage discrepancies in this Legacy's past.",
            "Factory equipment includes a limited-slip rear differential, cloth upholstery, heated front seats, a MOMO steering wheel, dual-zone automatic climate control, a 6-speaker sound system, a 6-disc in-dash CD changer, and cruise control.",
            "The full list of modifications reported by the seller is detailed below. Highlights include a VF52 turbocharger, an HKS cat-back exhaust system, a Cobb Accessport v3, Bilstein shocks and struts, 17-inch Flow One wheels, and a Yakima roof rack.",
            "Documentation in the gallery indicates that the engine was replaced in July 2020 at 127,235 miles.",
            "The fourth generation of the Subaru Legacy arrived in 2004 for the North American market, and marked the return of an available turbocharged engine to Subaru's midsize sedan and wagon. Offering exciting performance, sporty styling, and premium features, the fourth-generation Legacy earned a reputation as a more practical and grown-up alternative to the compact Impreza and WRX without sacrificing any of the fun and capable Subaru charm.",
            "Power comes from an EJ255 turbocharged 2.5-liter flat-4, rated at 250 horsepower and 250 lb-ft of torque in stock form. Due to the modifications performed to this Legacy, it may produce more power, but a dyno sheet was not provided to confirm. Output is sent to all four wheels via a 5-speed automatic transmission."
        ],
        "auction_equipment": [
            "Limited-slip rear differential",
            "Active Valve Control System (AVCS)",
            "Cloth upholstery",
            "Heated front seats",
            "MOMO steering wheel",
            "60/40 split-folding rear seats",
            "Dual-zone automatic climate control",
            "6-speaker sound system",
            "6-disc in-dash CD changer",
            "Cruise control",
            "Keyless entry system"
        ],
        "modifications": [
            "VF52 turbocharger",
            "Cobb Tuning silicone intercooler coupler",
            "Perrin turbo inlet hose",
            "HKS Silent Hi-Power cat-back exhaust system",
            "Cobb Accessport v3 with Six Star Motorsports ECU tune",
            "Bilstein shocks and struts",
            "17-inch Flow One F2 wheels",
            "Rally Armor mudflaps",
            "Yakima roof rack"
        ],
        "known_flaws": [
            "Chips, scratches, and dings around the exterior (pictured in the gallery)",
            "Scuffs under the front bumper",
            "Some discoloration on rear driver's side passenger door",
            "Bubbling paint and corrosion around the driver's side rear wheel arch (pictured in the gallery)",
            "Curb rash on wheels",
            "Creases on driver's seat",
            "Scratches on interior panels and touch points",
            "Indentations on the driver's side rear door panel",
            "Dome light fuse needs replacement",
            "Some rust on underbody components and brake hardware"
        ],
        "services": [
            "November 2022 (138,230 miles): Tires mounted and balanced, engine oil and filter changed, battery, air filter, cabin air filter, and valve cover gasket replaced",
            "April 2022 (136,555 miles): Engine oil and filter changed, tires mounted and balanced",
            "November 2021 (132,065 miles): Tires mounted and balanced, engine oil and filter changed",
            "September 2021: Smoke test performed, lower up pipe gasket and downpipe gasket replaced, VF52 turbocharger installed, ECU tuned",
            "August 2021 (131,138 miles): Passenger side rear metal brake line fitting replaced, brake system bled",
            "June 2021 (130,000 miles): Spark plugs, intercooler, bypass valve gasket, and gasket air intake duct replaced, Cobb Tuning intercooler coupler and Perrin inlet hose installed",
            "June 2021 (129,991 miles): Dashboard replaced, airbag replaced under recall",
            "August 2020 (127,240 miles): Wiper blades replaced, air conditioner recharged",
            "July 2020 (127,235 miles): Engine replaced, brake line replaced, headlights restored, brake system bled, exhaust flange installed",
            "Bilstein shocks and struts installed",
            "Tie rods replaced",
            "Sway bars replaced",
            "Control arms replaced",
            "Ball joints replaced"
        ],
        "included_items": [
            "1 key, 1 fob",
            "Owner's manual",
            "Service records",
            "Set of 17-inch factory wheels with Bridgestone Potenza tires",
            "Set of 17-inch Continental ExtremeContact tires",
            "Rubber floor mats and cargo mat"
        ],
        "ownership_history": "Although the Carfax history report indicates an ownership change in December 2021, the seller reports that they purchased this Legacy in July 2020.",
        "auction_stats": {
            "reserve_status": "No reserve",
            "auction_status": "Sold to",
            "highest_bid_value": "$8,700",
            "auction_date": "Apr 6, 2023 11:04 PM",
            "view_count": "7,300",
            "bid_count": "30",
            "bids": [
                "$8,700",
                "$8,600",
                "$8,500",
                "$8,400",
                "$8,300",
                "$8,200",
                "$7,999",
                "$7,700",
                "$7,525",
                "$6,900",
                "$6,800",
                "$6,525",
                "$6,200",
                "$6,025",
                "$5,555",
                "$5,025",
                "$3,100",
                "$3,000",
                "$2,424",
                "$2,322",
                "$2,222",
                "$2,100",
                "$2,000",
                "$1,414",
                "$1,300",
                "$1,200",
                "$999",
                "$344",
                "$200",
                "$100"
            ]
        }
    },
    "https://carsandbids.com/auctions/r4Y0dwED/2022-audi-s5-sportback": {
        "auction_title": "2022 Audi S5 Sportback",
        "auction_subtitle": "349-hp Turbo V6, AWD, Premium Plus and Black Optic Packages, Quantum Gray",
        "auction_quick_facts": {
            "Make": "Audi",
            "Model": "S5\nSave",
            "Mileage": "19,700",
            "VIN": "WAUC4CF52NA010713",
            "Title Status": "Clean (GA)",
            "Location": "Duluth, GA 30097",
            "Seller": "Mani_M",
            "Engine": "3.0L Turbocharged V6",
            "Drivetrain": "4WD/AWD",
            "Transmission": "Automatic (8-Speed)",
            "Body Style": "Sedan",
            "Exterior Color": "Quantum Gray",
            "Interior Color": "Black",
            "Seller Type": "Private Party"
        },
        "dougs_take": "The Audi S5 Sportback is one of my favorite modern Audi models, as it boasts a potent turbocharged V6 and attractive coupe-inspired styling with added practicality compared to a traditional sedan. This particular S5 touts an attractive Quantum Gray finish, and it features some great equipment, including the Premium Plus and Black Optic packages, a panoramic sunroof, and 3-zone climate control. It also has minimal modifications and a clean, accident-free Carfax report showing warm-climate Southern ownership since new, for added buyer confidence.",
        "auction_highlights": [
            "The attached Carfax history report shows no accidents or mileage discrepancies in this S5’s past. It also shows that it's been Southern-owned since new.",
            "A build sheet is provided in the photo gallery, and a partial list of notable equipment includes the Premium Plus and Black Optic packages, a panoramic sunroof, Nappa leather upholstery, carbon fiber interior trim, a navigation system, and 3-zone climate control. The only modification reported by the seller is window tint.",
            "Audi released the Sportback variant of the second-generation S5 for the 2018 model year, and was to the A4 what the A7 was to the A6: closely related to its sedan counterpart underneath the sheet metal but with a swoopy, fastback-like silhouette that gave it stand-out style and lift-back practicality. The S5 model neatly fills the gap between the base A5 and the range-topping RS5.",
            "Power comes from a 3.0-liter turbocharged V6, rated at 349 horsepower and 369 lb-ft of torque. Output is sent to all four wheels via an 8-speed automatic transmission and Audi's Quattro permanent all-wheel drive system."
        ],
        "auction_equipment": [
            "Premium Plus Package (Bang & Olufsen sound system, auto-dimming and power-folding side mirrors, heated and hands-on detection-equipped steering wheel, leatherette upholstery on center console and door armrests, driver's seat memory function, Audi phone box, rear USB ports, Audi Virtual Cockpit Plus, SiriusXM All-Access compatibility, top-view camera system, Parking System Plus with front and rear parking sensors, keyless entry and engine start/stop, adaptive cruise control with traffic jam assist, Audi Active Lane Assist, Audi Side Assist with Pre-Sense Rear)",
            "Black Optic Package (20-inch 5-spoke polygon design wheels with bi-color finish, black exterior trim, badges, and mirror housings)",
            "Sports rear differential",
            "S sports suspension",
            "Automatic Matrix LED headlights",
            "Panoramic sunroof",
            "Nappa leather upholstery",
            "Power-adjustable and heated front sports seats",
            "Carbon fiber interior trim",
            "3-zone climate control",
            "Navigation system",
            "Apple CarPlay compatibility"
        ],
        "modifications": [
            "Tinted windows"
        ],
        "known_flaws": [
            "Curb rash on wheels",
            "Some creases on driver’s seat bolsters"
        ],
        "services": [
            "December 2022 (15,433 miles): Engine oil and filter changed",
            "November 2022 (14,645 miles): Engine oil and filter changed",
            "July 2022 (8,794 miles): 10,000-mile service performed, engine oil and filter changed"
        ],
        "included_items": [
            "2 keys",
            "Rubber floor mats"
        ],
        "ownership_history": "The seller is representing this S5 on behalf of a family member, who purchased this S5 in December 2022 and has added approximately 4,300 miles since. ",
        "auction_stats": {
            "reserve_status": "Reserve",
            "auction_status": "Reserve not met, bid to",
            "highest_bid_value": "$49,000",
            "auction_date": "Apr 6, 2023 10:56 PM",
            "view_count": "7,460",
            "bid_count": "11",
            "bids": [
                "$49,000",
                "$48,250",
                "$48,000",
                "$47,250",
                "$47,000",
                "$45,250",
                "$45,000",
                "$40,250",
                "$40,000",
                "$20,000",
                "$100"
            ]
        }
    },
    "https://carsandbids.com/auctions/3z2R7qzN/1982-chevrolet-luv-diesel": {
        "auction_title": "1982 Chevrolet LUV Diesel",
        "auction_subtitle": "NO RESERVE ~33,700 Miles, 5-Speed Manual, Rare 2.2L Diesel, Metallic Blue",
        "auction_quick_facts": {
            "Make": "Chevrolet",
            "Model": "Luv\nSave",
            "Mileage": "33,700",
            "VIN": "J8ZBL14SXC8201601",
            "Title Status": "Clean (AL)",
            "Location": "Metairie, LA 70001",
            "Seller": "Devonanno1",
            "Engine": "2.2L Diesel I4",
            "Drivetrain": "Rear-wheel drive",
            "Transmission": "Manual (5-Speed)",
            "Body Style": "Truck",
            "Exterior Color": "Metallic Blue",
            "Interior Color": "Blue",
            "Seller Type": "Dealer"
        },
        "dougs_take": "Now THIS is interesting! When was the last time you saw a Chevrolet LUV? Not many of these were built, and far fewer have survived, as they were often driven into the ground – but this example has seemingly fared pretty well. It boasts low indicated mileage – its odometer hasn't even crossed the 35,000-mile mark yet! It also touts the robust diesel engine that was only offered for one model year, a 5-speed manual transmission, AND a very cool blue interior. This Chevy LUV is also very nearly unmodified, which is a nice benefit – it's even still wearing the factory 14-inch steel wheels and metal hubcaps. No reserve further enhances this truck's appeal.",
        "auction_highlights": [
            "This truck's odometer displays about 33,700 miles.",
            "The attached Carfax history report starts in 2009 and contains several gaps. It lists no accidents during the given time period, and it shows that this truck was Alabama-owned during those years.",
            "Factory equipment includes 14-inch steel wheels, metal hubcaps, a rear step bumper, vinyl upholstery, a bench seat, manual windows, air conditioning, and an AM/FM stereo. The only modification reported by the selling dealer is diamond plating on the bottom part of the tailgate.",
            "The short-lived second-generation LUV (\"Light Utility Vehicle\") made its debut for 1980 as a badge-engineered Isuzu P'up. Positioned at the bottom of Chevrolet's pickup range, it was offered in numerous configurations including rear- or four-wheel-drive and with a gasoline- or a diesel-burning engine. Chevrolet highlighted fuel economy as one of the model's main selling points. 1982 was the diesel engine's first, last, and only model year; the original S-10 replaced the LUV after the 1982 model year.",
            "Power comes from a 2.2-liter diesel 4-cylinder engine, rated at 58 horsepower and 93 lb-ft of torque. It spins the rear wheels via a 5-speed manual transmission."
        ],
        "auction_equipment": [
            "14-inch steel wheels",
            "Metal hubcaps",
            "White exterior decals",
            "Rear step bumper",
            "Vinyl upholstery",
            "Bench seat",
            "Manual windows",
            "Manual locks",
            "Air conditioning",
            "AM/FM stereo"
        ],
        "modifications": [
            "Diamond plating on the tailgate"
        ],
        "known_flaws": [
            "Exterior chips, scratches, dings, and dents",
            "Broken \"LUV\" emblem on the passenger-side fender",
            "Dry-rotted windshield wiper blades",
            "Rear window seal cracked",
            "Scratches in the cargo box",
            "Scratches on the wheels",
            "2006 date code on the tires",
            "Wear on the driver-side bench seat and on some of the interior touch points",
            "Cracked flooring in the driver's footwell",
            "Torn upholstery on the door panels",
            "Some rust on the cargo box, tailgate, and some of the underbody components"
        ],
        "services": [],
        "included_items": [
            "1 key",
            "Bluetooth module"
        ],
        "ownership_history": "The selling dealer purchased this LUV in 2023.",
        "auction_stats": {
            "reserve_status": "No reserve",
            "auction_status": "Sold to",
            "highest_bid_value": "$12,100",
            "auction_date": "Apr 6, 2023 10:50 PM",
            "view_count": "11,932",
            "bid_count": "52",
            "bids": [
                "$12,100",
                "$12,000",
                "$11,800",
                "$11,600",
                "$11,500",
                "$11,100",
                "$11,000",
                "$10,900",
                "$10,700",
                "$10,600",
                "$10,500",
                "$10,400",
                "$10,300",
                "$10,200",
                "$10,100",
                "$10,000",
                "$9,800",
                "$9,700",
                "$9,600",
                "$9,500",
                "$9,400",
                "$9,300",
                "$9,200",
                "$9,100",
                "$9,000",
                "$8,900",
                "$8,800",
                "$8,700",
                "$8,600",
                "$8,500",
                "$8,400",
                "$8,300",
                "$8,200",
                "$7,900",
                "$7,800",
                "$7,600",
                "$7,500",
                "$7,000",
                "$6,800",
                "$6,600",
                "$6,500",
                "$4,455",
                "$4,200",
                "$4,000",
                "$3,800",
                "$3,550",
                "$3,433",
                "$3,333",
                "$2,222",
                "$2,000",
                "$1,500",
                "$1,000"
            ]
        }
    },
    "https://carsandbids.com/auctions/35y64pPP/2003-bmw-m5": {
        "auction_title": "2003 BMW M5",
        "auction_subtitle": "6-Speed Manual, Britalman Exhaust, Extensive Service History, California-Owned",
        "auction_quick_facts": {
            "Make": "BMW",
            "Model": "M5\nSave",
            "Mileage": "238,000",
            "VIN": "WBSDE93473CF93389",
            "Title Status": "Clean (CA)",
            "Location": "Garden Grove, CA 92844",
            "Seller": "bmwhead",
            "Engine": "4.9L V8",
            "Drivetrain": "Rear-wheel drive",
            "Transmission": "Manual (6-Speed)",
            "Body Style": "Sedan",
            "Exterior Color": "Titanium Silver Metallic",
            "Interior Color": "Black",
            "Seller Type": "Private Party"
        },
        "dougs_take": "The E39 M5 is a BMW icon and a fantastic sport sedan, thanks to its handsome styling, excellent handling, and the combination of a potent naturally aspirated V8 with a mandatory 6-speed manual transmission. This particular M5 has a lot going for it, boasting some nice factory equipment, like Nappa leather upholstery, heated front seats, and an M sound system. It also touts a few upgrades, including an incredibly rare Britalman exhaust system, Bilstein PSS9 coilover suspension, and a Dinan rear sway bar. Other benefits include an extensively documented service history, which should provide some major peace of mind to the next owner – and a clean, accident-free Carfax report showing ownership in warm-weather California from new, which always adds to the appeal.",
        "auction_highlights": [
            "The attached Carfax history report lists no accidents or mileage discrepancies in this BMW's past. It also confirms that this M5 has been registered in California from new.",
            "According to the window sticker provided in the gallery, factory equipment includes 18-inch Style 65 wheels, a sunroof, a Sport interior with Nappa leather upholstery, heated and power-adjustable front seats, an M audio system with enhanced bass, and more as listed below.",
            "Modifications reported by the seller include a Britalman X-pipe and mufflers, an E65 7-series master cylinder, a Bilstein PSS9 coilover suspension, a Dinan rear sway bar, Meyle HD suspension components, European-style xenon headlights, and more as detailed below.",
            "Service records and parts receipts provided in the photo gallery detail most of the repairs and maintenance performed on this M5 under the seller's ownership. Work performed since 2020 includes the replacement of the VANOS system, rod bearings, timing chain guides, clutch, and exterior trim.",
            "Celebrated by many enthusiasts as the best of its breed, the \"E39\"-generation M5 made its American debut for the 2000 model year. It was the first BMW M model powered by a V8 engine, and it was exclusively offered with a 6-speed manual transmission. Car & Driver crowned it \"the most desirable sedan in the world\" in 2000.",
            "BMW gave the M5 a facelift in 2001. It added the now-famous \"Halo\" headlights, Celis rear lights, redesigned fog lights, a new-look steering wheel, gray instrument gauges, and a 16:9 navigation display, among other features.",
            "Power for this M5 comes from a 4.9-liter \"S62\" V8, rated at 394 horsepower and 369 lb-ft of torque. Output is sent to the rear wheels via a 6-speed manual transmission."
        ],
        "auction_equipment": [
            "18-inch Style 65 wheels",
            "Fog lights",
            "Power-operated sunroof",
            "Nappa leather upholstery",
            "Aluminum interior trim",
            "Heated and power-adjustable front seats",
            "M audio system with enhanced bass",
            "Navigation system",
            "Rear side sunshades",
            "Power-operated rear sunshade",
            "Rain-sensing windshield wipers",
            "Cruise control"
        ],
        "modifications": [
            "Britalman X-pipe and mufflers",
            "E65 7-series master cylinder",
            "Bilstein PSS9 coilover suspension",
            "Meyle HD suspension components",
            "Dinan rear sway bar",
            "Einhorn Industries Unicorn reigns",
            "Einhorn Industries solid subframe and differential bushings",
            "Einhorn Industries Unicorn nipple",
            "Einhorn Industries Unicorn nuggets",
            "Einhorn Industries lightweight flywheel",
            "E60 545i shift lever",
            "BlueBus module",
            "Turner Motorsport zinc-plated stainless steel brake lines",
            "European-style xenon headlights",
            "Alcantara sun visors",
            "F10 M5 illuminated shift knob",
            "LED interior light bulbs"
        ],
        "known_flaws": [
            "Some rock chips on front bumper; scratches on front bumper",
            "Scratches on passenger's side rear wheel",
            "Creases on driver's seat"
        ],
        "services": [
            "May 2022 (228,953 miles): Maintenance inspection completed and headlights adjusted",
            "September 2021: Wheel bearings, power brake booster, fuel pump, brake lines, and parking cables replaced",
            "August 2021: Flywheel reinstalled",
            "June 2021 (224,354 miles): Timing chain guides, oil drain plug gasket, engine timing cover gasket, engine valve cover gaskets, and crankshaft seal replaced, VANOS rebuilt, differential fluid flushed",
            "March 2021 (224,617 miles): Recall performed",
            "May 2020: Differential bushings recall",
            "December 2022: Engine oil and filter changed, transmission and differential fluid flushed",
            "Clutch, oxygen sensors, spark plugs, and battery replaced, four tires installed"
        ],
        "included_items": [
            "2 keys",
            "Owner's manual",
            "Window sticker",
            "Selection of factory parts"
        ],
        "ownership_history": "The seller purchased this M5 in June 2021 and added approximately 13,200 miles since.",
        "auction_stats": {
            "reserve_status": "Reserve",
            "auction_status": "Sold to",
            "highest_bid_value": "$30,500",
            "auction_date": "Apr 6, 2023 10:40 PM",
            "view_count": "10,609",
            "bid_count": "24",
            "bids": [
                "$30,500",
                "$30,250",
                "$30,000",
                "$29,500",
                "$29,250",
                "$29,000",
                "$28,750",
                "$28,500",
                "$28,250",
                "$28,000",
                "$27,000",
                "$26,250",
                "$26,000",
                "$24,000",
                "$23,000",
                "$21,000",
                "$20,000",
                "$18,000",
                "$17,500",
                "$6,100",
                "$6,000",
                "$5,880",
                "$5,539",
                "$2,003"
            ]
        }
    },
    "https://carsandbids.com/auctions/rG1GbZ5d/2015-volkswagen-golf-r": {
        "auction_title": "2015 Volkswagen Golf R",
        "auction_subtitle": "NO RESERVE Turbo 4-Cylinder, AWD, Mostly Unmodified",
        "auction_quick_facts": {
            "Make": "Volkswagen",
            "Model": "Golf R\nSave",
            "Mileage": "69,600",
            "VIN": "WVWLF7AU6FW316899",
            "Title Status": "Clean (PA)",
            "Location": "King Of Prussia, PA 19406",
            "Seller": "MotorcarsOfTheMainLine",
            "Engine": "2.0L Turbocharged I4",
            "Drivetrain": "4WD/AWD",
            "Transmission": "Automatic (6-Speed)",
            "Body Style": "Hatchback",
            "Exterior Color": "Limestone Gray Metallic",
            "Interior Color": "Black",
            "Seller Type": "Dealer"
        },
        "dougs_take": "There's a lot to like about the Volkswagen Golf R – it's quick, it boasts excellent handling thanks in part to the 4Motion all-wheel-drive system, AND it offers the practicality you'd expect from a hatchback. It's a car you can commute in during the week, take on a twisty road on a Saturday, and use for a hardware store run on a Sunday. This Golf R boasts a clean, accident-free Carfax report for peace of mind, and it's very nearly unmodified – both desirable benefits. It's finished in Limestone Gray Metallic, which is an attractive, low-key, and relatively unusual color, and it's an automatic so it's easier to drive daily than a manual model. This Golf R is also offered with the thrill of no reserve by an excellent seller and personal friend of mine.",
        "auction_highlights": [
            "The attached Carfax history report shows no accidents or mileage discrepancies in this Golf's past.",
            "Factory equipment includes 19-inch wheels, a Golf R-specific body kit, bi-xenon headlights, heated and power-adjustable front sport seats, split-folding rear seats, ambient lighting, a 5.8-inch touchscreen for the infotainment system, and a rear-view camera. The only modification reported by the selling dealer is a pair of shift paddle extensions.",
            "Volkswagen introduced the second-generation Golf R for the 2015 model year as the quickest and most powerful series-produced evolution of the seventh-generation Golf. Putting a powerful engine and all-wheel-drive in a humble Golf was a formula that enthusiasts loved. R owners enjoyed impressive performance, sharp handling, and the versatility of a hatchback with split-folding rear seats.",
            "Power comes from a 2.0-liter turbocharged 4-cylinder engine, rated at 292 horsepower and 280 lb-ft of torque. It spins the four wheels via a 6-speed dual-clutch automatic transmission and Volkswagen's 4Motion all-wheel-drive system."
        ],
        "auction_equipment": [
            "19-inch wheels",
            "Golf R-specific body kit",
            "Bi-xenon headlights",
            "Quad exhaust tips",
            "Leather upholstery",
            "Heated and power-adjustable front sport seats",
            "Split-folding rear seats",
            "R-specific instrument cluster",
            "Heated and power-adjustable door mirrors",
            "Ambient lighting",
            "5.8-inch touchscreen for the infotainment system",
            "Rear-view camera",
            "Cruise control"
        ],
        "modifications": [
            "Shift paddle extensions"
        ],
        "known_flaws": [
            "Scratches on the bottom part of the front bumper and on the rear bumper",
            "Dings on the roof (reportedly repaired with a paintless ding removal process)",
            "Ding on the driver-side rear wheel arch",
            "Rear wiper bolt cover missing",
            "Tear in the passenger-side front tire sidewall",
            "Some wear on the driver's seat's outer bolsters and on the steering wheel",
            "Bolt cover missing on the middle rear seatback's hook",
            "Some rust on some of the underbody components"
        ],
        "services": [
            "March 2023 (69,517 miles): Engine oil and filter and left license plate light assembly changed",
            "December 2022 (66,478 miles): Flat tire repaired and wiper blades replaced",
            "March 2022 (62,016 miles): Engine oil and filter, engine air filter, coolant, brake fluid, adaptive light bulbs, cabin air filter, and gear shift trim cover changed",
            "April 2021 (53,535 miles): Wiper(s) replaced",
            "December 2020 (51,249 miles): Coolant leak repaired and coolant flushed",
            "November 2020 (49,785 miles): Engine oil and filter changed",
            "October 2020 (49,080 miles): Vapor canister purge solenoid replaced",
            "November 2019: Wheels repaired",
            "September 2019: Battery replaced",
            "June 2019 (40,971 miles): Engine oil and filter, front brake pads and rotors, and cabin air filter changed",
            "August 2018 (37,110 miles): Loose pin repaired"
        ],
        "included_items": [
            "1 key",
            "Owner's manuals",
            "Service records"
        ],
        "ownership_history": "The selling dealer acquired this Golf R in 2023.",
        "auction_stats": {
            "reserve_status": "No reserve",
            "auction_status": "Sold to",
            "highest_bid_value": "$23,001",
            "auction_date": "Apr 6, 2023 10:37 PM",
            "view_count": "8,945",
            "bid_count": "41",
            "bids": [
                "$23,001",
                "$22,750",
                "$22,500",
                "$22,250",
                "$22,000",
                "$21,750",
                "$21,500",
                "$21,250",
                "$21,000",
                "$20,750",
                "$20,500",
                "$20,000",
                "$19,750",
                "$19,500",
                "$19,250",
                "$19,000",
                "$18,750",
                "$18,500",
                "$18,250",
                "$18,000",
                "$17,750",
                "$17,500",
                "$17,250",
                "$17,000",
                "$16,750",
                "$16,500",
                "$16,250",
                "$16,000",
                "$14,800",
                "$14,500",
                "$14,100",
                "$14,000",
                "$13,123",
                "$13,000",
                "$12,678",
                "$12,500",
                "$12,000",
                "$10,100",
                "$10,000",
                "$8,000",
                "$5,555"
            ]
        }
    },
    "https://carsandbids.com/auctions/rwya0mbw/2023-rivian-r1s-launch-edition": {
        "auction_title": "2023 Rivian R1S Launch Edition",
        "auction_subtitle": "Quad-Motor AWD, Large Battery Pack, Forest Edge Interior",
        "auction_quick_facts": {
            "Make": "Rivian",
            "Model": "R1S\nSave",
            "Mileage": "100",
            "VIN": "7PDSGABL5PN000583",
            "Title Status": "Clean (CA)",
            "Location": "Roseville, CA 95747",
            "Seller": "sandhunick07",
            "Engine": "Quad Electric Motors",
            "Drivetrain": "4WD/AWD",
            "Transmission": "Automatic",
            "Body Style": "SUV/Crossover",
            "Exterior Color": "Forest Green",
            "Interior Color": "Forest Edge",
            "Seller Type": "Private Party"
        },
        "dougs_take": "The Rivian R1S is an excellent option if you're in the market for an electric SUV – it's quick, it's spacious, and it touts a long list of cool and useful tech features. This particular R1S is a 2023 Launch Edition model that's finished in gorgeous Forest Green with a complementary Forest Edge interior, and it features the 22-inch Sport Bright wheels, along with a quad-motor drivetrain rated at an amazing 835 horsepower. Like all Launch Edition models, this R1S touts the large battery pack, which unlocks an impressive 303-mile driving range with the 22-inch wheels. This Rivian is also unmodified, it comes with a clean, accident-free Carfax report, and it's essentially new with less than 100 miles on the odometer.",
        "auction_highlights": [
            "The attached Carfax history report indicates no accidents in this Rivian's brief past.",
            "Factory equipment includes 22-inch Sport Bright wheels, an air suspension system, heated, ventilated, and power-adjustable front seats, heated second-row seats, folding third-row seats, warm ash wood interior trim, an air compressor integrated into the trunk, and a Rivian Elevation by Meridian sound system. The seller reports no modifications.",
            "The R1S entered production in 2022 as Rivian's second model. Closely related to the R1T pickup, it's an electric SUV with up to seven seats that was developed with the outdoors in mind. It's spacious, and it features a long list of comfort and technology features as well as through-the-road all-wheel drive.",
            "Power comes from four electric motors, which draw electricity from a 135-kilowatt-hour lithium-ion battery pack to zap the four wheels with 835 horsepower and 908 lb-ft of torque. The R1S earned a maximum driving range rating of 303 miles from the EPA when equipped with the 22-inch wheels."
        ],
        "auction_equipment": [
            "22-inch Sport Bright wheels",
            "Large battery pack",
            "Air suspension system",
            "Vegan leather upholstery",
            "Heated, ventilated, and power-adjustable front seats",
            "Heated second-row seats",
            "Folding third-row seats",
            "Warm ash wood interior trim",
            "Heated steering wheel",
            "Compass Yellow interior accents",
            "Air compressor integrated into the trunk",
            "Removable Bluetooth-compatible speaker in the center console",
            "Rivian Elevation by Meridian sound system",
            "Adaptive cruise control",
            "Lane Keep Assistance",
            "Lane Departure Warning",
            "Kinetic roll control"
        ],
        "modifications": [],
        "known_flaws": [],
        "services": [],
        "included_items": [
            "1 wristband key, 1 key fob, and 2 key cards",
            "Rivian safety guide"
        ],
        "ownership_history": "The seller purchased this Rivian new in March 2023.",
        "auction_stats": {
            "reserve_status": "Reserve",
            "auction_status": "Sold to",
            "highest_bid_value": "$97,000",
            "auction_date": "Apr 6, 2023 10:24 PM",
            "view_count": "5,849",
            "bid_count": "30",
            "bids": [
                "$97,000",
                "$96,500",
                "$95,500",
                "$95,000",
                "$92,500",
                "$92,000",
                "$91,500",
                "$91,000",
                "$90,500",
                "$90,000",
                "$89,500",
                "$81,000",
                "$80,000",
                "$79,000",
                "$78,500",
                "$78,000",
                "$76,000",
                "$74,500",
                "$74,000",
                "$73,500",
                "$72,500",
                "$72,000",
                "$70,000",
                "$69,420",
                "$68,000",
                "$66,666",
                "$60,000",
                "$55,000",
                "$50,000",
                "$25,000"
            ]
        }
    },
    "https://carsandbids.com/auctions/rb05dDGy/2006-bmw-330ci-zhp-convertible": {
        "auction_title": "2006 BMW 330Ci ZHP Convertible",
        "auction_subtitle": "NO RESERVE Mostly Unmodified, Alpine White, Final-Year E46",
        "auction_quick_facts": {
            "Make": "BMW",
            "Model": "330Ci\nSave",
            "Mileage": "87,900 Miles Shown",
            "VIN": "WBABW53446PZ41161",
            "Title Status": "Clean (IL)",
            "Location": "Naperville, IL 60563",
            "Seller": "sportscars123",
            "Engine": "3.0L I6",
            "Drivetrain": "Rear-wheel drive",
            "Transmission": "Automatic (5-Speed)",
            "Body Style": "Convertible",
            "Exterior Color": "Alpine White",
            "Interior Color": "Black",
            "Seller Type": "Dealer"
        },
        "dougs_take": "The E46 BMW 330Ci is a fan favorite among 3 Series enthusiasts, especially when equipped with the famed ZHP Performance Package accompanied by a top-down driving experience. This 330Ci is finished in the desirable combination of Alpine White with a black interior and black top — and it features limited modifications, which is becoming an uncommon sight. This 330Ci is also equipped with the Cold Weather Package, adaptive xenon headlights, and a Harman/Kardon sound system. The accident-free Carfax report provides peace of mind, too — and this almost-stock 330Ci is made even more appealing with the excitement of no reserve.",
        "auction_highlights": [
            "The attached Carfax history report shows no accidents.",
            "According to the build sheet provided in the gallery, factory equipment includes the ZHP Performance and Cold Weather packages, adaptive xenon headlights, a power-operated soft top, Montana leather upholstery, a navigation system, and a Harman/Kardon sound system. Modifications reported by the seller are limited to black kidney grills and an OQTIQ car phone holder.",
            "The ZHP Performance Package, offered during the last few years of E46 production, bridged the gap between the standard 3 Series and the high-performance M3. The package included a number of styling and handling upgrades, as well as a more powerful engine with ZHP-specific camshafts.",
            "Power comes from an \"M54\" 3.0-liter inline-6, rated at 235 horsepower and 222 lb-ft of torque. Output is sent to the rear wheels through a 5-speed automatic transmission."
        ],
        "auction_equipment": [
            "ZHP Performance Package (increased output to 235 horsepower, 18-inch Style 135 wheels, M Sport suspension, M Aerodynamic Package, cube aluminum interior trim, front sport seats, M Sport steering wheel)",
            "Cold Weather Package (retractable headlight washers, heated front seats, ski bag)",
            "Xenon headlights",
            "Navigation system",
            "Harman/Kardon sound system"
        ],
        "modifications": [
            "Black kidney grills",
            "OQTIQ car phone holder"
        ],
        "known_flaws": [
            "Creases on soft top",
            "Scratches on wheels",
            "Creases and wear on driver's seat",
            "Scratches on door handle cube trim",
            "Separation on the inner C-pillar lining (pictured in the photo gallery)"
        ],
        "services": [
            "December 2022 (87,229 miles): Engine and oil filter replaced",
            "March 2021 (82,167 miles): Engine oil and filter changed"
        ],
        "included_items": [
            "1 key",
            "Owner's manual"
        ],
        "ownership_history": "The selling dealer purchased this 330Ci in January 2023 and has added approximately 100 miles since.",
        "auction_stats": {
            "reserve_status": "No reserve",
            "auction_status": "Sold to",
            "highest_bid_value": "$13,000",
            "auction_date": "Apr 6, 2023 10:14 PM",
            "view_count": "5,692",
            "bid_count": "24",
            "bids": [
                "$13,000",
                "$12,650",
                "$12,500",
                "$11,100",
                "$11,000",
                "$10,600",
                "$10,500",
                "$10,100",
                "$10,000",
                "$9,000",
                "$8,800",
                "$8,600",
                "$8,500",
                "$8,000",
                "$7,700",
                "$7,500",
                "$7,400",
                "$7,300",
                "$7,200",
                "$6,100",
                "$6,000",
                "$4,500",
                "$3,450",
                "$3,330"
            ]
        }
    },
    "https://carsandbids.com/auctions/3LW2MgWG/2018-volkswagen-golf-alltrack-sel": {
        "auction_title": "2018 Volkswagen Golf Alltrack SEL",
        "auction_subtitle": "Turbo 4-Cylinder, AWD, APR Modifications, Southern-Owned",
        "auction_quick_facts": {
            "Make": "Volkswagen",
            "Model": "Golf Alltrack\nSave",
            "Mileage": "38,600",
            "VIN": "3VWH17AU7JM762375",
            "Title Status": "Clean (GA)",
            "Location": "Newnan, GA 30263",
            "Seller": "zjchahalis",
            "Engine": "1.8L Turbocharged I4",
            "Drivetrain": "4WD/AWD",
            "Transmission": "Automatic (6-Speed)",
            "Body Style": "Wagon",
            "Exterior Color": "Silk Blue Metallic",
            "Interior Color": "Titan Black",
            "Seller Type": "Private Party"
        },
        "dougs_take": "We love wagons on Cars & Bids, and this a particularly nice one – a Volkswagen Golf Alltrack with a potent turbocharged 4-cylinder and VW’s 4Motion all-wheel-drive system. This particular Alltrack also benefits from a number of desirable APR modifications, including ECU and transmission tunes, along with a set of handsome 18-inch A01 wheels. It also boasts some great factory equipment, including the Driver Assistance package, power-adjustable heated front seats, and a panoramic sunroof. Other benefits include a clean, accident-free Carfax report showing ownership in warm-weather Florida and Georgia from new, further adding to the appeal.",
        "auction_highlights": [
            "The attached Carfax history report shows no accidents or mileage discrepancies; it also shows that this Alltrack has been registered in Florida and Georgia since new.",
            "According to the window sticker provided in the photo gallery, factory equipment includes the Driver Assistance Package, adaptive LED headlights, 18-inch wheels, fog lights, roof rails, a panoramic sunroof, leatherette upholstery, heated front seats, split-folding rear seats, a Fender sound system, and more as detailed below.",
            "Modifications reported by the seller include an APR Plus engine tune, an APR DSG transmission tune, an APR intake system, an APR turbo inlet pipe, Bilstein B8 shocks, H&R sport springs, and more as listed below.",
            "Wagons risk going extinct in America, but Volkswagen tried bucking that trend with the Golf Alltrack, released for the 2017 model year. It was a taller, more rugged-looking evolution of the Golf SportWagen and the Alltrack also gained all-wheel-drive. Offering 30.4 cubic feet of trunk space with both rows of seats left up and 66.5 cubic feet with the rear seats folded flat, the Alltrack rivaled the capacity offered by some crossovers. Production ended in 2019.",
            "Power comes from a turbocharged 1.8-liter inline-4, rated at 170 horsepower and 184 lb-ft of torque in stock form. Due to the modifications performed to this Alltrack, it may produce more power, but a dyno sheet was not provided to confirm. Output is sent to all four wheels through a 6-speed dual-clutch automatic transmission and Volkswagen's 4Motion all-wheel-drive system."
        ],
        "auction_equipment": [
            "Driver Assistance Package (adaptive cruise control, forward collision warning and autonomous emergency braking, lane assist, park distance control, park steering assistant)",
            "18-inch wheels",
            "Adaptive LED headlights with automatic high-beam control",
            "Fog lights",
            "Roof rails",
            "Panoramic sunroof",
            "Leatherette upholstery",
            "Heated, power-adjustable front seats",
            "Split-folding rear seats",
            "Leather-trimmed multifunction steering wheel",
            "Fender sound system",
            "8-inch touchscreen display",
            "Navigation system",
            "Dual-zone automatic climate control",
            "Rear-view camera",
            "Monster Mats floor mats (full set with cargo and rear seat back liners)"
        ],
        "modifications": [
            "APR Plus engine tune (87 octane)",
            "APR DSG transmission tune",
            "APR open carbon fiber intake system (factory intake included with the sale)",
            "APR carbon fiber turbo inlet pipe (factory turbo inlet pipe included with the sale)",
            "APR A01 18-inch wheels (factory wheels included with the sale)",
            "Bilstein B8 shocks (factory shocks included with the sale)",
            "H&R sport springs (factory springs included with the sale)",
            "APR rear sway bar",
            "APR 12mm rear wheel spacers with extended bolts",
            "R-style rear hatch side spoilers",
            "Tinted windows",
            "Badgeskins vinyl overlays on front quarter windows and center dash trim",
            "Canvasback liners over the side storage compartments in the cargo area"
        ],
        "known_flaws": [
            "Ding on the front bumper (pictured in the photo gallery)",
            "Ding and some touched-up scratches on the passenger-side rear door",
            "Ding on the rear hatch and roof spoiler",
            "High spot on the roof's ceramic coating",
            "Curb rash on the driver-side rear wheel (pictured in the photo gallery)",
            "Some creases on the driver seat's bolster"
        ],
        "services": [
            "January 2023 (37,383 miles): 40,000-mile service completed (engine oil and filter changed, transmission fluid changed, Haldex oil changed, spark plugs replaced)",
            "August 2022 (34,242 miles): Engine oil and filter changed",
            "May 2022 (30,444 miles): APR rear sway bar installed",
            "April 2022 (30,175 miles): tires transferred to APR wheels, APR wheels installed, four-wheel alignment performed, rear wheel spacers installed",
            "April 2022 (30,087 miles): APR Plus engine tune installed, APR DSG transmission tune installed, APR intake components installed, Bilstein and H&R suspension components installed",
            "February 2022 (29,421 miles): Tires replaced, engine oil and filter changed, air filter replaced, four-wheel alignment performed, wipers replaced",
            "January 2022 (29,130 miles): Engine oil and filter changed, 30,000-mile service completed",
            "October 2021 (28,041 miles): Battery replaced",
            "November 2020 (24,242 miles): Engine oil and filter changed",
            "September 2019 (11,590 miles): Tires balanced",
            "May 2019 (5,698 miles): Engine oil and filter changed",
            "May 2019 (5,340 miles): Four-wheel alignment performed"
        ],
        "included_items": [
            "2 keys",
            "Owner's manuals",
            "Window sticker copy",
            "Roof crossbars with keys",
            "Factory wheels",
            "Factory air intake box to turbo inlet",
            "Factory suspension components"
        ],
        "ownership_history": "The seller purchased this Alltrack as a CPO Volkswagen in February 2022 and has added approximately 9,100 miles since. The CPO documentation from this purchase is included in the gallery.",
        "auction_stats": {
            "reserve_status": "Reserve",
            "auction_status": "Sold to",
            "highest_bid_value": "$29,750",
            "auction_date": "Apr 6, 2023 10:12 PM",
            "view_count": "14,641",
            "bid_count": "48",
            "bids": [
                "$29,750",
                "$29,500",
                "$28,750",
                "$28,500",
                "$28,250",
                "$28,000",
                "$27,750",
                "$27,500",
                "$27,250",
                "$27,000",
                "$26,750",
                "$26,500",
                "$25,750",
                "$25,500",
                "$25,250",
                "$25,000",
                "$24,500",
                "$24,000",
                "$23,750",
                "$23,500",
                "$23,250",
                "$23,000",
                "$22,500",
                "$22,250",
                "$22,000",
                "$20,750",
                "$20,250",
                "$20,000",
                "$19,750",
                "$19,250",
                "$19,000",
                "$18,500",
                "$18,250",
                "$18,000",
                "$17,000",
                "$16,500",
                "$16,000",
                "$15,000",
                "$14,100",
                "$14,000",
                "$10,000",
                "$6,100",
                "$6,000",
                "$5,800",
                "$5,600",
                "$5,500",
                "$5,100",
                "$5,000"
            ]
        }
    },
    "https://carsandbids.com/auctions/9AznBZd5/2016-porsche-macan-s": {
        "auction_title": "2016 Porsche Macan S",
        "auction_subtitle": "340-hp Twin-Turbo V6, AWD, Premium Package Plus, California-Owned",
        "auction_quick_facts": {
            "Make": "Porsche",
            "Model": "Macan\nSave",
            "Mileage": "65,500",
            "VIN": "WP1AB2A53GLB52964",
            "Title Status": "Clean (CA)",
            "Location": "Walnut, CA 91789",
            "Seller": "DanChen",
            "Engine": "3.0L Turbocharged V6",
            "Drivetrain": "4WD/AWD",
            "Transmission": "Automatic (7-Speed)",
            "Body Style": "SUV/Crossover",
            "Exterior Color": "Black",
            "Interior Color": "Black",
            "Seller Type": "Private Party"
        },
        "dougs_take": "The Porsche Macan S is a desirable SUV with surprisingly sporty handling, excellent performance, and a potent twin-turbocharged V6 with 340 horsepower. This particular Macan S has a lot going for it, boasting a long list of desirable factory equipment that includes the Premium Package Plus, along with the Infotainment, Comfort Lighting, and Sport Chrono packages. This Macan S is also mostly unmodified, with aFe Power air filters, painted brake calipers, and tinted windows being the only changes from stock – and it's been owned in dry-climate California from new, further adding to the appeal.",
        "auction_highlights": [
            "The attached Carfax history report shows no mileage discrepancies in this Macan's past. It also confirms that it has been registered in California from new.",
            "According to the build sheet provided in the gallery, factory equipment includes the Premium Package Plus, Infotainment, Comfort Lighting, Sport Chrono, SportDesign, and Carbon Fiber Interior packages, 21-inch Sport Classic wheels, Porsche Active Suspension Management (PASM), leather upholstery, power-adjustable heated and ventilated front sport seats, heated multifunction sport steering wheel in carbon fiber, heated rear seats, a Bose surround sound system, and more as listed below.",
            "Modifications reported by the seller are limited to yellow-painted brake calipers painted yellow, aFe Power air filters, and tinted windows.",
            "Encouraged by the Cayenne's success, and eager to tap into one of the biggest segments of the market, Porsche introduced the Macan as its entry-level SUV for 2015. Some of the model's underpinnings came from Audi, but Porsche dialed in a level of performance and handling that's unusual to find in a compact SUV. Production continues today.",
            "Power comes from a twin-turbocharged 3.0-liter V6, rated at 340 horsepower and 339 lb-ft of torque. Output is sent to all four wheels via a 7-speed \"PDK\" dual-clutch automatic transmission."
        ],
        "auction_equipment": [
            "Premium Package Plus (dynamic headlights, power panoramic sunroof, heated and ventilated front seats, front and rear ParkAssist with reversing camera, Entry and Drive remote keyless entry system)",
            "Infotainment Package (Porsche Communication Management (PCM) infotainment system, navigation system, online services, SiriusXM satellite radio)",
            "Comfort Lighting Package",
            "Sport Chrono Package",
            "SportDesign Package in black with side skirts",
            "Carbon Fiber Interior Package",
            "21-inch Sport Classic wheels in black",
            "High gloss black window trim",
            "Fuel cap with aluminum-look finish",
            "Tinted LED taillights",
            "Black sport tailpipes",
            "Air suspension with Porsche Active Suspension Management (PASM)",
            "Leather upholstery",
            "Adaptive sport seats",
            "Heated rear seats",
            "Heated multifunction sport steering wheel in carbon fiber",
            "Bose surround sound system",
            "Illuminated carbon fiber door-sill guards",
            "Cruise control"
        ],
        "modifications": [
            "aFe Power air filters",
            "Yellow-painted brake calipers",
            "Tinted windows"
        ],
        "known_flaws": [
            "The attached Carfax report indicates that \"minor damage\" occurred to the front of the vehicle in March 2021.",
            "Some rock chips on the hood and front bumper",
            "Scratches on wheels",
            "Creases on the driver seat's outer bolster",
            "The seller states the check passenger-side taillight warning is illuminated though the light is functional. Please contact the seller directly with any questions."
        ],
        "services": [
            "March 2022 (59,826 miles): Maintenance inspection completed, tire condition and pressure checked, wiper(s) replaced",
            "December 2021 (59,235 miles): Maintenance inspection completed, 10,000-mile service performed, oil and filter changed, tire condition and pressure checked",
            "February 2023: Two front tires installed, four-wheel alignment performed, brake fluid flushed",
            "January 2023: Engine oil and filter changed, maintenance inspection completed"
        ],
        "included_items": [
            "2 keys",
            "Owner's manual",
            "Wheel locks"
        ],
        "ownership_history": "The seller purchased this Macan S in January 2023 and added approximately 1,500 miles since.",
        "auction_stats": {
            "reserve_status": "Reserve",
            "auction_status": "Sold to",
            "highest_bid_value": "$29,250",
            "auction_date": "Apr 6, 2023 9:58 PM",
            "view_count": "7,090",
            "bid_count": "16",
            "bids": [
                "$29,250",
                "$29,000",
                "$28,500",
                "$25,001",
                "$24,511",
                "$24,000",
                "$23,313",
                "$23,000",
                "$22,319",
                "$22,022",
                "$21,439",
                "$20,500",
                "$20,250",
                "$20,000",
                "$19,000",
                "$18,743"
            ]
        }
    },
    "https://carsandbids.com/auctions/KP74GNja/2000-bmw-z3-28i-roadster": {
        "auction_title": "2000 BMW Z3 2.8i Roadster",
        "auction_subtitle": "NO RESERVE ~57,300 Miles, 5-Speed Manual, 2.8-Liter 6-Cylinder, Some Modifications",
        "auction_quick_facts": {
            "Make": "BMW",
            "Model": "Z3\nSave",
            "Mileage": "57,300",
            "VIN": "WBACH3346YLF44003",
            "Title Status": "Clean (WA)",
            "Location": "Chelan, WA 98816",
            "Seller": "pickles22",
            "Engine": "2.8L I6",
            "Drivetrain": "Rear-wheel drive",
            "Transmission": "Manual (5-Speed)",
            "Body Style": "Convertible",
            "Exterior Color": "Titanium Silver Metallic",
            "Interior Color": "Black",
            "Seller Type": "Private Party"
        },
        "dougs_take": "The BMW Z3 is a really fun car, boasting compact sizing and a two-seat, rear-wheel drive roadster layout. It's especially enjoyable when equipped like this example – with a 5-speed manual transmission, a limited-slip differential, and the larger 2.8-liter 6-cylinder engine. Other benefits include a set of desirable 17-inch Style 42 wheels, a chrome trunk luggage rack, and relatively low mileage – AND it's offered with no reserve, so someone is taking home this roadster at the end of the auction!",
        "auction_highlights": [
            "This Z3 features the desirable 5-speed manual transmission.",
            "The odometer on this Z3 currently displays approximately 57,300 miles.",
            "According to the build sheet provided in the gallery, factory equipment includes 17-inch Style 42 wheels, a limited-slip differential, a power-operated soft top, leather upholstery, heated sport seats, wood interior trim, and a Harman/Kardon sound system.",
            "Modifications reported by the seller include a front lip spoiler, yellow fog lights, LED headlights, exterior stickers, rear magnetic stone guards, LED license plate lights, carbon fiber-look license plate moldings, and a chrome trunk luggage rack.",
            "Released for 1996, the Z3 was welcomed as a rear-wheel-drive roadster with two seats and a relatively affordable price tag; it was a true driver's car. The 2.8-liter Z3's all-aluminum engine sits back in the engine compartment, putting the Z3 at the optimum 50/50 weight distribution balance. BMW kept development costs in check by sourcing some components from the E30 and E36 3 Series, and by building the Z3 in South Carolina.",
            "Power comes from a 2.8-liter inline-6 engine, rated at 190 horsepower and 206 lb-ft of torque. Output is sent to the rear wheels via a 5-speed manual transmission."
        ],
        "auction_equipment": [
            "17-inch Style 42 wheels",
            "Limited-slip differential",
            "Power-operated soft top",
            "Leather upholstery",
            "Heated sports seats",
            "Leather-wrapped M steering wheel",
            "Wood interior trim",
            "Air conditioning",
            "Harman/Kardon sound system",
            "CD player"
        ],
        "modifications": [
            "Front lip spoiler",
            "LED headlights",
            "Yellow fog lights",
            "Exterior stickers",
            "Rear magnetic stone guards",
            "LED license plate lights",
            "Carbon fiber-look rear license plate moldings",
            "Chrome trunk luggage rack"
        ],
        "known_flaws": [
            "The attached Carfax history report indicates that this Z3 was involved in an accident with another motor vehicle in May 2004, though no additional details are available.",
            "Paint chips and scratches around the exterior",
            "Dent in driver's side rocker panel",
            "Glue residue around the plastic rear window",
            "Scratches on wheels",
            "Creases and wear on seats; passenger's side seatbelt guide is broken",
            "Wear on interior touch points",
            "Trim missing from passenger's door",
            "Dead pixels in radio LCD display",
            "Subwoofer is blown",
            "The seller notes that the O2 sensor causes the check engine light to intermittently illuminate."
        ],
        "services": [],
        "included_items": [
            "2 keys, 1 remote",
            "Owner's manuals"
        ],
        "ownership_history": "The seller purchased this Z3 in August 2022 and has added approximately 200 miles since.",
        "auction_stats": {
            "reserve_status": "No reserve",
            "auction_status": "Sold to",
            "highest_bid_value": "$9,500",
            "auction_date": "Apr 6, 2023 9:55 PM",
            "view_count": "6,210",
            "bid_count": "35",
            "bids": [
                "$9,500",
                "$9,400",
                "$9,300",
                "$9,100",
                "$9,000",
                "$8,900",
                "$8,500",
                "$8,300",
                "$8,118",
                "$8,000",
                "$7,878",
                "$7,777",
                "$7,600",
                "$7,500",
                "$7,350",
                "$7,200",
                "$7,100",
                "$7,000",
                "$6,900",
                "$6,789",
                "$6,600",
                "$6,500",
                "$6,200",
                "$6,100",
                "$6,000",
                "$5,500",
                "$5,000",
                "$4,000",
                "$3,300",
                "$3,200",
                "$3,000",
                "$700",
                "$600",
                "$500",
                "$100"
            ]
        }
    },
    "https://carsandbids.com/auctions/3zYmgloj/2019-subaru-wrx-sti-s209": {
        "auction_title": "2019 Subaru WRX STI S209",
        "auction_subtitle": "~5,900 Miles, 6-Speed Manual, 1 of 209 S209 Models",
        "auction_quick_facts": {
            "Make": "Subaru",
            "Model": "WRX STI\nSave",
            "Mileage": "5,900",
            "VIN": "JF1VA2Z68K9828629",
            "Title Status": "Clean (PA)",
            "Location": "Poolesville, MD 20837",
            "Seller": "performanceautogallery",
            "Engine": "2.5L Turbocharged Flat-4",
            "Drivetrain": "4WD/AWD",
            "Transmission": "Manual (6-Speed)",
            "Body Style": "Sedan",
            "Exterior Color": "Crystal White Pearl",
            "Interior Color": "Black",
            "Seller Type": "Dealer"
        },
        "dougs_take": "The Subaru WRX STI S209 is a limited-edition, racing-inspired sports sedan that holds the title of the most powerful STI model ever produced. It's as cool as it is rare – just 209 examples were produced, all exclusively for the U.S. market. This particular S209 is finished in Crystal White Pearl, and it comes equipped with performance-oriented goodies like 19-inch BBS wheels, an adjustable carbon fiber rear wing, and an intercooler water spray system. It also boasts low mileage, no major modifications, and a clean, accident-free Carfax report, for added peace of mind. This is a rare opportunity to own a truly special Subaru, and I'm proud to offer it on Cars & Bids.",
        "auction_highlights": [
            "This WRX STI S209 is #141 of 209 produced for the U.S. market in 2019.",
            "The attached Carfax history report shows no accidents or mileage discrepancies in this STI’s past.",
            "According to the window sticker provided in the gallery, factory equipment includes 19-inch BBS forged aluminum-alloy wheels, front and rear limited-slip differentials, a Brembo braking system, an STI-tuned suspension system with Bilstein dampers, an intercooler water spray system, a carbon fiber roof panel, Recaro front seats, and Apple CarPlay and Android Auto connectivity. The only modification reported by the selling dealer is paint protection film applied to forward-facing surfaces.",
            "Subaru's WRX STI began in 1992 as the top performance level for the Impreza lineup. Over the years the WRX has built a reputation for itself as an all-weather performance machine due to its symmetrical all-wheel-drive system. In 2015, the WRX was split off from the base Impreza and rebooted as a standalone model. With this change came a number of styling changes and chassis tweaks to further accentuate the WRX and STI's sportiness. Production ended in 2021.",
            "The S209 was developed by Subaru Tecnica International (STI) with high-performance driving as its primary focus. It drew inspiration from the WRX STI race car that won its class in the 2019 24 Hours of Nürburgring, as evidenced by features such as a wide-body kit, an upgraded turbocharger, a carbon fiber roof panel, and a massive rear wing. The S209 comes from a lineage of legendary STI S-line models and represents the first time that an S-line was offered in the U.S.",
            "Power comes from an \"EJ25\" 2.5-liter turbocharged flat-4, rated at 341 horsepower and 330 lb-ft of torque. Output is sent to all four wheels via a 6-speed manual transmission and Subaru's Symmetrical All-Wheel Drive system."
        ],
        "auction_equipment": [
            "19-inch BBS forged aluminum-alloy wheels",
            "Front and rear limited-slip differentials",
            "Driver-Controlled Center Differential (DCCD)",
            "Brembo braking system",
            "STI-tuned suspension system with Bilstein dampers",
            "Intercooler water spray system",
            "LED steering-responsive headlights",
            "Carbon fiber roof panel",
            "Carbon fiber adjustable rear pedestal wing",
            "Ultrasuede and leather upholstery",
            "Heated and power-adjustable Recaro front seats",
            "Dual-zone automatic climate control",
            "7-inch STARLINK multimedia system with Apple CarPlay and Android Auto connectivity",
            "Rear-view camera",
            "Push-button ignition"
        ],
        "modifications": [
            "Paint protection film applied to forward-facing surfaces",
            "JDM center console armrest extension"
        ],
        "known_flaws": [
            "Chips in the paint protection film"
        ],
        "services": [
            "July 2022 (5,332 miles): Engine oil and filter changed",
            "June 2021 (3,122 miles): Engine oil and filter changed"
        ],
        "included_items": [
            "2 key keys"
        ],
        "ownership_history": "The selling dealer acquired this STI earlier in 2023.",
        "auction_stats": {
            "reserve_status": "Reserve",
            "auction_status": "Reserve not met, bid to",
            "highest_bid_value": "$73,000",
            "auction_date": "Apr 6, 2023 9:42 PM",
            "view_count": "10,587",
            "bid_count": "13",
            "bids": [
                "$73,000",
                "$70,000",
                "$65,500",
                "$65,000",
                "$57,000",
                "$55,555",
                "$55,000",
                "$50,000",
                "$40,250",
                "$40,000",
                "$30,000",
                "$25,000",
                "$500"
            ]
        }
    },
    "https://carsandbids.com/auctions/9nLx21wB/2016-mercedes-benz-gle450-amg-coupe": {
        "auction_title": "2016 Mercedes-Benz GLE450 AMG Coupe",
        "auction_subtitle": "Twin-Turbo V6, AWD, Highly-Equipped, Unmodified",
        "auction_quick_facts": {
            "Make": "Mercedes-Benz",
            "Model": "GLE450\nSave",
            "Mileage": "87,000",
            "VIN": "4JGED6EB3GA023263",
            "Title Status": "Clean (PA)",
            "Location": "King Of Prussia, PA 19406",
            "Seller": "MotorcarsOfTheMainLine",
            "Engine": "3.0L Turbocharged V6",
            "Drivetrain": "4WD/AWD",
            "Transmission": "Automatic (9-Speed)",
            "Body Style": "SUV/Crossover",
            "Exterior Color": "Diamond White Metallic",
            "Interior Color": "Gray",
            "Seller Type": "Dealer"
        },
        "dougs_take": "Here's an interesting one: later renamed the Mercedes-AMG GLE43, the GLE450 AMG existed for just one model year, 2016, with this naming convention. A relatively early version of the \"coupe SUV\" that's only become more popular in years since, these GLE450 models boast twin-turbocharged V6 performance, eye-catching styling, and a luxurious interior. This particular GLE is finished in the handsome Diamond White Metallic – and it comes fitted with some great factory equipment, including the Premium, Convenience, and AMG Styling packages. It's also unmodified, and it touts a clean, accident-free Carfax report, further adding to the appeal.",
        "auction_highlights": [
            "The attached Carfax history report indicates no accidents or mileage discrepancies in this GLE's past. It also confirms that this is a 2-owner car.",
            "Equipment includes the Premium, Convenience, and AMG Styling packages, 21-inch AMG wheels, Airmatic air suspension, leather upholstery, power-adjustable heated and ventilated front seats, heated steering wheel, a navigation system, and more as detailed below. The selling dealer reports no modifications.",
            "Mercedes-Benz turned the third-generation ML (W166) into the original GLE for the 2016 model year. The GLE Coupe (C292) joined the range for 2017 with a sportier-looking exterior design characterized by a fastback-like roof line; it was aimed directly at the BMW X6. The GLE450 AMG filled the gap separating the standard GLE and the range-topping, V8-powered GLE63.",
            "Power comes from a twin-turbo 3.0-liter V6 engine, which produces 362 horsepower and 384 lb-ft of torque. Output is sent to all four wheels through a 9-speed automatic transmission."
        ],
        "auction_equipment": [
            "Premium Package (panoramic sunroof, Harman/Kardon Logic7 sound system, Blind Spot Assist, Lane Keeping Assist, 115-volt power outlet, rear center armrest pass-through, Keyless Go)",
            "Convenience Package (soft-close doors, heated and cooled front cupholders)",
            "AMG Styling Package (front spoiler, side skirts)",
            "21-inch AMG wheels",
            "Airmatic air suspension with adaptive dampers",
            "Leather upholstery",
            "Poplar wood trim",
            "Power-adjustable heated and ventilated front seats",
            "Heated steering wheel",
            "Dual-zone automatic climate control",
            "Navigation system",
            "Cruise control"
        ],
        "modifications": [],
        "known_flaws": [
            "Some stone chips on front end",
            "Some discoloration on driver's seat upholstery"
        ],
        "services": [
            "March 2023 (86,960 miles): Vehicle serviced, exhaust repaired, engine oil and filter changed, fluids checked, safety inspection performed, oil pan drain plug replaced, emissions inspection performed",
            "January 2023 (86,219 miles): Maintenance inspection completed",
            "September 2022 (83,922 miles): Emissions inspection performed",
            "August 2021: Maintenance inspection completed, four tires replaced, air filter replaced, window repaired, spark plug(s) replaced, brake fluid flushed/changed, electrical system checked, emissions inspection performed",
            "August 2020 (62,956 miles): Vehicle serviced, safety inspection performed, air filter replaced, fluids checked, engine oil and filter changed, body lubricated, emissions inspection performed",
            "August 2019 (53,451 miles): Vehicle serviced, safety inspection performed, air filter checked, fluids checked, engine oil and filter changed, body lubricated, emissions inspection performed"
        ],
        "included_items": [
            "2 key fobs",
            "Owner's manuals",
            "Carpeted floor mats, all-weather floor mats",
            "Spare tire",
            "Tool kit"
        ],
        "ownership_history": "The selling dealer states that they acquired this GLE450 in December 2022.",
        "auction_stats": {
            "reserve_status": "Reserve",
            "auction_status": "Reserve not met, bid to",
            "highest_bid_value": "$33,500",
            "auction_date": "Apr 6, 2023 9:35 PM",
            "view_count": "5,435",
            "bid_count": "51",
            "bids": [
                "$33,500",
                "$31,250",
                "$31,000",
                "$28,500",
                "$28,150",
                "$27,900",
                "$27,650",
                "$27,400",
                "$27,150",
                "$26,850",
                "$26,600",
                "$26,350",
                "$26,100",
                "$25,850",
                "$25,600",
                "$25,350",
                "$25,100",
                "$24,850",
                "$24,600",
                "$24,250",
                "$24,000",
                "$23,750",
                "$23,500",
                "$23,250",
                "$23,000",
                "$22,750",
                "$22,500",
                "$22,250",
                "$22,000",
                "$21,750",
                "$21,500",
                "$20,750",
                "$20,500",
                "$20,250",
                "$20,000",
                "$19,000",
                "$18,027",
                "$17,777",
                "$17,250",
                "$17,000",
                "$16,250",
                "$16,000",
                "$11,000",
                "$7,777",
                "$5,100",
                "$5,000",
                "$4,100",
                "$4,000",
                "$2,500",
                "$2,222",
                "$100"
            ]
        }
    },
    "https://carsandbids.com/auctions/9Xb8mGbp/1983-mercedes-benz-380sl": {
        "auction_title": "1983 Mercedes-Benz 380SL",
        "auction_subtitle": "NO RESERVE V8 Power, Factory Hardtop, Western-Owned",
        "auction_quick_facts": {
            "Make": "Mercedes-Benz",
            "Model": "380SL\nSave",
            "Mileage": "165,400",
            "VIN": "WDBBA45AXDB024488",
            "Title Status": "Clean (WA)",
            "Location": "Edmonds, WA 98026",
            "Seller": "WebbHopkins",
            "Engine": "3.8L V8",
            "Drivetrain": "Rear-wheel drive",
            "Transmission": "Automatic (4-Speed)",
            "Body Style": "Convertible",
            "Exterior Color": "Anthracite",
            "Interior Color": "Parchment",
            "Seller Type": "Private Party"
        },
        "dougs_take": "The R107 Mercedes-Benz SL is a charming, old-school roadster – and these have become prized by enthusiasts for their classic looks and smooth, relaxed driving experience. This V8-powered 380SL model touts a factory hardtop, along with Washington State ownership history since at least 1994. It's also finished in an attractive Anthracite over Parchment color combination, and it benefits from having no major modifications. Plus, this 380SL is offered with the allure no reserve, further enhancing its appeal.",
        "auction_highlights": [
            "The attached Carfax history report begins in 1988 and has multiple gaps, yet lists no mileage discrepancies for the given time period.",
            "Factory equipment includes 14-inch wheels, fog lights, a color-matched hardtop, a manually folding soft top, wood interior trim, and air conditioning, among others listed below.",
            "Modifications reported by the seller include an aftermarket catalytic converter, an aftermarket muffler, and a Sony head unit.",
            "Mercedes-Benz introduced the R107-generation SL for the 1972 model year, and the roadster remained part of its range through 1991. It received several visual and mechanical updates during its unusually long production run, though its overall design remained nearly untouched. Launched for 1981, the 380 model replaced the 450, and it stayed in the line-up until the 560 arrived for 1986.",
            "Power comes from a 3.8-liter V8, rated at 155 horsepower and 196 lb-ft of torque. Called M116 internally, it spins the rear wheels via a 4-speed automatic transmission."
        ],
        "auction_equipment": [
            "14-inch wheels",
            "Fog lights",
            "Color-matched hardtop",
            "Manually folding soft top",
            "Wood interior trim",
            "Power-operated windows and mirrors",
            "Air conditioning"
        ],
        "modifications": [
            "Aftermarket catalytic converter",
            "Aftermarket muffler",
            "Chrome fender trim",
            "Sony head unit"
        ],
        "known_flaws": [
            "The attached Carfax history report indicates that this 380SL sustained \"severe damage\" to the rear in June 1998. The seller states the right front fender and associated trim was replaced in 1994.",
            "Scrape on front bumper",
            "Scratches on hood, behind soft top area, and passenger's side door",
            "Rust on driver's side fender",
            "Paint chips touched-up on driver's side quarter panel and trunk lid",
            "Some rust on driver's side taillight surround",
            "Corrosion on wheels",
            "Worn spot on driver's seat",
            "Cracks in dashboard",
            "Cracks and wear on interior wood trim",
            "Passenger's side front wheel bearing is loose",
            "Shocks are recommended to be replaced",
            "Front brakes are recommended to be replaced",
            "Left valve cover leaks oil"
        ],
        "services": [
            "November 2022 (165,311 miles): Alternator and antenna motor replaced, maintenance inspection completed",
            "September 2022 (165,310 miles): Engine oil and filter changed",
            "June 2021 (165,204 miles): Engine oil and filter changed, battery replaced"
        ],
        "included_items": [
            "3 keys",
            "Owner's manual",
            "Service records",
            "Roof tools",
            "Roof storage rack",
            "Cloth sun cover"
        ],
        "ownership_history": "The seller purchased this 380SL in August 2006 and has added approximately 18,200 miles since.",
        "auction_stats": {
            "reserve_status": "No reserve",
            "auction_status": "Sold to",
            "highest_bid_value": "$8,500",
            "auction_date": "Apr 6, 2023 9:34 PM",
            "view_count": "6,955",
            "bid_count": "15",
            "bids": [
                "$8,500",
                "$7,300",
                "$7,200",
                "$7,100",
                "$7,000",
                "$6,100",
                "$6,000",
                "$5,468",
                "$5,368",
                "$5,100",
                "$5,000",
                "$2,200",
                "$2,000",
                "$1,000",
                "$500"
            ]
        }
    },
    "https://carsandbids.com/auctions/9ad0kDJl/2019-mazda-mx-5-miata-30th-anniversary-edition": {
        "auction_title": "2019 Mazda MX-5 Miata 30th Anniversary Edition",
        "auction_subtitle": "NO RESERVE 6-Speed Manual, 1 Owner, Some Modifications",
        "auction_quick_facts": {
            "Make": "Mazda",
            "Model": "MX-5 Miata\nSave",
            "Mileage": "52,300",
            "VIN": "JM1NDAA76K0400708",
            "Title Status": "Clean (TN)",
            "Location": "Knoxville, TN 37931",
            "Seller": "Ian30AE",
            "Engine": "2.0L I4",
            "Drivetrain": "Rear-wheel drive",
            "Transmission": "Manual (6-Speed)",
            "Body Style": "Convertible",
            "Exterior Color": "Racing Orange",
            "Interior Color": "Black",
            "Seller Type": "Private Party"
        },
        "dougs_take": "I love the ND Mazda Miata MX-5 as it touts great styling, modern amenities, and the tossable nature the Miata is known for. This ND is a 30th Anniversary Edition, which means it's finished in eye-catching Racing Orange — and production was limited to 3,000 units. This one also features some desirable factory equipment, namely Brembo front brakes, a limited-slip differential, and Recaro seats – at has some modifications (like OEM appearance upgrades and an aftermarket muffler) to enhance the driving experience and look even more. This ND also benefits from a 6-speed manual transmission and care by one owner in the warm-weather South — plus, the seller is offering this one with no reserve, expanding its appeal even more.",
        "auction_highlights": [
            "This MX-5 is fitted with the desirable 6-speed manual transmission.",
            "The attached Carfax history report shows that this Miata is a one-owner car that has been kept in warm-weather Florida and Tennessee since new.",
            "According to the window sticker provided in the gallery, a partial list of factory equipment includes 17-inch Rays forged wheels, Brembo front brakes, a folding soft top, leather and Alcantara upholstery, Recaro heated seats, Apple CarPlay and Android Auto functionality, and a rear-view camera.",
            "The full list of modifications reported by the seller is detailed below, and highlights include the OEM Appearance Package, a RoadsterSport Race muffler, Zymexx Yokohama steering wheel with orange contrast stitching, Carbon Miata Spyder Grille, and a Miata Speed billet aluminum micro-antenna.",
            "The ND Miata made its debut for the 2016 model year, and the facelifted ND2 model arrived for the 2019 model year. It received a host of revisions, including updates to the engine (including more power and a higher redline), a telescoping steering column, revised seat controls, and a new cupholder, among other improvements; it's still sold new today.",
            "The 30th Anniversary Edition differentiates itself from other trim levels with distinct Racing Orange paint, Rays forged wheels, orange-painted brake calipers, and orange accents throughout the interior, as well as a few other unique features. 3,000 units were built, and this car is number 2,673.",
            "Power comes from a 2.0-liter 4-cylinder engine, rated at 181 horsepower and 151 lb-ft of torque. Output is sent to the rear wheels via a 6-speed manual transmission."
        ],
        "auction_equipment": [
            "17-inch Rays forged wheels",
            "Brembo front brakes with orange-painted front and rear calipers",
            "Limited-slip differential",
            "Folding soft top",
            "Leather and Alcantara upholstery",
            "Recaro heated seats",
            "Carpet and all-weather rubber floor mats",
            "Heated side mirrors",
            "Automatic climate control system",
            "7-inch touchscreen infotainment system with Apple CarPlay and Android Auto functionality",
            "Bose 9-speaker sound system",
            "Cruise control",
            "Rear-view camera"
        ],
        "modifications": [
            "OEM MX-5 Appearance Package (front splitter, side skirts, rear diffuser, trunk lid spoiler)",
            "RoadsterSport Race muffler",
            "Zymexx Yokohama steering wheel with orange contrast stitching",
            "Carbon Miata Spyder Grille, MX5Things rear LED lightbar",
            "DRL harness and airbag warning overlay",
            "Flyin' Miata LED sequential rear and smoked side turn signals",
            "LED smoked side markers and LED license plate lights",
            "LASFIT LED front turn signals, reverse, interior dome, and trunk lights",
            "Miata Speed billet aluminum micro-antenna",
            "K&N washable/reusable cabin air filter"
        ],
        "known_flaws": [
            "Although no accidents are indicated on the attached Carfax vehicle history report, the seller notes that this MX-5 hit a tire wall on a track in December 2022, resulting in cosmetic damage; no airbags were deployed in the incident. Please contact the seller directly with any questions. (damage pictured in the gallery)",
            "Washer fluid low warning appears when car is started, even if the reservoir is full",
            "Some chips on hood",
            "Some scratches on exterior body panels",
            "Some fraying and wear on soft top",
            "Chip on windshield (pictured in gallery)"
        ],
        "services": [
            "December 2022 (~51,800 miles): Driver side wheels resurfaced, new rear bumper painted and installed, paint and dent repair performed",
            "November 2022 (49,599 miles): Oil and filters changed",
            "September 2022 (47,285): New Michelin Pilot Super Sport tires installed",
            "June 2022 (44,418 miles): Oil and filters changed, thrust angle alignment performed",
            "April 2022 (40,058 miles): Maintenance inspection performed, tires replaced",
            "March 2022 (39,263 miles): Alignment checked, tires checked, oil and filters changed",
            "September 2021 (31,410 miles): Maintenance inspection performed, tires balanced and rotated",
            "August 2022 (28,665 miles): One tire mounted and balanced",
            "July 2021: Glass repaired by Safelite",
            "January 2021 (23,110 miles): Battery and charging system checked, brakes checked, tires balanced and mounted, alignment performed",
            "July 2020 (13,610 miles): Battery and charging system checked, brakes checked, tire condition and pressure checked",
            "December 2019 (919 miles): Battery and charging system checked, brakes checked, tire condition and pressure checked",
            "November 2019 (1 mile): Pre-delivery inspection performed"
        ],
        "included_items": [
            "2 key fobs",
            "Framed window sticker",
            "30AE badge in souvenir box",
            "Exclusive artwork sent to original 30AE owners by Mazda North America",
            "Letter sent to original 30AE owners from then-President of Mazda North America, Jeffrey Guyton",
            "Factory carpeted floor mats",
            "Pagid Racing front brake pads"
        ],
        "ownership_history": "The seller acquired this Miata new in November 2019.",
        "auction_stats": {
            "reserve_status": "No reserve",
            "auction_status": "Sold to",
            "highest_bid_value": "$29,500",
            "auction_date": "Apr 6, 2023 9:21 PM",
            "view_count": "10,044",
            "bid_count": "26",
            "bids": [
                "$29,500",
                "$29,250",
                "$29,000",
                "$28,750",
                "$28,500",
                "$28,250",
                "$28,000",
                "$27,750",
                "$27,500",
                "$26,750",
                "$26,500",
                "$26,000",
                "$25,500",
                "$25,000",
                "$24,750",
                "$24,500",
                "$24,000",
                "$23,500",
                "$20,000",
                "$15,420",
                "$15,000",
                "$11,300",
                "$10,550",
                "$10,420",
                "$10,100",
                "$10,000"
            ]
        }
    },
    "https://carsandbids.com/auctions/KZWOxnAr/2018-toyota-tacoma-trd-off-road-double-cab-4x4": {
        "auction_title": "2018 Toyota Tacoma TRD Off-Road Double Cab 4x4",
        "auction_subtitle": "6-Speed Manual, 4WD, 1 Owner, Premium Off-Road and Technology Packages",
        "auction_quick_facts": {
            "Make": "Toyota",
            "Model": "Tacoma\nSave",
            "Mileage": "55,500",
            "VIN": "5TFCZ5AN1JX161329",
            "Title Status": "Clean (VA)",
            "Location": "Fairfax Station, VA 22039",
            "Seller": "jcrocks",
            "Engine": "3.5L V6",
            "Drivetrain": "4WD/AWD",
            "Transmission": "Manual (6-Speed)",
            "Body Style": "Truck",
            "Exterior Color": "Cement",
            "Interior Color": "Black",
            "Seller Type": "Private Party"
        },
        "dougs_take": "The third-generation Toyota Tacoma is a fantastic truck that offers excellent reliability and durability, along with serious off-road performance. This particular Tacoma is especially desirable thanks to fantastic combination of 3.5-liter V6 power, a 6-speed manual transmission, 4-wheel drive, a locking rear differential, and the Premium Off-Road and Technology packages, among other great factory equipment. This Tacoma also comes with an aftermarket bed topper and trailer brake controller for extra practicality, while the included Carfax report shows that this Tacoma is a one-owner truck, further bolstering the appeal.",
        "auction_highlights": [
            "This Tacoma is equipped with a 6-speed manual transmission.",
            "The attached Carfax history report indicates no mileage discrepancies. It also shows this is a one-owner truck.",
            "According to the window sticker pictured in the photo gallery, this Tacoma carried a sticker price of $38,648 and came equipped with the TRD Premium Off Road, Toyota Safety Sense P, and Technology packages, 16-inch alloy wheels, a locking rear differential, A-TRAC traction control system, towing receiver, keyless entry, and more as detailed below. Modifications reported by the seller are limited to a Softopper bed topper and an aftermarket trailer brake controller.",
            "Introduced in 2015, the third-generation Tacoma came equipped with an optional Atkinson cycle V6 engine utilizing Variable Valve Timing with intelligence (VVT-i), which replaced Toyota's previous VVT system. The third-generation \"Taco\" also featured updated styling, a more comfortable interior, and a more rigid high-strength steel frame.",
            "Power comes from a 3.5-liter V6 engine, rated at 278 horsepower and 265 lb-ft of torque. Output is sent to the rear or all four wheels through a 6-speed manual transmission and a 2-speed transfer case."
        ],
        "auction_equipment": [
            "TRD Premium Off Road Package (dual-zone automatic climate control, leather-trimmed and heated front seats, Entune Premium JBL audio system with integrated navigation system and app suite, automatic headlights, power-operated sunroof)",
            "Toyota Safety Sense P (Pre-Collision System with Pedestrian Detection (PCS w/PD), Lane Departure Alert (LDA), Automatic High Beams (AHB), Dynamic Radar Cruise Control (DRCC))",
            "Technology Package (rear parking assist sonar and blind spot monitor and rear cross-traffic alert)",
            "16-inch alloy wheels",
            "Locking rear differential",
            "A-TRAC traction control system",
            "Towing receiver",
            "Engine oil cooler",
            "Power steering cooler",
            "Wireless Qi smartphone charging",
            "Power windows and locks",
            "Keyless entry"
        ],
        "modifications": [
            "Softopper bed topper",
            "Aftermarket trailer brake controller"
        ],
        "known_flaws": [
            "The seller reports that this Tacoma was involved in a low-speed parking lot collision at approximately 20,000 miles that resulted in damage to the front. They add that the hood was damaged at approximately 30,000 miles by a fallen tree branch. Neither incident is reflected in the Carfax history report.",
            "Some stone chips on front end",
            "Some scratches on left side of the body",
            "Dent behind driver's door",
            "Scratches on left quarter panel",
            "The seller reports that the tires should be replaced soon.",
            "Some wear on driver's seat",
            "Tear on left-rear seat leather",
            "Some rust on towing receiver and underbody components"
        ],
        "services": [
            "October 2022 (51,000 miles): Emissions test performed",
            "March 2022 (45,917 miles): 45,000-mile service performed",
            "October 2021: Safety inspection performed",
            "October 2021 (40,724 miles): 40,000-mile service performed, alignment checked, safety inspection performed, engine oil and filter changed",
            "June 2021 (34,798 miles): Vehicle serviced, maintenance inspection completed, 35,000-mile service performed, brakes checked",
            "January 2021 (29,930 miles): Vehicle serviced, 30,000-mile service performed, engine oil and filter changed",
            "September 2020 (26,050 miles): Vehicle serviced, alignment checked, safety inspection performed",
            "August 2020: 25,000-mile service performed, safety inspection performed",
            "February 2020 (20,354 miles): 20,000-mile service performed",
            "September 2019 (15,127 miles): 15,000-mile service performed, safety inspection performed, clutch checked, drivability/performance checked"
        ],
        "included_items": [
            "2 key fobs",
            "Owner's manuals",
            "Window sticker",
            "Service records",
            "Replacement seat cover",
            "Replacement bumper cover",
            "Blue Ridge Overland Gear overhead storage system",
            "All-weather floor mats"
        ],
        "ownership_history": "The seller states that they purchased this Tacoma new in August 2018.",
        "auction_stats": {
            "reserve_status": "Reserve",
            "auction_status": "Sold to",
            "highest_bid_value": "$31,550",
            "auction_date": "Apr 6, 2023 9:14 PM",
            "view_count": "5,566",
            "bid_count": "28",
            "bids": [
                "$31,550",
                "$31,300",
                "$31,050",
                "$30,800",
                "$30,250",
                "$30,000",
                "$29,500",
                "$29,000",
                "$28,750",
                "$28,500",
                "$28,250",
                "$28,000",
                "$27,750",
                "$27,500",
                "$27,250",
                "$27,000",
                "$26,500",
                "$25,932",
                "$25,682",
                "$25,432",
                "$25,000",
                "$20,750",
                "$20,500",
                "$20,250",
                "$20,000",
                "$3,400",
                "$3,100",
                "$3,000"
            ]
        }
    },
    "https://carsandbids.com/auctions/KmkeR2p9/2000-mercedes-benz-sl600": {
        "auction_title": "2000 Mercedes-Benz SL600",
        "auction_subtitle": "V12 Power, Factory Hardtop Included, Mostly California-Owned",
        "auction_quick_facts": {
            "Make": "Mercedes-Benz",
            "Model": "SL600\nSave",
            "Mileage": "87,500",
            "VIN": "WDBFA76F4YF190811",
            "Title Status": "Clean (MD)",
            "Location": "Baltimore, MD 21202",
            "Seller": "Lexuslife",
            "Engine": "6.0L V12",
            "Drivetrain": "Rear-wheel drive",
            "Transmission": "Automatic (5-Speed)",
            "Body Style": "Convertible",
            "Exterior Color": "Black",
            "Interior Color": "Black",
            "Seller Type": "Private Party"
        },
        "dougs_take": "The R129 Mercedes-Benz SL has become a sought-after modern classic, boasting a timeless exterior design and solid build quality that Mercedes-Benz models of this era are renowned for. This particular example is a late model SL600 that touts the potent 6.0-liter V12 engine. It also features some desirable factory equipment, such as the Adaptive Damping System, AMG body styling (with a set of factory AMG wheels), and an original in-car cell phone — and it comes with its factory hardtop. This SL600 also boasts a clean, accident-free Carfax report showing ownership mostly in warm-weather California, adding even more peace of mind.",
        "auction_highlights": [
            "The attached Carfax history report contains several gaps, though it indicates no accidents for the given time period. It also shows that this SL600 was registered in California until 2021.",
            "Factory equipment includes the Adaptive Damping System, a power-retractable soft top, a removable hardtop, leather upholstery, power-adjustable and heated seats, automatic climate control, a Bose sound system, and cruise control. The sole modification reported by the seller is 18-inch factory AMG wheels.",
            "Offered from 1990 to 2002, the R129 SL-Class has developed a reputation as a luxury-focused but well-performing convertible with timeless Mercedes-Benz styling and quality. At a cost of roughly $120,000 in its time, the V12-powered SL600 sat at the top of the range and came standard with cutting-edge features such as an adaptive suspension system.",
            "Power comes from an M120 6.0-liter V12, rated at 389 horsepower and 420 lb-ft of torque. Output is sent to the rear wheels via a 5-speed automatic transmission."
        ],
        "auction_equipment": [
            "Self-leveling suspension with Adaptive Damping System (ADS)",
            "Electronic Stability Program (ESP)",
            "Xenon headlights",
            "Power-retractable soft top",
            "Removable hardtop",
            "Leather upholstery",
            "Wood interior trim",
            "Power-adjustable and heated seats",
            "Automatic climate control",
            "Bose sound system",
            "CD changer",
            "Cruise control"
        ],
        "modifications": [
            "18-inch factory AMG wheels"
        ],
        "known_flaws": [
            "Chips and scratches on front bumper; chips on hood and driver's side headlight",
            "Missing driver's side jacking point cover",
            "Paint imperfections on decklid behind soft top stow area",
            "Curb rash on passenger's side front wheel",
            "Creases on seats",
            "Cracks in center console wood",
            "Missing center console lid button",
            "Missing interior overhead light"
        ],
        "services": [],
        "included_items": [
            "1 key",
            "Owner's manuals",
            "Removable hardtop",
            "Factory cell phone",
            "First aid kit"
        ],
        "ownership_history": "The seller purchased this SL600 in March 2023 and has added approximately 200 miles since.",
        "auction_stats": {
            "reserve_status": "Reserve",
            "auction_status": "Reserve not met, bid to",
            "highest_bid_value": "$12,350",
            "auction_date": "Apr 6, 2023 9:08 PM",
            "view_count": "8,927",
            "bid_count": "37",
            "bids": [
                "$12,350",
                "$12,250",
                "$12,100",
                "$11,900",
                "$11,500",
                "$11,000",
                "$10,777",
                "$10,600",
                "$10,500",
                "$10,333",
                "$10,200",
                "$9,999",
                "$9,800",
                "$9,500",
                "$9,100",
                "$9,000",
                "$8,800",
                "$8,700",
                "$8,600",
                "$8,500",
                "$8,400",
                "$8,300",
                "$8,200",
                "$8,100",
                "$8,000",
                "$7,900",
                "$7,800",
                "$7,700",
                "$7,500",
                "$7,400",
                "$7,300",
                "$7,200",
                "$7,100",
                "$7,000",
                "$6,200",
                "$6,100",
                "$6,000"
            ]
        }
    },
    "https://carsandbids.com/auctions/KV7jNvgk/1998-suzuki-jimny-landventure-4x4": {
        "auction_title": "1998 Suzuki Jimny Landventure 4x4",
        "auction_subtitle": "NO RESERVE 5-Speed Manual, 4WD, Japanese-Market Kei Truck, U.S. Title",
        "auction_quick_facts": {
            "Make": "Suzuki",
            "Model": "Jimny\nSave",
            "Mileage": "73,400",
            "VIN": "JA22W-158073",
            "Title Status": "Clean (AZ)",
            "Location": "Mesa, AZ 85202",
            "Seller": "AzEuros",
            "Engine": "658cc Turbocharged I3",
            "Drivetrain": "4WD/AWD",
            "Transmission": "Manual (5-Speed)",
            "Body Style": "SUV/Crossover",
            "Exterior Color": "Superior White",
            "Interior Color": "Gray",
            "Seller Type": "Dealer"
        },
        "dougs_take": "The Suzuki Jimny is a quirky little kei SUV that boasts 4-wheel drive, a 2-speed transfer case, and body-on-frame construction – making it a surprisingly capable off-roader. This particular Jimny is a Landventure model with a roof rack and cool factory decals around the exterior – and it touts some practical equipment, too, including manually-locking front hubs, folding rear seats, and air conditioning. This Jimny also comes with a U.S. title, meaning the difficult work of importing it has already been completed – and it's offered with the excitement of no reserve!",
        "auction_highlights": [
            "This Jimny is a Japanese-spec, right-hand drive kei truck equipped with a 5-speed manual transmission and is currently titled in Arizona. Reportedly imported from Japan in February 2023, it's equipped with a metric instrument cluster, and the odometer shows about 118,000 kilometers, which represents approximately 73,400 miles.",
            "Factory equipment includes 16-inch wheels, manually-locking front hubs, a functional hood scoop, cloth upholstery, pop-out quarter windows, and air conditioning. Modifications reported by the selling dealer include a tube front bumper, chrome mirror covers, a roof rack cargo basket, a Kenwood head unit, and aftermarket dashboard-mounted speakers.",
            "Introduced in 1970, the Jimny has long maintained a reputation for giving folks that live in dense urban environments the ability to own a capable 4x4 while simultaneously driving a small city car. The 2nd-generation model was released in 1981, and a 1990 update brought a larger engine, an intercooler, and a revised suspension system. The range of models also grew to include a wider selection of variants. Production ended in 1998.",
            "Power comes from a 658cc turbocharged inline-3, rated at approximately 63 horsepower and 66 lb-ft of torque. Output is directed to the rear or all four wheels through a 5-speed manual transmission and a 2-speed transfer case."
        ],
        "auction_equipment": [
            "16-inch wheels",
            "Manually-locking front hubs",
            "Functional hood scoop",
            "Spare tire cover",
            "Cloth upholstery",
            "Folding rear seats",
            "Manual side windows",
            "Pop-out quarter windows",
            "Air conditioning"
        ],
        "modifications": [
            "Tube front bumper",
            "Chrome mirror covers",
            "Roof rack cargo basket",
            "Kenwood head unit",
            "Aftermarket dashboard-mounted speakers"
        ],
        "known_flaws": [
            "Chips, scratches, and blemishes around the exterior",
            "Weathered exterior trim and decals",
            "Corroded headlight and fog light housings",
            "Scuffs and wear on door panels",
            "Center console air vent is missing",
            "Some corrosion on underbody components"
        ],
        "services": [
            "Engine oil and filter changed",
            "Tires, battery, and shift knob replaced",
            "Safety inspection performed"
        ],
        "included_items": [
            "1 key",
            "Import documents"
        ],
        "ownership_history": "The selling dealer acquired this Jimny in October 2022.",
        "auction_stats": {
            "reserve_status": "No reserve",
            "auction_status": "Sold to",
            "highest_bid_value": "$8,177",
            "auction_date": "Apr 6, 2023 8:56 PM",
            "view_count": "7,571",
            "bid_count": "24",
            "bids": [
                "$8,177",
                "$8,069",
                "$7,969",
                "$7,811",
                "$7,700",
                "$7,600",
                "$7,500",
                "$7,400",
                "$7,300",
                "$7,200",
                "$7,100",
                "$6,969",
                "$6,550",
                "$6,200",
                "$5,999",
                "$5,600",
                "$5,500",
                "$5,000",
                "$2,500",
                "$2,200",
                "$2,100",
                "$1,998",
                "$600",
                "$500"
            ]
        }
    },
    "https://carsandbids.com/auctions/98VlyyXd/2010-lotus-evora": {
        "auction_title": "2010 Lotus Evora",
        "auction_subtitle": "NO RESERVE ~31,600 Miles, 6-Speed Manual, V6 Power, Some Modifications",
        "auction_quick_facts": {
            "Make": "Lotus",
            "Model": "Evora\nSave",
            "Mileage": "31,600",
            "VIN": "SCCLMDTU0AHA11690",
            "Title Status": "Clean (AL)",
            "Location": "Birmingham, AL 35210",
            "Seller": "Lanhorn9",
            "Engine": "3.5L V6",
            "Drivetrain": "Rear-wheel drive",
            "Transmission": "Manual (6-Speed)",
            "Body Style": "Coupe",
            "Exterior Color": "Arctic Silver Metallic",
            "Interior Color": "Black",
            "Seller Type": "Private Party"
        },
        "dougs_take": "I love the Lotus Evora, as it boasts handsome styling and a more substantial feel than the tiny Elise – while still retaining the same lightweight construction and excellent handling that Lotus is known for. Of course, like the Elise, it also features a Toyota powertrain for added reliability – although, in the Evora's case, it's a more robust V6 with almost 300 horses. This particular Evora touts a 6-speed manual transmission, and it's equipped with some great equipment like 18-inch front and 19-inch rear wheels, Recaro front seats, and a flat-bottom magnesium steering wheel. It also has a few nice upgrades like a TopSpeed exhaust system and an aftermarket rear diffuser. The Evora is a car that has a lot to offer, and I have no doubt that the next owner will love the driving thrills this one will provide.",
        "auction_highlights": [
            "This Evora is equipped with the desirable 6-speed manual transmission, and the odometer currently displays approximately 31,600 miles",
            "The attached Carfax history report lists no mileage discrepancies in this Evora's past.",
            "Factory equipment includes bi-xenon headlights, a rear spoiler, Recaro front seats, leather upholstery, and keyless entry. Modifications reported by the seller include a TopSpeed exhaust system, an aftermarket rear diffuser, ceramic window tint, and a JVC head unit.",
            "Lotus didn't stray far from its \"light is right\" philosophy when it developed the Evora. Marketed as a more daily-drivable alternative to the Elise, it offered a 2+2 seating layout and a broader range of technology and comfort features but it retained the precise steering and the sharp handling that the firm is known for. Production ended in 2021 after the coupe went through several evolutions.",
            "Power comes from a Toyota-derived 3.5-liter V6, rated at 276 horsepower and 258 lb-ft of torque. Mid-mounted, it spins the rear wheels via a 6-speed manual transmission."
        ],
        "auction_equipment": [
            "18-inch front, 19-inch rear wheels",
            "Bi-xenon headlights",
            "Body-colored door handles",
            "Rear spoiler",
            "Leather upholstery",
            "Recaro front seats",
            "Manually adjustable bucket seats",
            "Flat-bottom magnesium steering wheel",
            "Power-adjustable door mirrors",
            "Air conditioning",
            "Keyless entry"
        ],
        "modifications": [
            "TopSpeed exhaust system",
            "Aftermarket rear diffuser",
            "Paint protection film on the front end",
            "Ceramic window tint (35% on side windows, 70% on windshield)",
            "JVC head unit",
            "Trickle charger"
        ],
        "known_flaws": [
            "The attached Carfax history report shows that this Lotus sustained \"minor damage\" to the front, the right, and the right rear side in February 2012. The seller states that the previous owner had the passenger side wheels replaced through an insurance claim, and that no damages or repairs were made to the body of the vehicle.",
            "Some curb rash on rear passenger side wheel",
            "2015 date code on front tires",
            "Some wear on driver's seat side bolster",
            "Warped airbag cover on dashboard"
        ],
        "services": [],
        "included_items": [
            "2 keys",
            "Owner's manual",
            "Larini muffler",
            "Car cover"
        ],
        "ownership_history": "The seller purchased this Lotus in August 2021 and has added approximately 6,000 miles since.",
        "auction_stats": {
            "reserve_status": "No reserve",
            "auction_status": "Sold to",
            "highest_bid_value": "$46,450",
            "auction_date": "Apr 6, 2023 8:50 PM",
            "view_count": "15,208",
            "bid_count": "43",
            "bids": [
                "$46,450",
                "$46,200",
                "$45,850",
                "$45,600",
                "$45,175",
                "$44,925",
                "$44,600",
                "$44,350",
                "$43,850",
                "$43,600",
                "$43,350",
                "$43,100",
                "$42,850",
                "$42,600",
                "$41,750",
                "$41,500",
                "$41,250",
                "$40,950",
                "$40,690",
                "$40,420",
                "$40,110",
                "$38,250",
                "$38,000",
                "$37,000",
                "$36,000",
                "$35,000",
                "$30,000",
                "$28,000",
                "$23,000",
                "$21,250",
                "$21,000",
                "$20,250",
                "$20,000",
                "$15,000",
                "$13,000",
                "$12,545",
                "$12,445",
                "$12,345",
                "$9,999",
                "$5,100",
                "$5,000",
                "$1,000",
                "$420"
            ]
        }
    },
    "https://carsandbids.com/auctions/30X85pqM/1991-mitsubishi-3000gt-vr-4": {
        "auction_title": "1991 Mitsubishi 3000GT VR-4",
        "auction_subtitle": "NO RESERVE 5-Speed Manual, AWD, Some Modifications, Recent Major Service",
        "auction_quick_facts": {
            "Make": "Mitsubishi",
            "Model": "3000GT\nSave",
            "Mileage": "79,700 Miles Shown - TMU",
            "VIN": "JA3XE74C9MY022484",
            "Title Status": "Registered (NH)",
            "Location": "Newport, NH 03773",
            "Seller": "Gemclassiccars",
            "Engine": "3.0L Turbocharged V6",
            "Drivetrain": "4WD/AWD",
            "Transmission": "Manual (5-Speed)",
            "Body Style": "Coupe",
            "Exterior Color": "Fiji Blue",
            "Interior Color": "Black",
            "Seller Type": "Dealer"
        },
        "dougs_take": "The Mitsubishi 3000GT is an underrated sports car, and this is the desirable VR-4 model which boasts a 3.0-liter V6 twin-turbocharged to 300 horsepower and all-wheel-drive. This VR-4 also touts the 5-speed manual transmission that enhances the driving experience, and the recent major service should provide bidders with valuable peace of mind – big-ticket items like the head gaskets and the timing belt were replaced in December 2022. Fiji Blue is an attractive color, too – and no reserve further enhances this coupe's appeal.",
        "auction_highlights": [
            "This coupe is equipped with the desirable 5-speed manual transmission.",
            "Factory equipment includes an Electronically Controlled Suspension (ECS), a four-wheel steering system, pop-up headlights, a rear spoiler with an Active Aero function, leather upholstery, air conditioning, and cruise control. Modifications reported by the seller include aftermarket parts in the exhaust system, 19-inch SSR wheels, a GReddy exhaust temperature gauge, and a Blitz Racing boost gauge.",
            "An invoice pictured in the gallery notes that the head gaskets, valve guides, timing belt, and water pump are among the parts replaced during a service performed in December 2022.",
            "Released for 1991, and initially offered only as a coupe, the Mitsubishi 3000GT was developed to offer supercar-like performance without a supercar-like price tag. While base models shipped with front-wheel-drive and a naturally-aspirated V6, the range-topping VR-4 model gained all-wheel-drive and a pair of turbochargers. 1994 brought a round of visual updates and production ended after the 1999 model year.",
            "Power comes from a 3.0-liter twin-turbocharged V6, rated at 300 horsepower and 315 lb-ft of torque. It spins the four wheels via a 5-speed manual transmission."
        ],
        "auction_equipment": [
            "Electronically Controlled Suspension (ECS)",
            "Four-wheel steering system",
            "Pop-up headlights",
            "Fog lights",
            "Rear wiper",
            "Rear spoiler with Active Aero function",
            "Leather upholstery",
            "Power-operated windows",
            "Power-operated door locks",
            "Air conditioning",
            "Cruise control"
        ],
        "modifications": [
            "Polished intake manifold",
            "Blue paint on the front valve cover",
            "Catalytic converter removed",
            "Aftermarket parts in the exhaust system",
            "19-inch SSR wheels",
            "Wheel spacers",
            "Front splitter removed",
            "Blue interior trim",
            "Aftermarket shift knob",
            "Aftermarket shifter boot",
            "GReddy exhaust temperature gauges",
            "Blitz Racing boost gauge",
            "Alpine head unit"
        ],
        "known_flaws": [
            "The attached Carfax history report notes that this 3000GT sustained \"minor damage\" to its left side and right front in September 2018. The selling dealer states that this 3000GT has been repainted in its factory color and that both doors have been replaced.",
            "The selling dealer states that the tachometer, speedometer, and odometer work intermittently. The odometer displays about 79,700 miles, but this 3000GT's true mileage is unknown.",
            "Exterior chips and scratches (shown in the gallery)",
            "Front turn signal lenses cracked; moisture in the passenger-side front parking light",
            "Driver-side side skirt is loose",
            "Dents on the roof panel",
            "Dent in the driver-side front wheel; scratches on the passenger-side rear wheel",
            "2015 date code on the rear tires",
            "Wear on the outer front seat bolsters",
            "Cracked trim on the driver's door sill",
            "Loose upholstery and cracks on the driver's door panel",
            "SRS warning light is illuminated in the instrument cluster",
            "The seller notes that the clutch pedal \"needs to be pressed hard and all the way\" to the floor for the gears to shift smoothly.",
            "Some rust on underbody components and brake hardware"
        ],
        "services": [
            "December 2022 (79,620 miles): Cylinder head gaskets, cylinder head bolts, valve guides, valve seals, timing belt, water pump, thermostat, coolant, engine oil and filter, spark plugs, spark plug wires, PCV valve, power steering pump belt, serpentine belt, and two tires changed, cylinder heads cleaned, valves adjusted, windows repaired"
        ],
        "included_items": [
            "1 key",
            "Owner's manual",
            "Service records"
        ],
        "ownership_history": "The selling dealer is listing this 3000GT on behalf of its owner, who reportedly bought it in November 2022.",
        "auction_stats": {
            "reserve_status": "No reserve",
            "auction_status": "Sold to",
            "highest_bid_value": "$15,400",
            "auction_date": "Apr 6, 2023 8:43 PM",
            "view_count": "14,209",
            "bid_count": "24",
            "bids": [
                "$15,400",
                "$15,100",
                "$14,700",
                "$14,500",
                "$14,100",
                "$14,000",
                "$13,700",
                "$13,500",
                "$12,900",
                "$12,750",
                "$12,500",
                "$11,850",
                "$11,500",
                "$11,200",
                "$11,000",
                "$10,800",
                "$10,300",
                "$10,000",
                "$6,666",
                "$5,555",
                "$5,000",
                "$4,500",
                "$2,200",
                "$2,000"
            ]
        }
    },
    "https://carsandbids.com/auctions/KYo6zy7L/2017-lamborghini-huracan-lp-580-2-spyder": {
        "auction_title": "2017 Lamborghini Huracan LP 580-2 Spyder",
        "auction_subtitle": "V10 Power, RWD, Some Modifications, Southern-Owned",
        "auction_quick_facts": {
            "Make": "Lamborghini",
            "Model": "Huracan\nSave",
            "Mileage": "15,000",
            "VIN": "ZHWUR2ZF8HLA07731",
            "Title Status": "Clean (FL)",
            "Location": "Orlando, FL 32809",
            "Seller": "mmgcars",
            "Engine": "5.2L V10",
            "Drivetrain": "Rear-wheel drive",
            "Transmission": "Automatic (7-Speed)",
            "Body Style": "Convertible",
            "Exterior Color": "Blu Achelous Metallic",
            "Interior Color": "Red",
            "Seller Type": "Dealer"
        },
        "dougs_take": "The Lamborghini Huracan LP 580-2 is a thrilling supercar, as it combines gorgeous styling, razor-sharp handling, rear-wheel drive, and a raucous naturally-aspirated V10 with 573 horsepower. This particular Huracan is finished in a stunning shade of blue named Blu Achelous Metallic, which looks terrific against the red leather interior – and, this is a Spyder model that features a power-operated soft top, so you can hear the roaring V10 even better. This Huracan is also equipped with a few upgrades intended to improve its look – like an aftermarket front splitter and rear spoiler, black-painted factory wheels, and Tricolore side stripes. On top of all that, this Huracan benefits from having low mileage and ownership in warm-weather Southern states since new, adding further to its appeal.",
        "auction_highlights": [
            "This convertible's odometer displays about 15,000 miles.",
            "The attached Carfax history report shows no mileage discrepancies in this Huracan’s past. It also confirms that it’s been registered in Southern states since new.",
            "Factory equipment includes 20-inch wheels, LED headlights, a power-operated soft top, leather upholstery, red stitching, heated and power-adjustable seats, automatic climate control, and a navigation system, among others listed below.",
            "Modifications reported by the selling dealer include factory wheels painted black, an aftermarket front splitter, clear front bumper reflectors, tricolore side stripes, and an aftermarket rear duckbill spoiler.",
            "Lamborghini released the Huracan for 2015 to replace the Gallardo at the bottom of its range, though \"entry-level\" was a highly relative term. Offered as a coupe and as a roadster, the model launched with all-wheel drive, and a naturally-aspirated V10 engine mounted directly behind the passenger compartment. Rear-wheel drive became available for 2016, and Lamborghini still sells the Huracan new today.",
            "Power comes from a 5.2-liter V10, rated at 573 horsepower and 398 lb-ft of torque. It spins the rear wheels via a 7-speed automatic transmission linked to a pair of shift paddles."
        ],
        "auction_equipment": [
            "20-inch wheels",
            "LED headlights",
            "Power-operated soft top",
            "Brake calipers painted red",
            "Leather upholstery",
            "Red stitching",
            "Lamborghini logo in the headrests",
            "Heated and power-adjustable seats",
            "Automatic climate control",
            "Navigation system",
            "Rear view camera",
            "Front and rear parking sensors"
        ],
        "modifications": [
            "Factory wheels painted black",
            "Aftermarket front splitter",
            "Clear front bumper reflectors",
            "Tricolore side stripes",
            "Aftermarket rear duckbill spoiler"
        ],
        "known_flaws": [
            "The attached Carfax history report indicates that this Huracan sustained \"minor damage\" to the rear in April 2019. The report notes that the airbags did not deploy."
        ],
        "services": [
            "September 2022 (14,514 miles): Battery replaced, tire repaired, engine oil and filter changed",
            "June 2021 (13,359 miles): Engine oil and filter changed"
        ],
        "included_items": [
            "2 keys",
            "Owner's manual"
        ],
        "ownership_history": "The selling dealer acquired this Lamborghini in 2023 and has added minimal mileage since.",
        "auction_stats": {
            "reserve_status": "Reserve",
            "auction_status": "Reserve not met, bid to",
            "highest_bid_value": "$173,500",
            "auction_date": "Apr 6, 2023 8:30 PM",
            "view_count": "14,674",
            "bid_count": "65",
            "bids": [
                "$173,500",
                "$173,000",
                "$170,500",
                "$170,000",
                "$161,000",
                "$160,000",
                "$157,000",
                "$156,500",
                "$156,000",
                "$155,500",
                "$155,000",
                "$142,500",
                "$142,000",
                "$139,500",
                "$139,000",
                "$138,500",
                "$138,000",
                "$137,500",
                "$137,000",
                "$136,500",
                "$136,000",
                "$135,500",
                "$135,000",
                "$134,500",
                "$134,000",
                "$133,000",
                "$132,500",
                "$132,000",
                "$131,500",
                "$131,000",
                "$130,500",
                "$130,000",
                "$129,500",
                "$129,000",
                "$127,000",
                "$126,500",
                "$126,000",
                "$125,500",
                "$125,000",
                "$124,500",
                "$123,956",
                "$123,456",
                "$121,500",
                "$120,000",
                "$119,500",
                "$119,000",
                "$118,500",
                "$118,000",
                "$117,000",
                "$116,000",
                "$114,802",
                "$114,302",
                "$112,302",
                "$111,802",
                "$105,802",
                "$87,500",
                "$86,789",
                "$85,000",
                "$42,069",
                "$34,567",
                "$25,250",
                "$25,000",
                "$1,000",
                "$700",
                "$578"
            ]
        }
    },
    "https://carsandbids.com/auctions/9ekRMxa8/2008-audi-s5-coupe": {
        "auction_title": "2008 Audi S5 Coupe",
        "auction_subtitle": "NO RESERVE Owned by Hoovie's Garage, 6-Speed Manual, V8 Power, AWD, Major Recent Service",
        "auction_quick_facts": {
            "Make": "Audi",
            "Model": "S5\nSave",
            "Mileage": "110,000",
            "VIN": "WAURV78T48A030573",
            "Title Status": "Clean (KS)",
            "Location": "San Diego, CA 92101",
            "Seller": "HooviesGarage",
            "Engine": "4.2L V8",
            "Drivetrain": "4WD/AWD",
            "Transmission": "Manual (6-Speed)",
            "Body Style": "Coupe",
            "Exterior Color": "Ice Silver Metallic",
            "Interior Color": "Magma Red",
            "Seller Type": "Dealer"
        },
        "dougs_take": "I love it whenever Hoovie's Garage brings a cool car to Cars & Bids, and this S5 is no exception. The B8 S5 is a beautiful coupe that boasts a naturally aspirated 4.2-liter V8 paired with Audi's Quattro all-wheel drive system. This particular example comes with the added benefit of a 6-speed manual transmission and a stunning Magma Red interior – making it especially desirable. It's also fitted with an AWE S-FLO intake and a Meisterschaft exhaust, which allow for even more glorious V8 noises. Plus, this S5 has plenty of highly desirable recent maintenance and repair work documented on Hoovie's YouTube channel for added peace of mind – AND it's offered with the thrill of no reserve, so someone is taking home this Audi at the end of the auction!",
        "auction_highlights": [
            "This S5 is owned by YouTuber Tyler Hoover. Its purchase and some of the repairs performed to it were documented in a series of videos that can be viewed below.",
            "This S5 features the desirable 6-speed manual transmission.",
            "According to the build sheet provided in the gallery, factory equipment includes 19-inch wheels, a panoramic sunroof, Nappa leather upholstery, power-adjustable and heated front sports seats, a navigation system, and an advanced parking system with rearview camera.",
            "Modifications reported by the selling dealer are limited to an AWE S-FLO intake system, a Meisterschaft exhaust system, and black-finished front and rear emblems.",
            "Introduced in 2007, the \"B8\" Audi A5 platform would join the TT and R8 as the third coupe offering from Audi, and the high-performance S5 variant was released in coupe form at the same time. The S5 featured more aggressive body styling than the A5, and came equipped with sport suspension, larger brakes, heated sports seats, and more.",
            "Power comes from a 4.2-liter V8, rated at 354 horsepower and 325 lb-ft of torque. Output is sent to all four wheels through a 6-speed manual transmission and Audi's Quattro all-wheel drive system."
        ],
        "auction_equipment": [
            "19-inch five-arm Y-spoke wheels",
            "Adaptive bi-xenon headlights",
            "Panoramic sunroof",
            "Nappa leather upholstery",
            "Power-adjustable and heated front sports seats",
            "Stainless steel inlays",
            "Automatic climate control system",
            "Navigation system",
            "Advanced parking system with rearview camera",
            "Cruise control"
        ],
        "modifications": [
            "AWE S-FLO carbon fiber intake system",
            "Meisterschaft exhaust system",
            "Black finish on front and rear emblems"
        ],
        "known_flaws": [
            "Scratches, chips, and blemishes around the exterior (some touched up, pictured in the gallery)",
            "Additional holes drilled into the front bumper cover",
            "Headlight and taillight lenses are hazy",
            "Exhaust tips are misaligned",
            "Scratches on wheels",
            "Creases and wear on seats",
            "Wear on interior touch points",
            "Sagging sunroof sunshade",
            "The selling dealer reports \"a little play\" in the driver's seat motor."
        ],
        "services": [
            "Clutch, valve cover gaskets, thermostat, thermostat housing gasket, oil filter housing gasket, front lower control arms, front lower links, and rear brake pads and rotors replaced, valves walnut blasted, alignment performed, engine oil and filter changed, transmission fluid changed",
            "December 2022: Engine oil and filter changed",
            "September 2021 (97,241 miles): Coolant reservoir replaced, hood latch replaced, two tires replaced, washer nozzle(s) adjusted/repaired",
            "July 2020 (87,167 miles): Spark plug(s) replaced",
            "September 2018 (71,531 miles): Engine oil and filter changed, battery replaced"
        ],
        "included_items": [
            "1 key, 1 fob"
        ],
        "ownership_history": "The selling dealer acquired this S5 in January 2023.",
        "auction_stats": {
            "reserve_status": "No reserve",
            "auction_status": "Sold to",
            "highest_bid_value": "$16,999",
            "auction_date": "Apr 6, 2023 8:22 PM",
            "view_count": "45,521",
            "bid_count": "15",
            "bids": [
                "$16,999",
                "$16,115",
                "$15,000",
                "$13,000",
                "$12,700",
                "$12,555",
                "$12,345",
                "$12,169",
                "$12,001",
                "$11,450",
                "$11,211",
                "$11,111",
                "$8,000",
                "$6,969",
                "$420"
            ]
        }
    }
}