{
    "https://carsandbids.com/auctions/9l0nJjqE/2020-porsche-718-boxster-spyder": {
        "auction_title": "2020 Porsche 718 Boxster Spyder",
        "auction_subtitle": "~8,400 Miles, 6-Speed Manual, 414-hp Flat-6, Gentian Blue Metallic",
        "auction_quick_facts": {
            "Make": "Porsche",
            "Model": "718 Boxster\nSave",
            "Mileage": "8,400",
            "VIN": "WP0CC2A8XLS240198",
            "Title Status": "Clean (IN)",
            "Location": "Floyds Knobs, IN 47119",
            "Seller": "Stephen_W",
            "Engine": "4.0L Flat-6",
            "Drivetrain": "Rear-wheel drive",
            "Transmission": "Manual (6-Speed)",
            "Body Style": "Convertible",
            "Exterior Color": "Gentian Blue Metallic",
            "Interior Color": "Black",
            "Seller Type": "Private Party"
        },
        "dougs_take": "I love the Porsche Boxster Spyder, as these combine the fun of top-down driving with the driving thrills of a Cayman GT4 – including the fantastic 4.0-liter naturally aspirated flat-6 engine with 414 horsepower. This particular Boxster Spyder boasts a desirable 6-speed manual transmission, a stunning Gentian Blue Metallic exterior, and less than 9,000 miles from new. It also benefits from some desirable equipment like Porsche Active Suspension Management, leather and Alcantara upholstery, and full bucket seats. To top it off, this Boxster Spyder is completely unmodified – and it touts a clean, accident-free Carfax report showing one owner from new, which always increases the appeal.",
        "auction_highlights": [
            "This Boxster features the desirable 6-speed manual transmission, and its odometer displays approximately 8,400 miles.",
            "The attached Carfax history report shows no accidents or mileage discrepancies in this Boxster Spyder’s past. It also shows that this Boxster has been registered to one owner since new.",
            "According to the window sticker pictured in the photo gallery, this Boxster Spyder had an original MSRP of $108,600 and came equipped with 20-inch alloy wheels, Porsche Active Suspension Management (PASM), Porsche Torque Vectoring (PTV) with a mechanically locking rear differential, a manual-operated Spyder soft top, leather and Alcantara upholstery with silver contrast stitching, full bucket seats, carbon fiber interior trim, and more as detailed below. The seller reports no modifications.",
            "The 982-generation 718 Boxster debuted for the 2017 model year as an evolution on the Boxster nameplate, with the 718 designation paying homage to Porsche's 718 1950s race cars. The Boxster Spyder, which sits atop the Boxster range, shares many parts with the 718 Cayman GT4, including the naturally aspirated 4.0-liter flat-6, the chassis, and front and rear suspension setup. Spyder models feature an exclusive manual canvas soft top.",
            "Power comes from a 4.0-liter flat-6 engine, rated at 414 horsepower and 309 lb-ft of torque. Output is sent to the rear wheels via a 6-speed manual transmission."
        ],
        "auction_equipment": [
            "20-inch alloy wheels with colored Porsche Crest wheel center caps",
            "Porsche Active Suspension Management (PASM)",
            "Porsche Torque Vectoring (PTV) with mechanically locking rear differential",
            "Dynamic transmission mounts",
            "Brake calipers in high-gloss black",
            "Manual-operated soft top",
            "Leather and Alcantara upholstery with silver contrast stitching",
            "Full bucket seats",
            "Carbon fiber interior trim",
            "Fabric door pulls",
            "Navigation system",
            "Apple CarPlay compatibility",
            "Air conditioning",
            "Cruise control"
        ],
        "modifications": [],
        "known_flaws": [],
        "services": [],
        "included_items": [
            "2 keys",
            "Owner's manual",
            "Window sticker"
        ],
        "ownership_history": "The seller purchased this Boxster Spyder new in September 2020.",
        "auction_stats": {
            "reserve_status": "Reserve",
            "auction_status": "Reserve not met, bid to",
            "highest_bid_value": "$100,001",
            "auction_date": "Apr 5, 2023 11:02 PM",
            "view_count": "12,545",
            "bid_count": "14",
            "bids": [
                "$100,001",
                "$95,982",
                "$95,000",
                "$90,718",
                "$89,981",
                "$76,000",
                "$75,000",
                "$69,420",
                "$50,000",
                "$40,250",
                "$40,000",
                "$35,500",
                "$35,000",
                "$20,000"
            ]
        }
    },
    "https://carsandbids.com/auctions/3owMXvQ7/2000-toyota-4runner-sr5-4x4": {
        "auction_title": "2000 Toyota 4Runner SR5 4x4",
        "auction_subtitle": "NO RESERVE 1 Owner, 4WD, Texas-Owned, Upgrade Package #4, Mostly Unmodified",
        "auction_quick_facts": {
            "Make": "Toyota",
            "Model": "4Runner\nSave",
            "Mileage": "113,900",
            "VIN": "JT3HN86R7Y0282257",
            "Title Status": "Clean (TX)",
            "Location": "Plano, TX 75024",
            "Seller": "velomobile",
            "Engine": "3.4L V6",
            "Drivetrain": "4WD/AWD",
            "Transmission": "Automatic (4-Speed)",
            "Body Style": "SUV/Crossover",
            "Exterior Color": "Millenium Silver",
            "Interior Color": "Oak",
            "Seller Type": "Private Party"
        },
        "dougs_take": "The third-generation Toyota 4Runner is a fantastic SUV with great off-road capabilities, legendary reliability, and desirable old-school styling. This particular 4Runner is even more special than most, as it’s a mechanically unmodified, one-owner SUV with 4-wheel drive and a 2-speed transfer case, which is incredibly hard to find. This 4Runner also boasts some nice factory equipment, including the Upgrade Package #4, the Extra Mile Option Package B, and 16-inch wheels. It touts extensive service history records and a clean, accident-free Carfax report showing ownership in warm-weather Texas from new, further adding to the appeal – AND it’s offered with the thrill of no reserve, which adds to the excitement.",
        "auction_highlights": [
            "The attached Carfax vehicle history report shows no accidents or mileage discrepancies in this SR5’s past. It also confirms that this is a 1-owner car registered in Texas from new.",
            "According to the window sticker provided in the gallery, factory equipment includes the Upgrade Package #4 and The Extra Mile Option Package, 16-inch alloy wheels, power door locks, air conditioning, cruise control, and more as detailed below. Modifications reported by the seller are limited to a JVC touchscreen head unit with CarPlay, and a dual dashcam.",
            "Launched for 1996, the third-generation Toyota 4Runner arrived as the popularity of SUVs ballooned across America. It shared its basic proportions with its predecessor but it was new from the ground up and slightly longer. It shared its V6 engine with the first-generation Tacoma and Tundra trucks.",
            "Power comes from a 3.4-liter V6, rated at 183 horsepower and 217 lb-ft of torque. Output is sent to the rear or all four wheels through a 4-speed automatic transmission and a 2-speed transfer case."
        ],
        "auction_equipment": [
            "Upgrade Package #4 (Power windows, keyless entry, back window remote, tonneau cover, sport seats, leather steering wheel, CD player with 6 speakers, chrome wheel arch moldings)",
            "The Extra Mile Option Package B (body-side stripes, cargo net, roof luggage rack, wheel locks, trailer receiver hitch and wire harness, RS3200 Plus alarm system, rear wind deflector, chrome running boards, color-keyed bodyside molding)",
            "16-inch wheels",
            "2-speed transfer case",
            "Electronically Controlled Transmission (ECT)",
            "Power-adjustable heated door mirrors",
            "Power windows and door locks",
            "Cloth upholstery",
            "Air conditioning",
            "Cruise control"
        ],
        "modifications": [
            "JVC touchscreen head unit with CarPlay and rear-view camera (factory head unit included with the sale)",
            "Kingslim D1 pro dual dashcam"
        ],
        "known_flaws": [
            "Paint imperfections, delamination, and scratches around the exterior (pictured in the photo gallery)",
            "Dents on the hood",
            "Cracked driver fender trim (pictured in the photo gallery)",
            "Curb rash on wheels",
            "2015 date codes on tires",
            "Stains in interior upholstery and carpeting",
            "Loose stitching on the front passenger seat backrest",
            "Separation in rear door conduit molding",
            "Some rust on some underbody components"
        ],
        "services": [
            "January 2023 (113,638 miles): Lower control arms, rear door hatch struts, battery, wiper blades, license plate bulb, engine air filter, antenna, and engine oil and filter changed, key and key fob battery replaced, battery anti-corrosion pads installed, coolant flushed, tires balanced and rotated",
            "August 2020 (105,621 miles): Shifter bushings replaced, engine oil and filter changed, coolant flushed, fuel injector and throttle body cleaned, multi-point inspection performed",
            "October 2018 (101,082 miles): Battery replaced, engine oil and filter changed, tires rotated, multi-point inspection performed"
        ],
        "included_items": [
            "4 keys, 2 key fobs",
            "Owner's manual",
            "Window sticker",
            "Service records",
            "Spare tire",
            "Ballmount towing attachment",
            "Factory head unit with CD and cassette player",
            "Battery jumper cables",
            "Half-gallon plastic gas container"
        ],
        "ownership_history": "The seller purchased this SR5 new in February 2000.",
        "auction_stats": {
            "reserve_status": "No reserve",
            "auction_status": "Sold to",
            "highest_bid_value": "$20,000",
            "auction_date": "Apr 5, 2023 10:57 PM",
            "view_count": "11,042",
            "bid_count": "57",
            "bids": [
                "$20,000",
                "$19,500",
                "$18,777",
                "$18,400",
                "$18,100",
                "$17,800",
                "$17,500",
                "$17,100",
                "$16,800",
                "$16,500",
                "$16,200",
                "$15,900",
                "$15,600",
                "$15,300",
                "$15,000",
                "$14,600",
                "$14,500",
                "$14,400",
                "$14,300",
                "$14,111",
                "$14,000",
                "$13,900",
                "$13,750",
                "$13,600",
                "$13,500",
                "$13,400",
                "$13,100",
                "$13,000",
                "$12,900",
                "$12,800",
                "$12,500",
                "$12,400",
                "$12,177",
                "$9,700",
                "$9,600",
                "$9,500",
                "$9,200",
                "$9,100",
                "$9,000",
                "$8,600",
                "$8,500",
                "$8,400",
                "$8,300",
                "$8,200",
                "$8,100",
                "$8,000",
                "$7,770",
                "$7,600",
                "$7,500",
                "$7,400",
                "$7,000",
                "$6,700",
                "$6,500",
                "$6,300",
                "$5,200",
                "$5,100",
                "$5,000"
            ]
        }
    },
    "https://carsandbids.com/auctions/rNQBwQJE/2014-porsche-panamera-turbo-s-executive": {
        "auction_title": "2014 Porsche Panamera Turbo S Executive",
        "auction_subtitle": "570-hp Turbo V8, AWD, Highly Equipped, Extended Wheelbase",
        "auction_quick_facts": {
            "Make": "Porsche",
            "Model": "Panamera\nSave",
            "Mileage": "49,700",
            "VIN": "WP0BC2A7XEL077438",
            "Title Status": "Clean (GA)",
            "Location": "Lawrenceville, GA 30043",
            "Seller": "RacerX2020",
            "Engine": "4.8L Turbocharged V8",
            "Drivetrain": "4WD/AWD",
            "Transmission": "Automatic (7-Speed)",
            "Body Style": "Sedan",
            "Exterior Color": "Basalt Black Metallic",
            "Interior Color": "Black",
            "Seller Type": "Private Party"
        },
        "dougs_take": "The Porsche Panamera Turbo S is a special car, blending a luxurious interior with shocking performance and engaging handling - and it has a twin-turbocharged V8 with 570 horsepower. This particular Turbo S is the ultra-rare, ultra-special Executive model, which boasts a longer wheelbase for more rear leg room – and a huge list of factory options, including Porsche Carbon Ceramic Brakes, heated and ventilated front and rear seats, and a rear-seat entertainment system. This Turbo S is also unmodified, and it touts a clean, accident-free Carfax report showing ownership in western and southern states from new, further adding to the appeal – and it comes with some recent reported service history, for some added peace of mind.",
        "auction_highlights": [
            "The odometer on this Panamera currently displays approximately 49,700 miles.",
            "The attached Carfax history report shows no accidents or mileage discrepancies in this Panamera’s past. It also shows that it's been registered in Washington, Tennessee, and Georgia since new.",
            "A build sheet is provided in the photo gallery, and a partial list of notable equipment includes the Sport Chrono Package, 20-inch Sport Classic wheels, Porsche Carbon Ceramic Brakes (PCCB), a power sunroof, leather upholstery and Anthracite Birch wood interior trim, power-adjustable, heated, and ventilated front and rear seats, a Burmester sound system, a rear-seat entertainment system, and more as detailed below. The seller reports no modifications.",
            "After several false starts, Porsche entered the sedan segment for the first time when it launched the original Panamera for 2010. While its design and its very existence were controversial, the Panamera ultimately drew praise as the sportiest model in its segment and it achieved this distinction without sacrificing comfort or luxury. The Turbo S model sat at the top of the lineup, with the Executive trim adding an additional 6 inches to the wheelbase to better accommodate chauffeur-driven rear seat occupants.",
            "Power comes from a 4.8-liter twin-turbocharged V8, rated at 570 horsepower and 590 lb-ft of torque. Output is sent to all four wheels via a 7-speed dual-clutch automatic transmission."
        ],
        "auction_equipment": [
            "Sport Chrono Package (dashboard-mounted stopwatch, Sport Plus driving mode, Launch Control mode)",
            "20-inch Sport Classic wheels",
            "Porsche Carbon Ceramic Brakes (PCCB)",
            "Porsche Active Suspension Management (PASM)",
            "LED headlights with Porsche Dynamic Light System Plus (PDLS Plus)",
            "Power sunroof",
            "Soft-close doors",
            "Leather upholstery",
            "Anthracite Birch wood interior trim",
            "Power-adjustable, heated, and ventilated front and rear seats",
            "Burmester sound system",
            "Rear-seat entertainment system",
            "4-zone automatic climate control",
            "Navigation system",
            "Power rear sunshade",
            "Front and rear ParkAssist with a surround-view camera system",
            "Lane Change Assist (LCA)",
            "Lane Departure Warning (LDW)",
            "Adaptive cruise control including Porsche Active Safe (PAS)"
        ],
        "modifications": [],
        "known_flaws": [
            "Various scratches and chips as seen in gallery photos",
            "Stone chips on the front end",
            "Ding on the passenger-side quarter panel (pictured in the photo gallery)",
            "Scratch on the lift gate (pictured in the photo gallery)",
            "Chip on driver-side front wheel",
            "Blemish on steering wheel (the seller notes that this was caused by an abrasive cleaning substance)"
        ],
        "services": [
            "February 2023 (48,870 miles): Power steering pump and active stabilizer pressure hoses replaced",
            "February 2023 (48,603 miles): 1 tire replaced",
            "October 2022 (43,933 miles): Engine oil and filter changed",
            "March 2022 (34,762 miles): Engine oil and filter changed, cabin and engine air filters and front and rear brake pads replaced",
            "February 2022 (32,799 miles): 2 tires replaced, alignment performed",
            "July 2021 (27,387 miles): Battery and wiring harness replaced",
            "September 2020 (19,178 miles): 1 tire replaced",
            "September 2020 (18,982 miles): Roof console and rear cupholder replaced",
            "April 2021 (24,463 miles): Engine oil and filter changed, two tires replaced",
            "January 2019 (12,403 miles): Engine oil and filter changed, cabin air filter replaced/cleaned, brake fluid flushed/changed"
        ],
        "included_items": [
            "2 keys",
            "Owner's manuals",
            "Service records",
            "Two sets of wireless headphones for the rear-seat entertainment system",
            "Porsche all-weather floor mats",
            "Covercraft car cover",
            "Covercraft sun protector with storage bag",
            "Mobil 1 European car motor oil"
        ],
        "ownership_history": "The seller purchased this Panamera in April 2020 and has added approximately 35,500 miles since. ",
        "auction_stats": {
            "reserve_status": "Reserve",
            "auction_status": "Reserve not met, bid to",
            "highest_bid_value": "$46,000",
            "auction_date": "Apr 5, 2023 10:46 PM",
            "view_count": "8,635",
            "bid_count": "18",
            "bids": [
                "$46,000",
                "$45,600",
                "$45,250",
                "$45,000",
                "$31,500",
                "$30,520",
                "$30,269",
                "$30,000",
                "$27,250",
                "$27,000",
                "$26,500",
                "$26,000",
                "$25,000",
                "$24,000",
                "$23,456",
                "$15,971",
                "$15,000",
                "$100"
            ]
        }
    },
    "https://carsandbids.com/auctions/9WMZOmqV/2016-range-rover-hse-td6": {
        "auction_title": "2016 Range Rover HSE Td6",
        "auction_subtitle": "1 Owner, Turbodiesel V6 Power, 4WD, Vision Assistance Package, Unmodified",
        "auction_quick_facts": {
            "Make": "Land Rover",
            "Model": "Range Rover\nSave",
            "Mileage": "122,600",
            "VIN": "SALGS2KF3GA277082",
            "Title Status": "Clean (MD)",
            "Location": "Hagerstown, MD 21740",
            "Seller": "lanierchris",
            "Engine": "3.0L Turbodiesel V6",
            "Drivetrain": "4WD/AWD",
            "Transmission": "Automatic (8-Speed)",
            "Body Style": "SUV/Crossover",
            "Exterior Color": "Loire Blue",
            "Interior Color": "Almond/Espresso",
            "Seller Type": "Dealer ($40 Temporary Tag)"
        },
        "dougs_take": "The L405 Range Rover is what most people envision when they think of a full-size luxury SUV, and it certainly doesn't disappoint. This particular example is especially impressive, as it boasts a turbodiesel V6 that puts down a stout 443 lb-ft of torque through all four wheels. This Range Rover is also finished in a gorgeous color combination, and it's equipped with nice features including the Vision Assist Package, 20-inch wheels, heated and ventilated front seats, heated rear seats, a premium Meridian sound system, and more. This Range Rover is also unmodified – and it's offered with a clean, accident-free Carfax report for added buyer confidence.",
        "auction_highlights": [
            "The attached Carfax history report indicates no accidents or mileage discrepancies. It also shows this is a one-owner SUV.",
            "Equipment includes the Vision Assistance Package, 20-inch wheels, a panoramic sunroof, leather upholstery, heated and ventilated power-adjustable front seats, heated rear seats, adaptive cruise control, Meridian sound system, and more as detailed below. The seller reports no modifications.",
            "New for the 2013 model year, the \"L405\" Range Rover boasts an aluminum body that artfully blends the brand's heritage with a sleek, modern look and significantly reduced weight despite its bigger footprint. Production ended in 2021.",
            "Power comes from a 3.0-liter turbodiesel V6 engine, which produces 254 horsepower and 443 lb-ft of torque. Output is sent to all four wheels through an 8-speed automatic transmission and a 2-speed transfer case."
        ],
        "auction_equipment": [
            "Vision Assistance Package (configurable mood lighting, blind spot monitor, reverse traffic detection, adaptive xenon headlights, high beam assist, All Terrain Progress Control, Terrain Response 2 Auto, surround camera system, front fog lights)",
            "20-inch wheels",
            "Adaptive suspension system",
            "Panoramic sunroof",
            "Roof rack",
            "Power-operated rear hatch",
            "Leather upholstery",
            "Heated and ventilated power-adjustable front seats",
            "Heated rear seats",
            "Wood interior trim",
            "3-zone automatic climate control",
            "Adaptive cruise control",
            "Navigation system",
            "Meridian sound system"
        ],
        "modifications": [],
        "known_flaws": [
            "Dings on driver's door",
            "Curb rash on some wheels",
            "Some marks on cargo area plastics"
        ],
        "services": [
            "October 2022: Vehicle serviced",
            "March 2021 (97,104 miles): Vehicle serviced, tire repaired",
            "July 2019 (75,692 miles): Vehicle serviced, maintenance inspection completed, 80,000-mile service performed, front and rear brake pads replaced",
            "November 2018 (63,069 miles): Vehicle serviced, maintenance inspection completed, steering/suspension checked",
            "March 2018 (47,625 miles): Vehicle serviced, maintenance inspection completed, engine checked",
            "November 2017 (35,523 miles): Vehicle serviced, maintenance inspection completed, tire condition and pressure checked"
        ],
        "included_items": [
            "2 key fobs",
            "Owner's manuals",
            "All-weather floor mats, carpeted floor mats",
            "All-weather cargo mat"
        ],
        "ownership_history": "The selling dealer states that they recently acquired this Range Rover.",
        "auction_stats": {
            "reserve_status": "Reserve",
            "auction_status": "Sold to",
            "highest_bid_value": "$26,250",
            "auction_date": "Apr 5, 2023 10:41 PM",
            "view_count": "6,370",
            "bid_count": "29",
            "bids": [
                "$26,250",
                "$26,000",
                "$25,750",
                "$25,500",
                "$25,250",
                "$25,000",
                "$24,750",
                "$24,500",
                "$24,250",
                "$24,000",
                "$23,500",
                "$23,250",
                "$23,000",
                "$22,750",
                "$22,500",
                "$22,250",
                "$22,000",
                "$21,500",
                "$21,000",
                "$20,000",
                "$19,750",
                "$19,500",
                "$16,750",
                "$16,500",
                "$15,000",
                "$10,000",
                "$300",
                "$200",
                "$100"
            ]
        }
    },
    "https://carsandbids.com/auctions/3gYdVDn1/2021-tesla-model-3-standard-range-plus": {
        "auction_title": "2021 Tesla Model 3 Standard Range Plus",
        "auction_subtitle": "NO RESERVE 263-Mile Range, 19-inch Stiletto Refresh Wheels, Mostly Unmodified",
        "auction_quick_facts": {
            "Make": "Tesla",
            "Model": "Model 3\nSave",
            "Mileage": "10,900",
            "VIN": "5YJ3E1EAXMF098631",
            "Title Status": "Clean (ID)",
            "Location": "Boise, ID 83705",
            "Seller": "tesla243",
            "Engine": "Single Electric Motor",
            "Drivetrain": "Rear-wheel drive",
            "Transmission": "Automatic",
            "Body Style": "Sedan",
            "Exterior Color": "Solid Black",
            "Interior Color": "Black",
            "Seller Type": "Private Party"
        },
        "dougs_take": "The Tesla Model 3 is a fantastic electric car that offers a usable range, great practicality, and excellent technology. This particular Model 3 is a Standard Range Plus model with rear-wheel drive, and it boasts some nice factory equipment, including the Partial Premium Interior, Autopilot, and the handsome 19-inch Stiletto Refresh wheels. This Model 3 also comes with a clean, accident-free Carfax report, showing a single owner from new – and it's offered with the thrill of no reserve, which always adds to the appeal.",
        "auction_highlights": [
            "The attached Carfax history report shows no accidents or mileage discrepancies in this Model 3’s past. It also confirms that this is a 1-owner car.",
            "According to the window sticker provided in the gallery, factory equipment includes 19-inch Stiletto Refresh wheels, a Black Partial Premium interior, a 15-inch touchscreen display, Autopilot technology, automatic climate control, a navigation system, and more as detailed below. Modifications reported by the seller are limited to tinted windows.",
            "At launch, the Tesla Model 3 was celebrated as a premium EV with a usable range and respectable performance, all at a reasonably attainable price. The Standard Range Plus model touts a combined 142 MPGe rating, and it has a total EPA-estimated range of 263 miles.",
            "Power comes from a single electric motor that draws electricity from a 50 kWh battery pack to zap the rear wheels with 283 horsepower and 310 lb-ft of torque, according to third-party estimates."
        ],
        "auction_equipment": [
            "19-inch Stiletto Refresh wheels",
            "LED exterior lighting",
            "Black Partial Premium interior",
            "15-inch touchscreen display",
            "Automatic climate control",
            "Navigation system",
            "Autopilot technology",
            "Wi-Fi and LTE connection"
        ],
        "modifications": [
            "Tinted windows"
        ],
        "known_flaws": [
            "Scratches and stone chips on the front end and rocker panels (pictured in the photo gallery)",
            "Repaired chip in the windshield",
            "Ding on driver's door (pictured in the photo gallery)",
            "Curb rash on the driver-side rear wheel (pictured in the photo gallery)",
            "Scuffs on the driver's interior door panel"
        ],
        "services": [
            "May 2022 (4,631 miles): Right taillight replaced",
            "December 2021 (945 miles): Car computer replaced"
        ],
        "included_items": [
            "2 key cards",
            "Owner's manual",
            "Window sticker",
            "Service records",
            "Charging cable",
            "Extension cord",
            "Front license plate bracket",
            "All-weather floor mats"
        ],
        "ownership_history": "The seller purchased this Model 3 new in November 2021.",
        "auction_stats": {
            "reserve_status": "No reserve",
            "auction_status": "Sold to",
            "highest_bid_value": "$31,500",
            "auction_date": "Apr 5, 2023 10:31 PM",
            "view_count": "4,820",
            "bid_count": "14",
            "bids": [
                "$31,500",
                "$31,250",
                "$31,000",
                "$30,750",
                "$30,500",
                "$30,250",
                "$30,000",
                "$29,750",
                "$25,500",
                "$25,250",
                "$25,000",
                "$4,567",
                "$4,444",
                "$100"
            ]
        }
    },
    "https://carsandbids.com/auctions/365DlWbA/1996-porsche-911-turbo": {
        "auction_title": "1996 Porsche 911 Turbo",
        "auction_subtitle": "~37,700 Miles, 1 Owner, 6-Speed Manual, AWD, Twin-Turbo Flat-6",
        "auction_quick_facts": {
            "Make": "Porsche",
            "Model": "911\nSave",
            "Mileage": "37,700",
            "VIN": "WP0AC2994TS376315",
            "Title Status": "Clean (VA)",
            "Location": "Midlothian, VA 23112",
            "Seller": "ace270056",
            "Engine": "3.6L Turbocharged Flat-6",
            "Drivetrain": "4WD/AWD",
            "Transmission": "Manual (6-Speed)",
            "Body Style": "Coupe",
            "Exterior Color": "Polar Silver Metallic",
            "Interior Color": "Midnight Blue",
            "Seller Type": "Dealer"
        },
        "dougs_take": "The 993 Turbo is in my all-time \"top 2\" among Porsche 911 models, as it touts truly fantastic handling, perfect sizing, strong performance from the air-cooled twin-turbocharged flat-6, a mandatory 6-speed manual transmission, and an iconic design. This particular 993 Turbo features a stunning (and rare) Polar Silver Metallic over Midnight Blue color combination. It also benefits from having low mileage, just one owner from new, and some great equipment like supple leather upholstery, Dark Rootwood interior trim, and those fantastic 18-inch hollow-spoke wheels. Plus, this 993 Turbo's only modifications are a radar detector and an Alpine head unit. This is an excellent example of the final generation of air-cooled 911 Turbo, and I'm sure it will provide the next owner with plenty of thrills.",
        "auction_highlights": [
            "This 993 is equipped with a 6-speed manual transmission.",
            "The attached Carfax vehicle history report lists no mileage discrepancies in this 911 Turbo's past. It also shows that it has been registered to one owner since new.",
            "Factory equipment includes 18-inch hollow-spoke wheels, a sunroof, a rear spoiler, supple leather upholstery, power-adjustable front seats, Dark Rootwood interior trim, air conditioning, and power-operated windows, mirrors, and locks, among others listed below.",
            "Modifications reported by the selling dealer include a radar detector and an Alpine head unit.",
            "The 993 911 was sold for the 1995 to 1998 model years and represented the last – and most powerful – generation of air-cooled 911s. Available as a coupe, cabriolet, and Targa, and with rear- or all-wheel drive, the 993 was an evolution of the 964 it replaced with a more modern look and redesigned rear suspension system.",
            "Power comes from a twin-turbocharged 3.6-liter flat-6, rated at 400 horsepower and 398 lb-ft of torque. It spins all all-four wheels via a 6-speed manual transmission."
        ],
        "auction_equipment": [
            "18-inch hollow-spoke wheels",
            "Fog lights",
            "Brake calipers painted red",
            "Power-operated sunroof",
            "Rear wiper",
            "Rear spoiler",
            "Supple leather upholstery",
            "Power-adjustable front seats",
            "Dark Rootwood interior trim",
            "Aluminum instrument dials",
            "Air conditioning",
            "Power-operated windows, mirrors, and locks",
            "Cruise control"
        ],
        "modifications": [
            "Radar detector",
            "Alpine head unit"
        ],
        "known_flaws": [
            "The attached Carfax history report indicates that this 911 Turbo sustained damage to the rear after an accident in April 1999. The selling dealer states that the rear body panels have been repainted.",
            "Some rock chips on hood and front bumper",
            "Scratches on rear bumper",
            "Scratches on wheels",
            "1999 date codes on tires",
            "Wear on driver's seat's outer bolster",
            "Wear on steering wheel"
        ],
        "services": [],
        "included_items": [
            "1 key",
            "Owner's manual",
            "Porsche Production Specifications document",
            "Build sheet",
            "Tool kit"
        ],
        "ownership_history": "The selling dealer acquired this Porsche in 2022 and has added minimal mileage since.",
        "auction_stats": {
            "reserve_status": "Reserve",
            "auction_status": "Sold to",
            "highest_bid_value": "$180,000",
            "auction_date": "Apr 5, 2023 10:27 PM",
            "view_count": "22,256",
            "bid_count": "17",
            "bids": [
                "$180,000",
                "$176,000",
                "$175,000",
                "$171,000",
                "$170,000",
                "$160,000",
                "$159,000",
                "$153,500",
                "$153,000",
                "$152,500",
                "$152,000",
                "$151,500",
                "$150,993",
                "$149,993",
                "$145,000",
                "$75,000",
                "$50,000"
            ]
        }
    },
    "https://carsandbids.com/auctions/rbl5WDdQ/2005-saab-9-2x-aero": {
        "auction_title": "2005 Saab 9-2X Aero",
        "auction_subtitle": "NO RESERVE 5-Speed Manual, AWD, Some Modifications, Recent Timing Belt Service",
        "auction_quick_facts": {
            "Make": "Saab",
            "Model": "9-2X\nSave",
            "Mileage": "153,400",
            "VIN": "JF4GG22675G056855",
            "Title Status": "Clean (CA)",
            "Location": "Santa Clarita, CA 91350",
            "Seller": "CopySell",
            "Engine": "2.0L Turbocharged Flat-4",
            "Drivetrain": "4WD/AWD",
            "Transmission": "Manual (5-Speed)",
            "Body Style": "Wagon",
            "Exterior Color": "Midnight Black Metallic",
            "Interior Color": "Black/Parchment",
            "Seller Type": "Private Party"
        },
        "dougs_take": "The Saab 9-2X Aero is a really neat wagon – based on the Subaru Impreza WRX, but with Saab's unique styling and a nicer interior. The drivetrain is the same, though, which is a good thing – since that means you get a potent turbocharged 4-cylinder and Subaru's excellent all-wheel drive system. This particular 9-2X boasts a desirable 5-speed manual transmission, and it features some desirable upgrades intended to improve its performance and handling like 17-inch Enkei RPF1 wheels, a COBB Tuning Stage 1 tune, a WRX STi top-mount intercooler, an Invidia 3-inch catback exhaust, and an aftermarket lowering kit. This 9-2X Aero also benefits from having a fairly recent timing belt service – and it's offered with the allure of no reserve, further adding to its appeal.",
        "auction_highlights": [
            "This 9-2X features the desirable 5-speed manual transmission.",
            "The attached Carfax history report shows no mileage discrepancies in this 9-2X’s past.",
            "A partial list of notable equipment includes a functional hood scoop, a roof-mounted rear spoiler, 2-tone leather upholstery, a Lamco gauge pod, automatic climate control, and more as detailed below.",
            "Modifications reported by the seller include 17-inch Enkei RPF1 wheels, a COBB Tuning Stage 1 tune, a TurboXS blow-off valve, a Subaru WRX STi top-mount intercooler, an Invidia 3-inch catback exhaust, an aftermarket lowering kit, and a Kenwood touchscreen head unit. The full list of modifications can be seen below. ",
            "Service documentation in the gallery indicates that this 9-2X had its timing belt replaced in April 2022.",
            "Only produced for the 2005 and 2006 model years in North America, the 9-2X was a badge-engineered Subaru Impreza created to give Saab an entry into the premium small car segment. Linear models (later called 2.5i) were closely related to the Impreza, but the top-of-the-line Aero was a WRX with a Swedish makeover.",
            "Power comes from a 2.0-liter turbocharged flat-4, rated at 227 horsepower and 217 lb-ft of torque in stock form. Due to the modifications performed to this 9-2X, it likely produces more power, but a dyno sheet was not provided to confirm. Output is sent to all four wheels via a 5-speed manual transmission and a permanent all-wheel drive system."
        ],
        "auction_equipment": [
            "Permanent all-wheel drive system",
            "Front fog lights",
            "Functional hood scoop",
            "Roof-mounted rear spoiler",
            "2-tone leather upholstery",
            "Lamco gauge pod (dealer-installed)",
            "Power windows, locks, and side mirrors",
            "Automatic climate control",
            "Cruise control"
        ],
        "modifications": [
            "17-inch Enkei RPF1 wheels",
            "COBB Tuning Stage 1 tune",
            "TurboXS blow-off valve",
            "Subaru WRX STi top-mount intercooler",
            "COBB Tuning turbo heat shield",
            "Invidia 3-inch catback exhaust",
            "Aftermarket lowering kit",
            "Rolled fenders",
            "Rally Armor mud flaps",
            "Side-mounted front license plate bracket",
            "Tinted windows",
            "Kenwood touchscreen head unit",
            "COBB Tuning shift knob"
        ],
        "known_flaws": [
            "Various scratches, chips, dings, and clearcoat blemishes as seen in gallery photos",
            "Cloudy headlight lenses",
            "Scratch on driver-side front wheel",
            "Curb rash on passenger-side front wheel",
            "Creases, cracks, and wear on driver’s seat upholstery",
            "Some scratches and wear on interior plastic trim and touch points",
            "Key fobs not functional (the seller notes that the batteries have been replaced and believes the fobs need to be reprogrammed)",
            "ABS sensor(s) not function (the seller notes that the ABS functions as intended)",
            "Aftermarket oil temperature gauge not functional",
            "The seller notes a knocking sound from the shocks when extended and a brief grinding sound during cold starts.",
            "Rust on driver-side fender, passenger-side front door, and undercarriage components"
        ],
        "services": [
            "April 2022: Timing belt, tensioner, water pump, pulleys, and O2 sensor replaced",
            "February 2020: Valve cover gaskets, spark plugs, and mass airflow (MAF) sensor replaced"
        ],
        "included_items": [
            "2 keys and remote fobs",
            "Owner's manual",
            "Service records",
            "Spare tire",
            "Thule roof rack",
            "Thule XL cargo box",
            "COBB Tuning Accessport"
        ],
        "ownership_history": "The seller purchased this 9-2X in July 2016 and has added approximately 60,500 miles since. ",
        "auction_stats": {
            "reserve_status": "No reserve",
            "auction_status": "Sold to",
            "highest_bid_value": "$10,600",
            "auction_date": "Apr 5, 2023 10:21 PM",
            "view_count": "10,066",
            "bid_count": "48",
            "bids": [
                "$10,600",
                "$10,500",
                "$10,311",
                "$10,011",
                "$9,911",
                "$9,700",
                "$9,595",
                "$9,469",
                "$9,311",
                "$9,200",
                "$9,100",
                "$9,000",
                "$8,800",
                "$8,700",
                "$8,600",
                "$8,500",
                "$8,169",
                "$8,000",
                "$7,900",
                "$7,800",
                "$7,600",
                "$7,500",
                "$7,400",
                "$7,300",
                "$7,200",
                "$7,100",
                "$6,996",
                "$6,800",
                "$6,669",
                "$6,569",
                "$6,469",
                "$6,369",
                "$6,269",
                "$6,169",
                "$6,069",
                "$5,969",
                "$5,857",
                "$5,757",
                "$5,600",
                "$5,500",
                "$5,000",
                "$4,600",
                "$4,500",
                "$4,400",
                "$4,300",
                "$4,200",
                "$4,000",
                "$3,044"
            ]
        }
    },
    "https://carsandbids.com/auctions/r4VXEabL/2014-audi-s7": {
        "auction_title": "2014 Audi S7",
        "auction_subtitle": "420-hp Turbo V8, Quattro AWD, Black Optic Package, Mostly Unmodified",
        "auction_quick_facts": {
            "Make": "Audi",
            "Model": "S7\nSave",
            "Mileage": "107,000",
            "VIN": "WAUW2AFC4EN077425",
            "Title Status": "Clean (IL)",
            "Location": "Springfield, IL 62704",
            "Seller": "mdelcomyn",
            "Engine": "4.0L Turbocharged V8",
            "Drivetrain": "4WD/AWD",
            "Transmission": "Automatic (7-Speed)",
            "Body Style": "Sedan",
            "Exterior Color": "Brilliant Black",
            "Interior Color": "Black",
            "Seller Type": "Private Party"
        },
        "dougs_take": "The Audi S7 is a handsome fastback sedan that boasts Quattro all-wheel drive, a powerful turbocharged V8, and surprisingly good practicality. This particular S7 offers some great benefits, including the Black Optic Package, Carbon Atlas inlays, and a Bang & Olufsen advanced sound system. Modifications are limited to a set of 20-inch Vöxx wheels and tinted windows – which look great on this S7. And, this S7 touts a clean, accident-free Carfax report, for added buyer confidence.",
        "auction_highlights": [
            "The attached Carfax history report shows no accidents or mileage discrepancies in this S7’s past.",
            "According to the window sticker pictured in the photo gallery, this S7 carried an original MSRP of $90,895, and it came equipped with the Black Optic Package, a sports rear differential, a power sunroof, Valcona leather upholstery, power-adjustable and heated front seats, 4-zone automatic climate control, a Bang & Olufsen advanced sound system, Audi Advanced Key, and more as detailed below. Modifications reported by the seller are limited to 20-inch Vöxx wheels and tinted windows.",
            "Audi launched the first-generation A7 for the 2012 model year as its style icon, and it expanded the range with the V8-powered S7 for 2013. Both were related to the A6 under the sheet metal, but they stood out with a gorgeous design and surprising practicality thanks to a large hatch.",
            "Power comes from a 4.0-liter turbocharged V8 engine, rated at 420 horsepower and 406 lb-ft of torque. Output is sent to all four wheels via a 7-speed automatic transmission and Audi's Quattro permanent all-wheel drive system."
        ],
        "auction_equipment": [
            "Black Optic Package (High Gloss Black Package, exterior mirror housings in body color)",
            "Sports rear differential",
            "LED headlights and daytime running lights",
            "Power soft-closing doors",
            "Power tailgate",
            "Power sunroof",
            "Valcona leather upholstery",
            "Power-adjustable and heated front seats",
            "Power tilt and telescopic steering column",
            "Carbon Atlas inlays",
            "4-zone automatic climate control",
            "Bang & Olufsen advanced sound system",
            "MMI Navigation Plus system",
            "Audi Advanced Key"
        ],
        "modifications": [
            "20-inch Vöxx wheels",
            "Tinted windows"
        ],
        "known_flaws": [
            "Chips on the front bumper, hood, rocker panels, and passenger's side rear door",
            "Dent and paint blemish on driver's side fender",
            "Ding and scratch on passenger's side fender",
            "Scrtches on wheels",
            "Creases on driver's seat",
            "\"Vehicle lights: malfunction\" error message stays illuminated. The seller reports that this was diagnosed as a faulty light control module, though all the lights on the car currently function normally."
        ],
        "services": [
            "March 2023 (106,921 miles): Right front side marker light lens, bulb socket, and O2 sensor replaced",
            "January 2023 (105,846 miles): Oil strainer recall performed",
            "November 2022 (105,583 miles): Engine oil and filter changed, coolant line replaced",
            "May 2022 (102,599 miles): Four-wheel alignment performed",
            "December 2021 (101,000 miles): Coolant tank and coolant line replaced, engine oil and filter changed",
            "May 2021 (97,291 miles): Front air shocks, air ride pump, and battery replaced, engine oil and filter changed",
            "December 2020 (96,090 miles): Engine oil and filter changed, side marker light replaced",
            "June 2020 (93,639 miles): 40-amp fuse replaced",
            "January 2020 (92,500 miles): Rear brake pads replaced",
            "December 2019 (91,776 miles): Engine oil and filter changed"
        ],
        "included_items": [
            "2 keys",
            "Owner's manual",
            "Window sticker",
            "Service records",
            "Trunk net",
            "Rubber floor mats"
        ],
        "ownership_history": "The seller purchased this S7 in July 2017 and has added approximately 34,000 miles since.",
        "auction_stats": {
            "reserve_status": "Reserve",
            "auction_status": "Sold to",
            "highest_bid_value": "$24,750",
            "auction_date": "Apr 5, 2023 10:08 PM",
            "view_count": "9,198",
            "bid_count": "35",
            "bids": [
                "$24,750",
                "$24,500",
                "$24,219",
                "$23,969",
                "$23,700",
                "$23,420",
                "$23,000",
                "$22,750",
                "$22,500",
                "$22,250",
                "$22,000",
                "$21,500",
                "$21,250",
                "$21,000",
                "$20,250",
                "$20,000",
                "$19,750",
                "$19,500",
                "$19,250",
                "$19,000",
                "$18,250",
                "$18,000",
                "$17,500",
                "$17,250",
                "$17,000",
                "$16,000",
                "$15,000",
                "$7,000",
                "$5,714",
                "$5,000",
                "$2,000",
                "$1,320",
                "$1,001",
                "$520",
                "$420"
            ]
        }
    },
    "https://carsandbids.com/auctions/KPLGl6Pq/2009-lexus-lx-570": {
        "auction_title": "2009 Lexus LX 570",
        "auction_subtitle": "V8 Power, 4WD, Mostly Unmodified, Highly Equipped, Rare F-Sport Wheels",
        "auction_quick_facts": {
            "Make": "Lexus",
            "Model": "LX 570\nSave",
            "Mileage": "130,700",
            "VIN": "JTJHY00WX94022901",
            "Title Status": "Clean (CA)",
            "Location": "Idyllwild, CA 92549",
            "Seller": "good_design",
            "Engine": "5.7L V8",
            "Drivetrain": "4WD/AWD",
            "Transmission": "Automatic (6-Speed)",
            "Body Style": "SUV/Crossover",
            "Exterior Color": "Twilight Gray Metallic",
            "Interior Color": "Dark Gray",
            "Seller Type": "Private Party"
        },
        "dougs_take": "I absolutely love the 200-Series Toyota Land Cruiser and Lexus LX 570, as these have a powerful, durable V8 with excellent capabilities and the ability to almost run forever – AND they boasts an amazing combination of luxury and off-road prowess. This particular LX 570 features some great equipment like the very rare 22-inch F-Sport wheels, a 19-speaker Mark Levinson surround sound system, a rear-seat entertainment system, and a wide-view front and side monitor system with Intuitive Park Assist – and its only modification is a xenon headlight upgrade. This LX is also offered with a clean, accident-free Carfax report, adding further peace of mind.",
        "auction_highlights": [
            "The attached Carfax history report shows no accidents or mileage discrepancies in this LX 570’s past.",
            "According to the window sticker pictured in the photo gallery, this LX 570 had an original MSRP of $91,734 and came equipped with 22-inch F-Sport wheels, a power sunroof, leather upholstery and wood interior trim, power-adjustable, heated, and ventilated front seats, power-sliding 2nd-row seats, a navigation system, a 19-speaker Mark Levinson surround sound system, a wide-view front and side monitor system with Intuitive Park Assist, and more as detailed below. Modifications reported by the seller are limited to xenon headlights.",
            "Released for 2008, the LX 570 was a more luxurious evolution of the 200-Series Land Cruiser. Stylists dialed in a greater degree of visual differentiation between the Lexus and the Toyota models, and the LX continued to offer a much longer list of features and a more luxurious interior than the Land Cruiser. V8 power, full-time 4-wheel-drive, and body-on-frame construction made it exceptionally capable off the beaten path. Lexus gave the LX 570 several updates inside and out before ending production in 2021.",
            "Power comes from a 3UR-FE 5.7-liter V8, rated at 383 horsepower and 403 lb-ft of torque. Output is sent to all four wheels via a 6-speed automatic transmission and a full-time 4-wheel drive system with a 2-speed transfer case."
        ],
        "auction_equipment": [
            "22-inch F-Sport wheels (dealer-installed)",
            "2-speed transfer case",
            "Adaptive Variable Suspension (AVS) system",
            "Automatic Height Control (AHC) technology",
            "Paint protection film on front end (dealer-installed)",
            "Front fog lights",
            "Power sunroof",
            "Leather upholstery",
            "Wood interior trim",
            "Power-adjustable, heated, and ventilated front seats",
            "Power-sliding second-row seats",
            "Folding third-row seats",
            "4-zone automatic climate control",
            "Navigation system",
            "19-speaker Mark Levinson surround sound system",
            "Rear-seat entertainment system",
            "Rear-view camera",
            "Wide-view front and side monitor system with Intuitive Park Assist",
            "Cruise control",
            "Power-operated tailgate"
        ],
        "modifications": [
            "Xenon headlights"
        ],
        "known_flaws": [
            "Stone chips on front end",
            "Scratches on right fender (pictured in the gallery) and rear spoiler",
            "Curb rash on wheels",
            "2016 date codes on tires",
            "Creases on driver’s seat bolsters",
            "Some scratches and wear on cargo area plastic trim",
            "Some rust on undercarriage (pictured in the gallery)"
        ],
        "services": [],
        "included_items": [
            "2 keys",
            "Owner's manuals",
            "Window sticker",
            "Wheel lock key"
        ],
        "ownership_history": "The seller purchased this LX 570 in January 2022 and has added approximately 1,500 miles since. ",
        "auction_stats": {
            "reserve_status": "Reserve",
            "auction_status": "Sold to",
            "highest_bid_value": "$30,000",
            "auction_date": "Apr 5, 2023 10:04 PM",
            "view_count": "9,441",
            "bid_count": "41",
            "bids": [
                "$30,000",
                "$29,250",
                "$29,000",
                "$28,750",
                "$28,500",
                "$28,250",
                "$28,000",
                "$27,250",
                "$27,000",
                "$26,250",
                "$26,000",
                "$24,750",
                "$24,500",
                "$24,250",
                "$23,000",
                "$22,750",
                "$22,500",
                "$22,250",
                "$22,000",
                "$21,000",
                "$20,750",
                "$20,500",
                "$20,000",
                "$19,300",
                "$13,100",
                "$13,000",
                "$11,300",
                "$11,200",
                "$11,100",
                "$11,000",
                "$10,010",
                "$9,700",
                "$9,570",
                "$8,600",
                "$8,500",
                "$7,600",
                "$7,500",
                "$7,200",
                "$7,100",
                "$6,969",
                "$2,044"
            ]
        }
    },
    "https://carsandbids.com/auctions/rN2MXBYw/1994-cadillac-fleetwood-brougham": {
        "auction_title": "1994 Cadillac Fleetwood Brougham",
        "auction_subtitle": "NO RESERVE V8 Power, Rare Dark Green, Mostly Unmodified",
        "auction_quick_facts": {
            "Make": "Cadillac",
            "Model": "Fleetwood\nSave",
            "Mileage": "105,500",
            "VIN": "1G6DW52P1RR706168",
            "Title Status": "Clean (MD)",
            "Location": "Baltimore, MD 21210",
            "Seller": "tadw",
            "Engine": "5.7L V8",
            "Drivetrain": "Rear-wheel drive",
            "Transmission": "Automatic (4-Speed)",
            "Body Style": "Sedan",
            "Exterior Color": "Dark Green Gray Metallic",
            "Interior Color": "Tan",
            "Seller Type": "Private Party"
        },
        "dougs_take": "The final Cadillac Fleetwood is a classic American luxury car with elegant styling, a velvet-smooth ride, and a big V8 under the long hood. This particular Fleetwood looks especially nice, and it’s finished in a beautiful and uncommon Dark Green Gray exterior color. It also boasts all the things that made Cadillac famous, including a set of ultra-soft power-adjustable and heated front leather seats that look more comfortable than most living room sofas, a very 1990s digital instrument cluster, and automatic climate control. This Fleetwood also boasts a clean, accident-free Carfax report and the thrill of no reserve, further adding to the appeal.",
        "auction_highlights": [
            "The attached Carfax history report has a few gaps and stops in April 2021, but shows no accidents for the given time period.",
            "Factory equipment includes chrome lower body-side moldings, a padded roof, Twilight Sentinel, leather upholstery, power-adjustable heated front seats, a memory driver's seat, a digital instrument cluster, automatic climate control, and rear vanity mirrors. Modifications reported by the seller are limited to tinted rear windows, an Alpine head unit, and a set of Remocon key fob remotes.",
            "Cadillac released a more aerodynamic and even longer Fleetwood for 1993, and it made a 5.7-liter V8 standard. Switching to the D-Body architecture made the Fleetwood rear-wheel drive for the first time in its history as a standalone model. It's one of the last of its kind with retro luxury car characteristics like a padded roof, a hood ornament, and skirted rear wheels.",
            "Power comes from an \"LT1\" 5.7-liter V8 engine, rated at 260 horsepower and 335 lb-ft of torque. Output is sent to the rear wheels via a 4-speed automatic transmission."
        ],
        "auction_equipment": [
            "15-inch wheels",
            "Chrome lower body-side moldings",
            "Padded roof",
            "Twilight Sentinel",
            "Heated, power mirrors",
            "Leather upholstery",
            "Woodgrain interior trim",
            "Power-adjustable heated front seats",
            "Memory driver's seat",
            "Digital instrument cluster",
            "Automatic climate control",
            "Rear vanity mirrors",
            "Cargo net"
        ],
        "modifications": [
            "Tinted rear windows",
            "Alpine head unit",
            "Remocon key fob remotes"
        ],
        "known_flaws": [
            "Various scratches and chips around the exterior",
            "Paint chip with some corrosion on the hood",
            "Faded Cadillac badges, front and rear",
            "Ding in the driver-side rear door",
            "Wear on chrome belt moldings",
            "Creases in front seats",
            "Cracks in the dashboard (pictured in the photo gallery)",
            "Some rust on underbody components",
            "\"Service Engine Soon\" warning light intermittently illuminating",
            "The seller reports a clunking noise from the left front of the car during hard left turns and over a bump at the same time"
        ],
        "services": [
            "August 2019 (88,004 miles): Exhaust manifold and gasket replaced, exhaust pipe seal replaced",
            "June 2019 (83,753 miles): Fuel pressure regulator replaced, upper radiator hose replaced, distributor assembly and cap replaced, water pump gasket replaced",
            "November 2022: Front brake rotors and pads replaced, wheel bearings replaced",
            "August 2022: Four tires replaced",
            "July 2022 (101,756 miles): Engine oil and filter changed",
            "February 2021: Four shock absorbers replaced, oil cooler lines replaced",
            "June 2020: Two tie rods replaced, alignment performed",
            "October 2019: Rear differential fluid changed, oil changed",
            "August 2019: Exhaust manifold bolts replaced",
            "2019: Spark plugs and wires replaced"
        ],
        "included_items": [
            "2 sets of keys, 2 Remocon key fob remotes",
            "Owner's manual",
            "Sales brochure",
            "Build sheet",
            "Documentation pictured in the photo gallery",
            "Factory head unit",
            "Spare fender trim"
        ],
        "ownership_history": "The seller purchased this Cadillac in 2019 and has added about 23,000 miles since. The seller states that this Fleetwood was a 1-family-owned car until his purchase.",
        "auction_stats": {
            "reserve_status": "No reserve",
            "auction_status": "Sold to",
            "highest_bid_value": "$8,700",
            "auction_date": "Apr 5, 2023 9:50 PM",
            "view_count": "7,832",
            "bid_count": "38",
            "bids": [
                "$8,700",
                "$8,600",
                "$8,500",
                "$8,325",
                "$8,222",
                "$8,100",
                "$8,000",
                "$7,850",
                "$7,750",
                "$7,600",
                "$7,500",
                "$7,350",
                "$7,200",
                "$7,000",
                "$6,500",
                "$6,250",
                "$6,000",
                "$5,800",
                "$5,700",
                "$5,200",
                "$5,000",
                "$4,700",
                "$4,600",
                "$4,500",
                "$4,200",
                "$4,000",
                "$3,800",
                "$3,700",
                "$3,600",
                "$3,500",
                "$3,400",
                "$3,269",
                "$3,100",
                "$3,000",
                "$2,500",
                "$1,994",
                "$204",
                "$104"
            ]
        }
    },
    "https://carsandbids.com/auctions/KDEgjMxG/2017-mercedes-amg-gle63-s": {
        "auction_title": "2017 Mercedes-AMG GLE63 S",
        "auction_subtitle": "577-hp Twin-Turbo V8, AWD, Unmodified, California- and Florida-Owned",
        "auction_quick_facts": {
            "Make": "Mercedes-Benz",
            "Model": "GLE 63 AMG\nSave",
            "Mileage": "53,500",
            "VIN": "4JGDA7FB4HA814640",
            "Title Status": "Clean (CA)",
            "Location": "Windermere, FL 34786",
            "Seller": "Taz",
            "Engine": "5.5L Turbocharged V8",
            "Drivetrain": "4WD/AWD",
            "Transmission": "Automatic (7-Speed)",
            "Body Style": "SUV/Crossover",
            "Exterior Color": "Obsidian Black",
            "Interior Color": "Black",
            "Seller Type": "Private Party"
        },
        "dougs_take": "AMG's version of the Mercedes-Benz GLE shows how fun a performance-oriented SUV can be – it's stunningly quick thanks to a twin-turbocharged V8, it sounds awesome, and it handles better than you might think. This AMG GLE63 ticks a lot of the right boxes: it's unmodified, it features great equipment like 21-inch AMG wheels, an AMG Performance exhaust system, and a surround-view camera system, and it benefits from warm-weather California and Florida ownership since new. It's still a GLE, too – so it's spacious enough to take an entire family and a trunk full of gear on a road trip.",
        "auction_highlights": [
            "The attached Carfax history report shows no mileage discrepancies in this GLE63’s past. It also shows ownership in California and Florida since new.",
            "A build sheet is provided in the photo gallery, and a partial list of notable equipment includes 21-inch AMG multi-spoke wheels, an AMG Performance exhaust system, a panorama sunroof, leather upholstery and carbon fiber interior trim, heated, ventilated, and power-adjustable front seats, a surround-view camera system, and more as detailed below. The seller reports no modifications.",
            "Mercedes-Benz turned the third-generation ML (called W166 internally) into the first GLE for the 2016 model year. More than just a new emblem, the update brought a refreshed design, a more luxurious interior, and a wider range of available powertrains. The range-topping AMG S offered enthusiasts a twin-turbo V8 that generated nearly 30 more horsepower and 50 lb-ft over the standard AMG model.",
            "Power comes from a 5.5-liter twin-turbocharged V8, rated at 577 horsepower and 561 lb-ft of torque. Output is sent to all four wheels via a 7-speed automatic transmission and Mercedes-Benz's 4MATIC permanent all-wheel drive system."
        ],
        "auction_equipment": [
            "21-inch AMG multi-spoke wheels",
            "Air suspension system",
            "AMG Performance exhaust system",
            "GLE63-specific body kit",
            "Roof rails",
            "Panorama sunroof",
            "Leather upholstery",
            "Heated, ventilated, and power-adjustable front seats with memory function",
            "Carbon fiber interior trim",
            "Heated and cooled front cupholders",
            "3-zone climate control",
            "COMAND infotainment system",
            "Navigation system",
            "Surround-view camera",
            "Front and rear parking sensors"
        ],
        "modifications": [],
        "known_flaws": [
            "The attached Carfax history report notes that this GLE63 sustained damage to the front and right-front in December 2018 described as \"minor.\" No additional details are given, but Carfax says that \"minor damage is usually cosmetic, including dents or scratches to the vehicle body.\"",
            "Some stone chips on front end",
            "Chip in windshield (pictured in the gallery)",
            "Some curb rash on wheels",
            "Creases on front seat outer bolsters",
            "Some scratches and wear on interior trim and touch points"
        ],
        "services": [
            "February 2023 (52,236 miles): Radiator replaced",
            "February 2022 (41,548 miles): Battery charged, computer reprogrammed",
            "October 2020 (27,241 miles): Fuel filler door replaced/repaired",
            "June 2020 (26,329 miles): Charcoal/vapor canister replaced",
            "April 2020 (21,095 miles): Engine/powertrain computer/module reprogrammed",
            "January 2020 (20,836 miles): Wheel(s) repaired, front brake pads replaced",
            "November 2019 (20,448 miles): Rear brake pads replaced",
            "January 2019 (15,750 miles): Tire(s) balanced and rotated"
        ],
        "included_items": [
            "2 keys",
            "Owner's manuals",
            "Spare tire",
            "Mercedes-Benz Certified Pre-Owned Extended Limited Warranty"
        ],
        "ownership_history": "The seller purchased this GLE63 in September 2022 and has added approximately 7,200 miles since. ",
        "auction_stats": {
            "reserve_status": "Reserve",
            "auction_status": "Sold to",
            "highest_bid_value": "$43,750",
            "auction_date": "Apr 5, 2023 9:46 PM",
            "view_count": "9,373",
            "bid_count": "46",
            "bids": [
                "$43,750",
                "$43,500",
                "$43,250",
                "$43,000",
                "$42,500",
                "$42,000",
                "$41,750",
                "$41,500",
                "$41,250",
                "$41,000",
                "$40,750",
                "$40,250",
                "$40,000",
                "$39,750",
                "$39,500",
                "$39,250",
                "$39,000",
                "$38,250",
                "$38,000",
                "$37,750",
                "$37,500",
                "$37,000",
                "$36,750",
                "$35,750",
                "$35,500",
                "$35,250",
                "$35,000",
                "$33,500",
                "$33,250",
                "$32,999",
                "$29,000",
                "$26,000",
                "$25,000",
                "$23,500",
                "$22,375",
                "$22,000",
                "$14,000",
                "$13,900",
                "$13,800",
                "$13,500",
                "$11,900",
                "$11,500",
                "$9,567",
                "$9,000",
                "$7,000",
                "$6,344"
            ]
        }
    },
    "https://carsandbids.com/auctions/rkez7nAR/2012-ram-1500-express-4x4": {
        "auction_title": "2012 Ram 1500 Express 4x4",
        "auction_subtitle": "Hemi V8 Power, 4WD, Short Bed, Mostly Unmodified",
        "auction_quick_facts": {
            "Make": "Ram",
            "Model": "1500\nSave",
            "Mileage": "107,400",
            "VIN": "3C6JD7AT9CG251309",
            "Title Status": "Clean (ME)",
            "Location": "Hudson, NH 03051",
            "Seller": "NAI",
            "Engine": "5.7L V8",
            "Drivetrain": "4WD/AWD",
            "Transmission": "Automatic (6-Speed)",
            "Body Style": "Truck",
            "Exterior Color": "Flame Red",
            "Interior Color": "Gray",
            "Seller Type": "Dealer"
        },
        "dougs_take": "Now this is interesting! The Ram 1500 is a tough and capable truck in any of its numerous configurations, and it touts a handsome design that should age well. But this particular Ram is especially interesting, as it's a \"shorty\" – a single-cab, short-bed truck, which is tremendously uncommon in the full-size pickup world. To make it even more impressive, it's got the fantastic combination of a 390-horsepower Hemi V8 AND 4-wheel drive – plus some upgrades like a nice set of 17-inch American Racing wheels and aftermarket fender flares for some extra visual punch. This Ram is also offered with a clean, accident-free Carfax report by an excellent dealership for added peace of mind.",
        "auction_highlights": [
            "The attached Carfax history report indicates no accidents or mileage discrepancies.",
            "Equipment includes heavy-duty shock absorbers, a towing receiver with 7-pin plug, a trailer brake controller, cloth upholstery, cruise control, power windows, locks, and mirrors, keyless entry, and an AM/FM/CD stereo. Modifications reported by the selling dealer are limited to a set of 17-inch American Racing wheels, aftermarket fender flares, and a set of window rain guards.",
            "Dodge launched the fourth-generation Ram for 2009 and lost the truck the following model year when Ram became a standalone brand. Available in numerous configurations, the pickup offered a more SUV-like cabin with a longer list of features and a more comfortable ride, though it remained built for durability and towing.",
            "Power comes from a 5.7-liter V8 engine, which produces 390 horsepower and 407 lb-ft of torque. Output is sent to the rear or all four wheels through a 6-speed automatic transmission and a 2-speed transfer case."
        ],
        "auction_equipment": [
            "Heavy-duty shock absorbers",
            "Towing receiver with 7-pin plug",
            "Trailer brake controller",
            "Cloth upholstery",
            "Cruise control",
            "Power windows, locks, and mirrors",
            "Keyless entry",
            "AM/FM/CD stereo"
        ],
        "modifications": [
            "17-inch American Racing wheels",
            "Aftermarket fender flares",
            "Window rain guards"
        ],
        "known_flaws": [
            "Some stone chips on front end",
            "Some scratches around the exterior",
            "Worn paint on left-rear wheel",
            "Tires carry 2017 date codes",
            "Drill holes on driver's side lower dash",
            "Some rust on underbody"
        ],
        "services": [
            "March 2023 (107,280 miles): Engine oil and filter changed, camshaft, lifters, head bolts, head gasket, water pump, thermostat, and timing cover and valve cover gaskets replaced",
            "October 2018 (73,588 miles): Maintenance inspection completed",
            "August 2018 (71,823 miles): Vehicle serviced, maintenance inspection completed, tire(s) replaced, engine oil and filter changed, body lubricated",
            "February 2018 (67,728 miles): Vehicle serviced, wheel bearing(s)/hub(s) replaced"
        ],
        "included_items": [
            "2 key fobs, 2 valet keys",
            "Owner's manuals",
            "WeatherTech floor mats"
        ],
        "ownership_history": "The selling dealer states that they recently acquired this Ram.",
        "auction_stats": {
            "reserve_status": "Reserve",
            "auction_status": "Reserve not met, bid to",
            "highest_bid_value": "$13,300",
            "auction_date": "Apr 5, 2023 9:45 PM",
            "view_count": "7,101",
            "bid_count": "45",
            "bids": [
                "$13,300",
                "$13,200",
                "$13,100",
                "$13,000",
                "$12,900",
                "$12,800",
                "$12,700",
                "$12,600",
                "$12,450",
                "$12,350",
                "$12,250",
                "$12,000",
                "$11,777",
                "$11,450",
                "$11,350",
                "$11,222",
                "$11,100",
                "$11,000",
                "$10,900",
                "$10,800",
                "$10,700",
                "$10,600",
                "$10,500",
                "$10,400",
                "$10,200",
                "$10,000",
                "$9,669",
                "$9,509",
                "$9,400",
                "$9,100",
                "$9,000",
                "$7,543",
                "$7,350",
                "$7,250",
                "$6,853",
                "$6,753",
                "$6,600",
                "$6,500",
                "$4,201",
                "$4,011",
                "$3,911",
                "$3,777",
                "$3,666",
                "$2,500",
                "$444"
            ]
        }
    },
    "https://carsandbids.com/auctions/35X6VpQZ/2004-bmw-m3-convertible": {
        "auction_title": "2004 BMW M3 Convertible",
        "auction_subtitle": "NO RESERVE 6-Speed Manual, Mystic Blue Metallic, 1 Owner Since 2006",
        "auction_quick_facts": {
            "Make": "BMW",
            "Model": "M3\nSave",
            "Mileage": "124,600",
            "VIN": "WBSBR93484PK06349",
            "Title Status": "Clean (IN)",
            "Location": "Indianapolis, IN 46260",
            "Seller": "E46guy",
            "Engine": "3.2L I6",
            "Drivetrain": "Rear-wheel drive",
            "Transmission": "Manual (6-Speed)",
            "Body Style": "Convertible",
            "Exterior Color": "Mystic Blue Metallic",
            "Interior Color": "Grey",
            "Seller Type": "Private Party"
        },
        "dougs_take": "The E46 BMW M3 is a performance icon thanks to its fantastic handling, beautiful styling, and a potent S54 6-cylinder engine. This particular M3 is a convertible model that's finished in gorgeous Mystic Blue Metallic, and it's equipped with the desirable 6-speed manual transmission. It also benefits from being mostly unmodified, long-term current ownership, and a clean, accident-free Carfax report – plus, it's offered with no reserve, so someone is taking home this M3 at the end of the auction.",
        "auction_highlights": [
            "This M3 features the desirable 6-speed manual transmission.",
            "The attached Carfax history report shows no accidents or mileage discrepancies in this M3’s past. It also shows that it's been registered to the current owner since 2006.",
            "According to the window sticker pictured in the photo gallery, this M3 had an original MSRP of $63,745 and came equipped with the Cold Weather Package, 19-inch alloy wheels, a blue power-operated soft top, leather upholstery and aluminum interior trim, a Harman/Kardon sound system, a navigation system, and more as detailed below. Modifications reported by the seller are limited to Pirelli Sottozero 3 winter tires, a Moroso coolant expansion tank, a Moroso coolant level sensor, and ECS Tuning heavy duty convertible rear shock mount reinforcement plates.",
            "The third-generation M3 made its debut for the 2000 model year as the quickest and most powerful evolution of the E46 3 Series. Offered as a coupe and as a convertible, it received a high-revving straight-6 engine, suspension improvements, and a muscular-looking exterior design. Production ended in 2006.",
            "Power comes from an S54 3.2-liter inline-6, rated at 333 horsepower and 262 lb-ft of torque. Output is sent to the rear wheels via a 6-speed manual transmission."
        ],
        "auction_equipment": [
            "Cold Weather Package (heated front seats, retractable headlight washers, ski bag)",
            "19-inch alloy wheels",
            "Xenon headlights",
            "Power-operated soft top",
            "Leather upholstery",
            "Aluminum interior trim",
            "Power-adjustable front seats",
            "Automatic climate control",
            "Harman/Kardon sound system",
            "Navigation system",
            "Cruise control"
        ],
        "modifications": [
            "Pirelli Sottozero 3 winter tires",
            "Moroso expansion tank and coolant level sensor",
            "ECS Tuning heavy duty convertible rear shock mount reinforcement plates"
        ],
        "known_flaws": [
            "Stone chips on front end",
            "Wear on wheel center caps (pictured in the gallery)",
            "Some creases and wear on driver’s seat bolsters",
            "Some scratches and wear on interior plastic trim and touch points",
            "Rear-view mirror discolored (pictured in the gallery)",
            "Discoloration on driver's floor mat",
            "Some rust on undercarriage fasteners and brackets"
        ],
        "services": [
            "February 2023 (124,424 miles): Hood badge replaced",
            "February 2023 (124,309 miles): Fuel door lock actuator and buffer stop with ejector replaced",
            "November 2022 (123,992 miles): Engine oil and filter changed, battery and front kidney grille insert replaced",
            "October 2022 (123,687 miles): Wheels refinished, driver-side tires replaced",
            "May 2022 (122,850 miles): High pressure power steering line, oil pan gasket, rear shocks, and rear shock tower plates replaced, ECS Tuning heavy duty convertible rear shock mount reinforcement plates installed, rear subframe inspected",
            "April 2022 (121,904 miles): Front kidney grille insert replaced",
            "April 2022 (121,838 miles): Engine oil and filter changed",
            "January 2022 (120,828 miles): Dr. VANOS upgraded assembly, Moroso coolant expansion tank, and Moroso coolant level installed, valve cover gaskets, valve cover nut seals, spark plug tube, and VANOS line replaced",
            "October 2021 (119,147 miles): Master power window switch assembly replaced",
            "July 2021 (119,370 miles): Brake pressure sensor replaced",
            "November 2020 (117,189 miles): Spark plugs, oil level sensor, and thermostat replaced",
            "November 2020 (116,704 miles): Front passenger airbag assembly replaced",
            "September 2020 (115,796 miles): Front strut assemblies replaced, brake fluid flushed",
            "September 2020 (112,937 miles): Engine oil and filter changed",
            "April 2019 (107,689 miles): Rear springs replaced",
            "April 2019 (107,415 miles): Wiper blades replaced",
            "September 2018 (104,678 miles): Brake pressure sensor, water pump, and thermostat replaced",
            "August 2018 (104,300 miles): CD player and monitor module replaced",
            "May 2018 (103,948 miles): Brake discs, pads, and sensors, spark plugs, and engine and cabin air filters replaced, brake and transmission fluids flushed, engine oil and filter changed"
        ],
        "included_items": [
            "2 keys",
            "Owner's manuals",
            "Window sticker",
            "Available service records"
        ],
        "ownership_history": "The seller purchased this M3 in March 2006 with about 8,700 miles on it.",
        "auction_stats": {
            "reserve_status": "No reserve",
            "auction_status": "Sold to",
            "highest_bid_value": "$16,750",
            "auction_date": "Apr 5, 2023 9:31 PM",
            "view_count": "11,181",
            "bid_count": "43",
            "bids": [
                "$16,750",
                "$16,500",
                "$16,250",
                "$16,000",
                "$15,750",
                "$15,500",
                "$15,250",
                "$15,000",
                "$14,800",
                "$14,700",
                "$14,600",
                "$14,500",
                "$14,250",
                "$14,000",
                "$13,100",
                "$13,000",
                "$12,100",
                "$12,000",
                "$11,000",
                "$10,546",
                "$10,146",
                "$10,046",
                "$8,800",
                "$8,700",
                "$8,600",
                "$8,500",
                "$6,900",
                "$6,700",
                "$6,200",
                "$6,100",
                "$6,000",
                "$5,756",
                "$5,656",
                "$5,500",
                "$5,300",
                "$5,200",
                "$5,000",
                "$4,600",
                "$4,500",
                "$3,250",
                "$3,144",
                "$3,044",
                "$200"
            ]
        }
    },
    "https://carsandbids.com/auctions/3RqBkdmq/2019-mini-cooper-s": {
        "auction_title": "2019 Mini Cooper S",
        "auction_subtitle": "6-Speed Manual, Malt Brown Interior, Some Modifications",
        "auction_quick_facts": {
            "Make": "MINI",
            "Model": "Cooper\nSave",
            "Mileage": "42,500",
            "VIN": "WMWXP7C54K2H60871",
            "Title Status": "Clean (CO)",
            "Location": "Littleton, CO 80123",
            "Seller": "TFarris",
            "Engine": "2.0L Turbocharged I4",
            "Drivetrain": "Front-wheel drive",
            "Transmission": "Manual (6-Speed)",
            "Body Style": "Hatchback",
            "Exterior Color": "White Silver Metallic",
            "Interior Color": "Malt Brown",
            "Seller Type": "Private Party"
        },
        "dougs_take": "The F56 Mini Cooper boasts a heritage-laced design, a nice interior, and engaging handling – and it's more spacious inside than you might imagine! This is the 189-horsepower Cooper S model, and it's finished in a gorgeous White Silver Metallic over Malt Brown color combination. It also touts a 6-speed manual transmission for maximum driving enjoyment, and it features some nice equipment like Chesterfield leather upholstery, heated front seats, Park Distance Control, and a navigation system – plus, it's equipped with a desirable Neuspeed NM Engineering exhaust system and an aftermarket cold air intake. This is a great looking Mini Cooper S, and I'm sure it will provide a lot of fun for the next owner.",
        "auction_highlights": [
            "The attached Carfax history report lists no mileage inconsistencies in this car's past.",
            "Factory equipment includes LED headlights, fog lights, a sunroof, a roof panel finished in black, Chesterfield leather upholstery, heated front seats, a leather-wrapped sport steering wheel, automatic climate control, Park Distance Control (PDC), and a navigation system, among others listed below.",
            "Modifications reported by the seller include 18-inch wheels, front brake calipers painted yellow, a Neuspeed NM Engineering downpipe-back exhaust system, an aftermarket cold air intake, and tinted windows.",
            "Mini's retro-styled Hardtop grew up as it entered its third generation for 2014. Called F56 internally, it was bigger than its predecessor in every dimension and correspondingly more spacious inside. It gained new engines across the board, and it remains available in two- and four-door configurations.",
            "Power comes from a 2.0-liter turbocharged 4-cylinder engine, rated at 189 horsepower and 207 lb-ft of torque. This engine may be making more power as a result of the modifications, though a dyno sheet is not included. It spins the front wheels via a 6-speed manual transmission."
        ],
        "auction_equipment": [
            "LED headlights",
            "Fog lights",
            "Rain-sensing windshield wipers",
            "Power-operated sunroof",
            "Mirror caps finished in black",
            "Roof panel finished in black",
            "Chesterfield leather upholstery",
            "Heated front seats",
            "Leather-wrapped sport steering wheel",
            "Automatic climate control",
            "Comfort Access keyless entry",
            "Park Distance Control (PDC), rear",
            "Harman/Kardon sound system",
            "Navigation system",
            "Apple CarPlay capabilities"
        ],
        "modifications": [
            "18-inch wheels",
            "Front brake calipers painted yellow",
            "Tinted windows",
            "Neuspeed NM Engineering downpipe-back exhaust system",
            "Aftermarket cold air intake"
        ],
        "known_flaws": [
            "The attached Carfax history report indicates that this Mini Cooper S sustained \"minor damage\" to the rear after an accident involving a front or rear impact in June 2020. The report notes that the airbags did not deploy.",
            "Some rock chips on hood and front bumper",
            "Ding on driver's side front left fender",
            "Scratches on rear bumper",
            "Scratches on wheels"
        ],
        "services": [
            "February 2023: Windshield replaced",
            "May 2022 (36,526 miles): Engine checked and oil and filter changed",
            "November 2021 (34,462 miles): Brake fluid flushed/changed, four wheel alignment performed",
            "March 2021 (30,714 miles): Oil and filter changed, intake silencer serviced, cabin air filter replaced/cleaned, antifreeze/coolant flushed/changed",
            "October 2020 (28,987 miles): Oil and filter changed",
            "May 2020 (22,609 miles): Tire condition and pressure checked, oil and filter changed, front wiper blades/refills replaced, wiper(s) replaced, rear wiper blade replaced"
        ],
        "included_items": [
            "2 keys",
            "Owner's manual"
        ],
        "ownership_history": "The seller purchased this Cooper S in November 2020 and has added approximately 18,300 miles since.",
        "auction_stats": {
            "reserve_status": "Reserve",
            "auction_status": "Reserve not met, bid to",
            "highest_bid_value": "$16,600",
            "auction_date": "Apr 5, 2023 9:20 PM",
            "view_count": "6,127",
            "bid_count": "29",
            "bids": [
                "$16,600",
                "$16,350",
                "$16,100",
                "$15,850",
                "$15,500",
                "$15,250",
                "$15,000",
                "$14,047",
                "$13,750",
                "$13,247",
                "$13,100",
                "$13,000",
                "$10,700",
                "$10,600",
                "$10,500",
                "$10,400",
                "$10,300",
                "$10,200",
                "$10,100",
                "$10,000",
                "$9,400",
                "$9,200",
                "$9,100",
                "$9,000",
                "$8,300",
                "$8,200",
                "$8,100",
                "$8,000",
                "$7,777"
            ]
        }
    },
    "https://carsandbids.com/auctions/Km2gdywN/2016-bmw-m4-coupe": {
        "auction_title": "2016 BMW M4 Coupe",
        "auction_subtitle": "425-hp 6-Cylinder, Executive Package, Yas Marina Blue with Satin Black Exterior Wrap",
        "auction_quick_facts": {
            "Make": "BMW",
            "Model": "M4\nSave",
            "Mileage": "44,500",
            "VIN": "WBS3R9C5XGK337409",
            "Title Status": "Clean (NY)",
            "Location": "Middle Island, NY 11953",
            "Seller": "snaqvi666",
            "Engine": "3.0L Turbocharged I6",
            "Drivetrain": "Rear-wheel drive",
            "Transmission": "Automatic (7-Speed)",
            "Body Style": "Coupe",
            "Exterior Color": "Yas Marina Blue Metallic",
            "Interior Color": "Black",
            "Seller Type": "Private Party"
        },
        "dougs_take": "The F82 BMW M4 is an impressive performance car that boasts great styling, modern technology, and big power from its twin-turbocharged 6-cylinder engine. This particular M4 offers some great benefits, including the Executive and Driver Assistance Plus packages, adaptive M suspension, and a stunning Yas Marina Blue Metallic finish under the Satin Black exterior wrap. It also touts cool carbon fiber components inside and out, which are a nice touch – and it boasts no major modifications, for added peace of mind.",
        "auction_highlights": [
            "The attached Carfax history report shows no mileage discrepancies in this M4's past.",
            "According to the build sheet provided in the gallery, factory equipment includes the Executive and Driver Assistance Plus packages, 19-inch Style 437M wheels, adaptive M suspension, Shadowline exterior trim, adaptive LED headlights, Merino leather upholstery, power-adjustable and heated front seats, carbon fiber interior trim, a Harman/Kardon surround sound system, a navigation system, and more as detailed below.",
            "The full list of modifications reported by the seller is detailed below. Highlights include a Satin Black vinyl wrap, carbon fiber front bumper spoilers, carbon fiber mirror caps, a carbon fiber rear diffuser, a carbon fiber trunk lid spoiler, and aftermarket exhaust tips.",
            "2015 was the first model year for the M4, which took the torch from the two-door M3. BMW surfed the downsizing wave sweeping across the industry by replacing the naturally-aspirated V8 with a twin-turbocharged straight-6, and a significant torque increase accompanied the new engine. Chopping off two cylinders and replacing metal bits with carbon fiber components allowed BMW to make the M4 up to 176 pounds lighter than the M3 it replaced. Production ended in 2020.",
            "Power comes from an \"S55\" 3.0-liter turbocharged straight-6, rated at 425 horsepower and 406 lb-ft of torque. Output is sent to the rear wheels via a 7-speed M double-clutch automatic transmission."
        ],
        "auction_equipment": [
            "Executive Package (heated steering wheel, rearview camera, retractable headlight washers, Park Distance Control, head-up display)",
            "Driver Assistance Plus (active blind spot detection, active driving assistant, side and top view cameras)",
            "19-inch Style 437M wheels",
            "Adaptive M suspension",
            "Shadowline exterior trim",
            "Adaptive LED headlights",
            "Power sunroof",
            "Merino leather upholstery",
            "Power-adjustable and heated front seats",
            "Carbon fiber interior trim",
            "Carbon fiber gear selector",
            "Comfort Access keyless entry",
            "Harman/Kardon surround sound system",
            "Navigation system"
        ],
        "modifications": [
            "Satin Black vinyl wrap",
            "Carbon fiber front bumper spoilers",
            "Carbon fiber mirror caps",
            "Carbon fiber rear diffuser",
            "Carbon fiber trunk lid spoiler",
            "Aftermarket exhaust tips",
            "Black-painted rear \"M4\" badge",
            "Blue engine start/stop button",
            "Tinted windows"
        ],
        "known_flaws": [
            "The attached Carfax history report indicates that this M4 sustained \"minor damage\" to the rear in January 2020. A True360 inspection report from October 2020 notes that the rear bumper cover was refinished.",
            "Chips and scratches on the exterior wrap (pictured in the gallery)",
            "Scratches under the front bumper",
            "Some creases on front seats"
        ],
        "services": [
            "February 2022 (36,363 miles): Tire(s) replaced",
            "February 2020 (27,220 miles): Engine oil and filter changed",
            "September 2019 (24,683 miles): Steering damper, radiator, and spark plugs replaced",
            "July 2019: Windshield and wheel ceramic coating applied"
        ],
        "included_items": [
            "2 keys",
            "Owner's manual",
            "Factory rear diffuser"
        ],
        "ownership_history": "The seller acquired this M4 in June 2021 and has added approximately 16,000 miles since.",
        "auction_stats": {
            "reserve_status": "Reserve",
            "auction_status": "Sold to",
            "highest_bid_value": "$43,000",
            "auction_date": "Apr 5, 2023 9:14 PM",
            "view_count": "13,564",
            "bid_count": "53",
            "bids": [
                "$43,000",
                "$42,000",
                "$41,750",
                "$41,500",
                "$41,250",
                "$41,000",
                "$40,750",
                "$40,500",
                "$40,250",
                "$40,000",
                "$39,250",
                "$39,000",
                "$38,750",
                "$38,500",
                "$38,250",
                "$38,000",
                "$36,750",
                "$36,500",
                "$36,250",
                "$36,000",
                "$35,750",
                "$35,500",
                "$35,250",
                "$35,000",
                "$34,750",
                "$34,500",
                "$32,000",
                "$31,250",
                "$31,000",
                "$30,000",
                "$28,000",
                "$26,500",
                "$25,000",
                "$23,000",
                "$22,500",
                "$22,000",
                "$21,000",
                "$20,250",
                "$20,000",
                "$19,500",
                "$19,000",
                "$18,000",
                "$17,000",
                "$16,750",
                "$16,500",
                "$16,250",
                "$16,000",
                "$15,750",
                "$15,500",
                "$15,000",
                "$10,250",
                "$10,044",
                "$100"
            ]
        }
    },
    "https://carsandbids.com/auctions/Kd6Jwexy/1984-mazda-rx-7-gsl": {
        "auction_title": "1984 Mazda RX-7 GSL",
        "auction_subtitle": "NO RESERVE ~44,900 Miles, Rotary Power, Unmodified, Recent Service",
        "auction_quick_facts": {
            "Make": "Mazda",
            "Model": "RX-7\nSave",
            "Mileage": "44,900",
            "VIN": "JM1FB3318E0833448",
            "Title Status": "Clean (MO)",
            "Location": "Springfield, MO 65809",
            "Seller": "itisgar",
            "Engine": "1.1L Rotary",
            "Drivetrain": "Rear-wheel drive",
            "Transmission": "Automatic (4-Speed)",
            "Body Style": "Coupe",
            "Exterior Color": "Dover White",
            "Interior Color": "Wine",
            "Seller Type": "Private Party"
        },
        "dougs_take": "The FB Mazda RX-7 is an iconic 1980s sports car with a distinctive look and a unique rotary powertrain, and well-kept ones like this example are becoming difficult to find. This RX-7 is a true rarity, as it touts no modifications and only 44,900 miles from new. It also benefits from some cool luxuries like a removable sunroof, cruise control, and an AM/FM/cassette radio with 9-band equalizer – and its Wine leather interior looks fantastic against the Dover White paint. To top it off, this RX-7 comes with a clean, accident-free Carfax report, for added peace of mind – AND it's offered with the thrill of no reserve!",
        "auction_highlights": [
            "The odometer on this RX-7 currently displays approximately 44,900 miles.",
            "The attached Carfax history report contains several gaps, though it shows no accidents in the given period.",
            "Factory equipment includes 13-inch wheels, a limited-slip differential, a rear wiper, a removable sunroof, leather upholstery, air conditioning, and cruise control. The seller reports no modifications.",
            "The first-generation RX-7 won the hearts of enthusiasts everywhere with its superb driving experience, thanks largely to a smooth-revving rotary, quick steering rack, and 50/50 weight balance. It may have lagged behind other period Japanese sports coupes in terms of power, but the iconic coupe gained a strong and loyal following that continues to this day.",
            "Power comes from a 1.1-liter twin-rotor rotary engine, rated at approximately 101 horsepower and 107 lb-ft of torque. Output is sent to the rear wheels via a 4-speed automatic transmission."
        ],
        "auction_equipment": [
            "13-inch wheels",
            "Limited-slip differential",
            "Pop-up headlights",
            "Rear wiper",
            "Removable sunroof",
            "Leather upholstery",
            "Power windows, locks, and mirrors",
            "Air conditioning",
            "Cruise control",
            "AM/FM/cassette stereo with 9-band equalizer"
        ],
        "modifications": [],
        "known_flaws": [
            "Scratches, chips, and dings around the exterior",
            "One exhaust tip is missing",
            "Weathered exterior trim and finish on wheels",
            "Windshield wipers are inoperative",
            "Creases and wear on seats",
            "Wear on interior touch points",
            "Passenger's window does not fully open",
            "Some rust on underbody and engine bay components",
            "The seller notes that when driving, the drivetrain feels rough momentarily after the accelerator pedal is released."
        ],
        "services": [
            "October 2021: Fuel tank lining installed",
            "June 2021: Carburetor rebuilt",
            "May 2021: Fuel hoses replaced",
            "April 2021: Engine oil and filter changed, tires and fusible links replaced"
        ],
        "included_items": [
            "3 keys",
            "Sunroof panel cover"
        ],
        "ownership_history": "The seller purchased this RX-7 in April 2021 and has added approximately 500 miles since.",
        "auction_stats": {
            "reserve_status": "No reserve",
            "auction_status": "Sold to",
            "highest_bid_value": "$6,500",
            "auction_date": "Apr 5, 2023 9:09 PM",
            "view_count": "11,428",
            "bid_count": "39",
            "bids": [
                "$6,500",
                "$6,400",
                "$6,300",
                "$6,200",
                "$6,100",
                "$6,000",
                "$5,800",
                "$5,700",
                "$5,600",
                "$5,500",
                "$5,400",
                "$5,300",
                "$5,200",
                "$5,100",
                "$4,800",
                "$4,700",
                "$4,600",
                "$4,500",
                "$4,400",
                "$4,300",
                "$4,195",
                "$3,200",
                "$2,969",
                "$2,800",
                "$2,700",
                "$2,600",
                "$2,500",
                "$2,100",
                "$2,000",
                "$1,900",
                "$1,800",
                "$1,700",
                "$1,500",
                "$1,200",
                "$900",
                "$789",
                "$600",
                "$500",
                "$244"
            ]
        }
    },
    "https://carsandbids.com/auctions/K1MmO0G4/2016-toyota-tacoma-trd-off-road-access-cab-4x4": {
        "auction_title": "2016 Toyota Tacoma TRD Off-Road Access Cab 4x4",
        "auction_subtitle": "1 Owner, 4WD, Extensive Off-Road Modifications, California-Owned",
        "auction_quick_facts": {
            "Make": "Toyota",
            "Model": "Tacoma\nSave",
            "Mileage": "80,300",
            "VIN": "5TFSZ5AN3GX025529",
            "Title Status": "Clean (CA)",
            "Location": "Palm Desert, CA 92211",
            "Seller": "TacomaOverland",
            "Engine": "3.5L V6",
            "Drivetrain": "4WD/AWD",
            "Transmission": "Automatic (6-Speed)",
            "Body Style": "Truck",
            "Exterior Color": "Magnetic Gray Metallic",
            "Interior Color": "Graphite",
            "Seller Type": "Private Party"
        },
        "dougs_take": "The Toyota Tacoma is a great truck that's stunningly reliable and remarkably capable off the beaten path – and it's just the right size. This particular Tacoma touts 4-wheel drive, and it features a LONG list of desirable upgrades intended to improve its already excellent off-road capabilities – including 17-inch Method Race wheels, an ICON Stage 7 suspension system, a custom-fabricated front bumper, a WARN winch, Baja Designs and Rigid Industries exterior lighting, and much more. This Tacoma is also offered with a clean, accident-free Carfax report that shows single ownership in dry-climate Southern California from new, which should provide valuable peace of mind to the next owner.",
        "auction_highlights": [
            "The attached Carfax history report shows no accidents or mileage discrepancies in this Tacoma’s past. It also shows that it's been registered in California to one owner since new.",
            "According to the window sticker pictured in the photo gallery, this Tacoma had an original MSRP of $34,709 and came equipped with the V6 Tow Package, a locking rear differential, a 6-foot bed, cloth upholstery, folding rear jump seats, and more as detailed below.",
            "Modifications to this Tacoma are extensive, and the full list is detailed below. Highlights include 17-inch Method Race wheels with Falken WILDPEAK A/T3W tires, an ICON Stage 7 suspension system, a custom-fabricated front bumper by Corey Sain of InSain Fabrication, a WARN Zeon 10-S winch with synthetic cable and and Factor 55 FlatLink, a bed rack with a Cascadia Vehicle Tents (CVT) rooftop tent, and Baja Designs and Rigid Industries exterior lighting.",
            "Introduced in 2015, the third-generation Tacoma came equipped with an optional Atkinson cycle V6 engine utilizing Variable Valve Timing with intelligence (VVT-i), which replaced Toyota's previous VVT system. The third-generation \"Taco\" also featured updated styling, a more comfortable interior, and a more rigid high-strength steel frame.",
            "Power comes from a 3.5-liter V6, rated at 278 horsepower and 265 lb-ft of torque. Output is sent to the rear or all four wheels via a 6-speed automatic transmission and Toyota's 4WDemand part-time four-wheel-drive system with a 2-speed transfer case."
        ],
        "auction_equipment": [
            "V6 Tow Package (Class IV towing receiver hitch, ATF cooler, engine oil cooler, power steering cooler, 130-amp alternator, 4- and 7-pin connector with converter, Trailer Sway Control)",
            "4WDemand part-time 4WD with 2-speed transfer case",
            "Locking rear differential",
            "Multi-Terrain Select Crawl Control",
            "Hill start assist control",
            "6-foot bed",
            "Cloth upholstery",
            "Folding rear jump seats",
            "7-inch touchscreen infotainment system",
            "Navigation system",
            "Entune premium audio system",
            "Push button start",
            "Air conditioning",
            "Wireless smartphone charging pad",
            "Back-up camera"
        ],
        "modifications": [
            "17-inch Method Race wheels (full-size spare wheel and tire included)",
            "Falken WILDPEAK A/T3W tires (size 285/70 R17)",
            "ICON Stage 7 suspension system with upper A arms",
            "ICON Air Bump 2.5 for rear axle",
            "Deaver U402 Stage 2 leaf springs",
            "Sprint Booster V3",
            "Tekonsha trailer brake controller",
            "Custom-fabricated front bumper by Corey Sain of InSain Fabrication",
            "Rigid Industries front grille",
            "WARN Zeon 10-S winch with synthetic cable and and Factor 55 FlatLink",
            "RCI Metalworks rock sliders",
            "RCI Metalworks front and mid skid plates",
            "Bed rack",
            "Cascadia Vehicle Tents (CVT) rooftop tent with awning and floor",
            "LED lighting and power system for rooftop tent",
            "Factor 55 Hawse Fairleads 1.5",
            "Factor 55 rear HitchLink 2.0",
            "Firestik 5-foot antenna",
            "Morimoto XB LED headlights",
            "20-inch front grille-mounted light bar",
            "Baja Designs 30-inch S8 Series front bumper light bar",
            "Baja Designs Squadron Pro amber front fog lights",
            "Rigid Industries D Series LED flood lights under front bumper and mounted on bed",
            "Rigid Industries SR-Q PRO LED lights under rear bumper (wired to reverse lights)",
            "Baja Designs RTL 30-inch LED rear light bar (wired to brake, reverse, and turn signal lights)",
            "Red LED rear brake lights",
            "Amber rear turn signal lights",
            "Kenwood dual-band ham radio",
            "Hondo Garage custom iPad Mini mount (iPad Mini not included with sale)",
            "Bed-mounted Hi-Lift Jack with adapter for RCI Metalworks rock sliders",
            "Bed-mounted Pro Eagle off-road jack",
            "Bed-mounted shovel and Fiskars axe",
            "Bed rack-mounted MAXTRAX recovery boards",
            "Fire extinguisher brackets inside bed and on bed rack (fire extinguishers not included with sale)",
            "10-pound Power Tank bed rack mount (Power Tank not included with sale)",
            "Fishing pole bed rack mounts (fishing poles not included with sale)"
        ],
        "known_flaws": [
            "Stone chips on front and rear end",
            "Dent in top of tailgate (pictured in the gallery)",
            "Creases on driver’s seat bolsters",
            "Some scratches on interior plastic trim and touch points"
        ],
        "services": [
            "October 2022 (76,431 miles): 75,000-mile service performed",
            "March 2022 (66,357 miles): 70,000-mile service performed, engine oil and filter changed, tires rotated",
            "July 2021 (60,685 miles): 60,000-mile service performed, engine oil and filter changed, tires rotated",
            "August 2020 (55,209 miles): 55,000-mile service performed, tires rotated",
            "August 2019 (50,109 miles): 50,000-mile service performed, engine oil and filter changed, tires rotated, propeller shaft lubricated",
            "May 2019 (45,002 miles): 45,000-mile service performed, tires rotated, propeller shaft lubricated",
            "February 2019 (40,113 miles): 40,000-mile service performed",
            "November 2018 (35,048 miles): 35,000-mile service performed, tires rotated, propeller shaft lubricated",
            "August 2018 (29,983 miles): 30,000-mile service performed, engine oil and filter changed, engine air filter replaced, tires rotated, propeller shaft lubricated",
            "May 2018 (25,042 miles): 25,000-mile service performed, tires rotated, propeller shaft lubricated",
            "October 2022 (76,433 miles): Brake fluid flushed/changed, wiper(s) replaced, engine oil and filter changed, tires rotated, throttle body cleaned/serviced, cabin air filter replaced/cleaned",
            "August 2020 (55,209 miles): Front driveshaft replaced",
            "August 2019 (50,110 miles): Engine air filter replaced, cabin air filter replaced/cleaned",
            "April 2019: Windshield replaced",
            "February 2019 (40,114 miles): Front brake pads replaced"
        ],
        "included_items": [
            "1 key",
            "Owner's manuals",
            "Window sticker",
            "Toyota service booklet",
            "Full-size spare tire",
            "CVT rooftop tent covers (1 light and 1 medium)"
        ],
        "ownership_history": "The seller purchased this Tacoma new in April 2016.",
        "auction_stats": {
            "reserve_status": "Reserve",
            "auction_status": "Sold to",
            "highest_bid_value": "$34,500",
            "auction_date": "Apr 5, 2023 8:57 PM",
            "view_count": "9,255",
            "bid_count": "48",
            "bids": [
                "$34,500",
                "$34,000",
                "$33,000",
                "$32,000",
                "$31,000",
                "$30,000",
                "$29,250",
                "$29,000",
                "$28,500",
                "$28,250",
                "$28,000",
                "$27,750",
                "$27,500",
                "$27,250",
                "$27,000",
                "$26,500",
                "$26,250",
                "$26,000",
                "$25,750",
                "$24,500",
                "$24,250",
                "$24,000",
                "$23,000",
                "$22,750",
                "$22,500",
                "$21,000",
                "$20,500",
                "$17,500",
                "$17,237",
                "$16,987",
                "$16,666",
                "$15,555",
                "$15,250",
                "$15,000",
                "$12,345",
                "$11,100",
                "$11,000",
                "$10,500",
                "$10,400",
                "$10,300",
                "$10,200",
                "$10,100",
                "$10,000",
                "$9,700",
                "$9,600",
                "$9,500",
                "$8,420",
                "$7,500"
            ]
        }
    },
    "https://carsandbids.com/auctions/rw0P7o4X/2004-mitsubishi-lancer-evolution-viii": {
        "auction_title": "2004 Mitsubishi Lancer Evolution VIII",
        "auction_subtitle": "1 Owner, 5-Speed Manual, AWD, Extensive Modifications",
        "auction_quick_facts": {
            "Make": "Mitsubishi",
            "Model": "Lancer Evolution\nSave",
            "Mileage": "95,200",
            "VIN": "JA3AH86D34U066724",
            "Title Status": "Clean (MD)",
            "Location": "Elkridge, MD 21075",
            "Seller": "evo12",
            "Engine": "2.0L Turbocharged I4",
            "Drivetrain": "4WD/AWD",
            "Transmission": "Manual (5-Speed)",
            "Body Style": "Sedan",
            "Exterior Color": "Apex Silver Metallic",
            "Interior Color": "Black",
            "Seller Type": "Private Party"
        },
        "dougs_take": "The Mitsubishi Lancer Evolution VIII is a rally-bred performance sedan that offers a thrilling analog driving experience – thanks to its clever all-wheel drive system, a 5-speed manual transmission, and a powerful turbocharged 4-cylinder engine. This particular Evo VIII touts a one-owner history and a long list of great modifications intended to boost its performance – including a Lancer Evolution IX turbocharger, TEIN coilovers, and extensive use of carbon fiber inside and out. In addition, this Evo keeps desirable factory equipment like Brembo brakes and Recaro bucket seats, which is a great benefit that adds to the appeal.",
        "auction_highlights": [
            "This Evolution VIII is equipped with a 5-speed manual transmission.",
            "The attached Carfax history report shows no mileage discrepancies; it also shows that this Evolution VIII has been registered to one owner since new.",
            "According to the build sheet provided in the gallery, factory equipment includes Brembo brakes, a power sunroof, Recaro front bucket seats, air conditioning, and a 7-speaker Infinity sound system.",
            "Modifications to this Evolution VIII are extensive, and the full list reported by the seller is detailed below. Highlights include a Lancer Evolution IX turbocharger, an HKS twin disc ceramic clutch kit, a Fabspeed exhaust system, carbon fiber fenders, a carbon fiber rear wing, TEIN coilovers, a TEIN EDFC controller, carbon fiber door panels, and a Defi-Link Display VSD Concept.",
            "Mitsubishi launched the Lancer Evolution VIII for the 2003 model year. While the rally-bred sedan was already a legend in enthusiast circles around the world, this was the first time that it was officially sold in the United States. It received a powerful turbocharged engine, permanent all-wheel-drive, aluminum components to keep weight in check, and a look that drew inspiration from rally cars.",
            "Power comes from a 2.0-liter turbocharged inline-4, rated at 271 horsepower and 273 lb-ft of torque in stock form. Due to the modifications performed to this Evolution VIII, it may produce more power, but a dyno sheet was not provided to confirm. Output is sent to all four wheels via a 5-speed manual transmission."
        ],
        "auction_equipment": [
            "Brembo brakes",
            "Rear wiper",
            "Power sunroof",
            "Leather-upholstered Recaro front bucket seats",
            "Air conditioning",
            "Power windows and mirrors",
            "Remote keyless entry",
            "7-speaker Infinity sound system"
        ],
        "modifications": [
            "Engine rebuilt by Jackson Auto Machine with Wiseco pistons and Venolia camshafts",
            "Lancer Evolution IX turbocharger",
            "HKS twin disc ceramic clutch kit",
            "HKS exhaust manifold",
            "Fabspeed exhaust system",
            "Injen cold air intake system",
            "Go Fast Bits Deceptor blow off valve",
            "Aftermarket intercooler",
            "18-inch Lancer Evolution X BBS wheels",
            "TEIN coilovers",
            "TEIN EDFC controller",
            "Front strut tower brace",
            "Drilled and slotted brake rotors",
            "EBC brake pads",
            "AMS Performance stainless steel brake lines",
            "Front lip spoiler",
            "Carbon fiber canards",
            "Carbon fiber hood scoop",
            "Carbon fiber fenders",
            "Carbon fiber side mirror covers",
            "Carbon fiber side skirt spats",
            "Carbon fiber rear wing",
            "Aftermarket rear bumper",
            "Tinted windows",
            "Side window and sunroof deflectors",
            "Aluminum skid plate",
            "Carbon fiber door panels",
            "MOMO steering wheel with quick-release hub",
            "Carbon fiber A- and B-pillar trim",
            "AEM wideband and oil pressure gauges",
            "Defi-Link Display VSD Concept",
            "Turbo timer",
            "Valentine One radar detector",
            "Aftermarket shift knob"
        ],
        "known_flaws": [
            "The attached Carfax history report notes that this Evolution VIII sustained \"minor damage\" to the front, rear, and left rear in September 2013.",
            "Front emblem is missing",
            "Scratches and bubbling paint on quarter panels",
            "Paint blemishes on the rear bumper",
            "Wear on carbon fiber side skirt spats",
            "Scratches on wheels",
            "Wear on seats and interior plastic panels",
            "Stains on carpets",
            "Some rust on underbody, engine bay, and brake components"
        ],
        "services": [],
        "included_items": [
            "1 key",
            "Factory 17-inch wheels",
            "Removed factory parts"
        ],
        "ownership_history": "The seller purchased this Evolution VIII new in June 2004.",
        "auction_stats": {
            "reserve_status": "Reserve",
            "auction_status": "Reserve not met, bid to",
            "highest_bid_value": "$16,750",
            "auction_date": "Apr 5, 2023 8:46 PM",
            "view_count": "9,287",
            "bid_count": "8",
            "bids": [
                "$16,750",
                "$16,500",
                "$16,250",
                "$16,000",
                "$15,000",
                "$2,000",
                "$1,000",
                "$420"
            ]
        }
    },
    "https://carsandbids.com/auctions/9AynoXXo/2004-mazda-mazdaspeed-mx-5-miata": {
        "auction_title": "2004 Mazda Mazdaspeed MX-5 Miata",
        "auction_subtitle": "NO RESERVE 6-Speed Manual, Turbo 4-Cylinder, Some Modifications, California-Owned",
        "auction_quick_facts": {
            "Make": "Mazda",
            "Model": "Mazdaspeed MX-5\nSave",
            "Mileage": "135,300",
            "VIN": "JM1NB354140404122",
            "Title Status": "Clean (CA)",
            "Location": "West Sacramento, CA 95691",
            "Seller": "lowborn",
            "Engine": "1.8L Turbocharged I4",
            "Drivetrain": "Rear-wheel drive",
            "Transmission": "Manual (6-Speed)",
            "Body Style": "Convertible",
            "Exterior Color": "Velocity Red Mica",
            "Interior Color": "Black/Red",
            "Seller Type": "Private Party"
        },
        "dougs_take": "I think the Mazdaspeed Miata is one of the very best versions of the Miata, thanks to its potent turbocharged 4-cylinder engine, its excellent handling, and the mandatory 6-speed manual transmission. This particular Mazdaspeed Miata is finished in handsome Velocity Red Mica, and it boasts some great factory equipment, including a limited-slip differential, 17-inch Racing Hart wheels, and a Bose sound system. It also has a few modifications, including a Flyin’ Miata exhaust, which should make it especially fun to drive – plus, it benefits from having just two owners in warm-weather California from new. This Miata is also offered with the thrill of no reserve, which adds to the excitement.",
        "auction_highlights": [
            "This MX-5 features a 6-speed manual transmission.",
            "The attached Carfax history report has a gap between 2005 and 2010 but indicates no mileage discrepancies for the given time period. It also shows that this Miata is a 2-owner car and has been registered in California from new.",
            "Factory equipment includes 17-inch Racing Hart alloy wheels, a limited-slip differential, a Mazdaspeed body kit, a manually-folding soft top, cloth upholstery, air conditioning, a Bose sound system, and more as detailed below.",
            "Modifications reported by the seller include a CSF aluminum radiator, a Flyin' Miata exhaust system, HID headlights, and more as listed below.",
            "Referred to as NB internally, the second-generation Miata had an updated design, more power from its inline-4 engine, and a larger trunk, as well as an upgraded interior. For 2004, the Mazdaspeed-tuned model arrived with performance upgrades such as turbo power, Bilstein suspension components, and Racing Hart wheels.",
            "Power comes from a turbocharged 1.8-liter DOHC inline-4, rated at 178 horsepower and 166 lb-ft of torque. Output is sent to the rear wheels through a 6-speed manual transmission."
        ],
        "auction_equipment": [
            "17-inch Racing Hart wheels",
            "Limited-slip differential",
            "Mazdaspeed body kit",
            "Manually folding soft top",
            "Cloth upholstery",
            "Mazdaspeed silver faceplates",
            "Aluminum pedals",
            "Footwell lighting",
            "Power windows and locks",
            "Air conditioning",
            "Mazdaspeed stainless steel door sill scuff plates",
            "Bose sound system",
            "6-disc CD changer"
        ],
        "modifications": [
            "Aftermarket intercooler",
            "CSF aluminum radiator",
            "Flyin' Miata exhaust system",
            "Mazda Competition motor mounts",
            "HID headlights",
            "Boost and oil temperature gauges on A-pillar",
            "Bluetooth module attachment for factory radio",
            "Aftermarket horn"
        ],
        "known_flaws": [
            "Although the included Carfax report indicates no accidents in this Miata‘s past, documentation in the photo gallery indicates this Miata received front bumper bodywork and paint work resulting from a collision in 2016. The seller reports this occurred before they took ownership and that they do not have additional details.",
            "Paint chips on forward-facing surfaces (pictured in the gallery)",
            "Scratches and chips on the driver's door",
            "Chips and some paint cracking on the rear bumper, trunk keyhole (shown on video)",
            "Scratches and curb rash on wheels",
            "Tires are in need of replacement",
            "Wear and a tear on the driver seat (pictured in the gallery)",
            "Some corrosion on underbody components"
        ],
        "services": [
            "February 2021 (129,502 miles): Valve cover gasket replaced, camshaft seals replaced",
            "October 2020 (126,781 miles): Thermostat and thermostat housing gasket replaced, radiator cap replaced",
            "September 2020 (125,605 miles): Engine oil and filter changed",
            "April 2020 (121,689 miles): Exhaust manifold gasket replaced, oxygen sensor replaced",
            "March 2020 (121,474 miles): Water pump replaced, serpentine belt replaced, timing belt replaced, valve cover gasket replaced, camshaft seals replaced",
            "February 2020 (121,116 miles): Engine oil and filter changed, transmission fluid changed, brake fluid flushed, clutch fluid flushed",
            "April 2019 (119,481 miles) Catalytic converter replaced",
            "January 2019 (119,215 miles): Spark plugs replaced",
            "August 2018 (118,037 miles): Engine oil and filter changed, transmission fluid changed",
            "March 2022: Alignment performed",
            "February 2022: Battery replaced",
            "September 2021: Crank seal replaced, cam seals checked, oil pan resealed, motor mounts replaced, brake pads replaced, brake calipers serviced",
            "October 2020: Radiator replaced, exhaust manifold exhaust leak repaired",
            "April 2020: Exhaust gas recirculation pipe replaced"
        ],
        "included_items": [
            "2 keys, 1 key fob",
            "Service records"
        ],
        "ownership_history": "The seller purchased this Miata in January 2020 and added approximately 14,300 miles since.",
        "auction_stats": {
            "reserve_status": "No reserve",
            "auction_status": "Sold to",
            "highest_bid_value": "$10,000",
            "auction_date": "Apr 5, 2023 8:38 PM",
            "view_count": "8,174",
            "bid_count": "8",
            "bids": [
                "$10,000",
                "$9,500",
                "$8,888",
                "$6,969",
                "$6,800",
                "$5,200",
                "$5,000",
                "$4,269"
            ]
        }
    },
    "https://carsandbids.com/auctions/rJmJ5Edv/1990-ferrari-348ts": {
        "auction_title": "1990 Ferrari 348ts",
        "auction_subtitle": "Gated 5-Speed Manual, V8 Power, Previously Owned by Hoovie's Garage",
        "auction_quick_facts": {
            "Make": "Ferrari",
            "Model": "348\nSave",
            "Mileage": "101,800 Miles Shown - TMU",
            "VIN": "ZFFFG36A4L0086653",
            "Title Status": "Clean (TX)",
            "Location": "Garland, TX 75048",
            "Seller": "bbaxter78",
            "Engine": "3.4L V8",
            "Drivetrain": "Rear-wheel drive",
            "Transmission": "Manual (5-Speed)",
            "Body Style": "Convertible",
            "Exterior Color": "Black",
            "Interior Color": "Black/Tan",
            "Seller Type": "Private Party"
        },
        "dougs_take": "I love the Ferrari 348 – and, like all older Ferrari models, it's becoming increasingly sought-after by collectors given its classic styling, naturally-aspirated V8 power, and gated manual transmission. This particular example is a 348ts, meaning it boasts a removable targa top – and it's finished in handsome black over a black and tan interior. This 348 also features some great factory equipment like a limited-slip differential and those oh-so-nineties 17-inch wheels – and it touts some nice upgrades including a Capristo exhaust and a pair of awesome Sparco seats. This 348 was formerly owned by Hoovie's Garage of YouTube fame, and it's offered with an accident-free Carfax report for added peace of mind.",
        "auction_highlights": [
            "This 348ts was previously featured on the YouTube channel \"Hoovie's Garage.\"",
            "The attached Carfax history report indicates no accidents in this Ferrari's past.",
            "Factory equipment includes 17-inch wheels, a limited-slip differential, pop-up headlights, fog lights, and power-operated windows, mirrors, and locks, among others listed below.",
            "Modifications reported by the seller include a Capristo exhaust, an aftermarket front splitter, Scuderia fender shields, Sparco seats, a Pioneer head unit, and an aftermarket center console with relocated window switches and mirror controls.",
            "Service documentation pictured in the gallery shows that this 348ts received a belt service in January 2018 at 94,482 miles.",
            "The 348 was built between 1989 and 1995 as the latest model in Ferrari's long-running rear-mid-engine line. Major updates over the 328 that preceded it included new exterior styling, a longitudinally-mounted engine design, and a more powerful Tipo F119 V8.",
            "Power comes from a 3.4-liter V8 engine, rated at 296 horsepower and 238 lb-ft of torque. Mid-mounted, it spins the rear wheels via a gated 5-speed manual transmission."
        ],
        "auction_equipment": [
            "17-inch wheels",
            "Limited-slip differential",
            "Pop-up headlights",
            "Fog lights",
            "Removable soft top",
            "Power-operated windows, mirrors, and locks",
            "Air conditioning"
        ],
        "modifications": [
            "Capristo exhaust",
            "Aftermarket front splitter",
            "Scuderia fender shields",
            "Sparco seats",
            "Pioneer head unit",
            "Aftermarket center console",
            "Relocated window switches and mirror controls"
        ],
        "known_flaws": [
            "At the time of the odometer failing in 2019, this 348ts had approximately 99,588 miles, according to the seller. The odometer was later repaired in 2020, approximately 500 miles later. As a result, this car is being listed as True Mileage Unknown, or \"TMU.\"",
            "Rock chips on hood and front bumper",
            "Scratches throughout vehicle",
            "Damage to front splitter",
            "Wear on steering wheel",
            "Wear on interior plastic trim",
            "Some rust on driver's doorsill"
        ],
        "services": [
            "November 2022 (101,563 miles): Armrest resecured, steering rack bushings, left rack boot, tie rod end, and tie rods replaced, and steering rack rebuilt",
            "February 2020 (99,588 miles): Seats reupholstered, speedometer speed sensor, thermostat, and injector set replaced, transmission fluid flushed"
        ],
        "included_items": [
            "2 keys",
            "Service records",
            "Ferrari tool kit",
            "Targa top soft case"
        ],
        "ownership_history": "The seller purchased this Ferrari in July 2022.",
        "auction_stats": {
            "reserve_status": "Reserve",
            "auction_status": "Sold to",
            "highest_bid_value": "$46,500",
            "auction_date": "Apr 5, 2023 8:32 PM",
            "view_count": "36,017",
            "bid_count": "42",
            "bids": [
                "$46,500",
                "$46,250",
                "$46,000",
                "$45,500",
                "$45,250",
                "$45,000",
                "$44,500",
                "$44,250",
                "$44,000",
                "$43,500",
                "$43,250",
                "$43,000",
                "$42,000",
                "$41,750",
                "$41,500",
                "$41,250",
                "$41,000",
                "$40,750",
                "$40,500",
                "$40,250",
                "$40,000",
                "$34,000",
                "$33,348",
                "$32,000",
                "$30,500",
                "$30,250",
                "$30,000",
                "$28,000",
                "$27,250",
                "$27,000",
                "$26,000",
                "$25,348",
                "$22,222",
                "$20,000",
                "$17,000",
                "$16,348",
                "$15,000",
                "$13,480",
                "$6,000",
                "$5,000",
                "$3,480",
                "$1,990"
            ]
        }
    },
    "https://carsandbids.com/auctions/3OaMRXkr/2000-bmw-m5": {
        "auction_title": "2000 BMW M5",
        "auction_subtitle": "6-Speed Manual, V8 Power, Nappa Point Sport Full Leather Interior, Some Modifications",
        "auction_quick_facts": {
            "Make": "BMW",
            "Model": "M5\nSave",
            "Mileage": "172,800",
            "VIN": "WBSDE934XYBZ95790",
            "Title Status": "Registered (RI)",
            "Location": "Providence, RI 02906",
            "Seller": "zwoobah",
            "Engine": "4.9L V8",
            "Drivetrain": "Rear-wheel drive",
            "Transmission": "Manual (6-Speed)",
            "Body Style": "Sedan",
            "Exterior Color": "Titanium Silver Metallic",
            "Interior Color": "Black/Silverstone",
            "Seller Type": "Private Party"
        },
        "dougs_take": "The E39 BMW M5 is an iconic performance sedan with timeless styling, excellent handling, and a potent V8 paired with a mandatory 6-speed manual transmission. This particular M5 is finished in the handsome color combination of Titanium Silver over a full Nappa Point black and Silverstone leather interior – and it boasts some great factory equipment, including heated front seats, a navigation system, and, of course, the beautiful 18-inch Style 65 wheels. This M5 also touts a few modifications, including upgraded suspension and exhaust parts, so it should be especially fun to drive.",
        "auction_highlights": [
            "The attached Carfax history report shows no mileage discrepancies in this M5's past.",
            "Factory equipment includes 18-inch Style 65 wheels, a sunroof, full Nappa Point leather upholstery, heated and power-adjustable front seats, aluminum interior trim, dual-zone automatic climate control, and more as listed below.",
            "Modifications reported by the seller include DEPO European-style headlights, E39 Facelift taillights, a muffler delete with stainless steel tips, an aftermarket short shift kit, an Eibach rear swaybar, Bilstein front shocks, a 16:9 navigation screen, an MKIV navigation computer, a European-style center console, and more as detailed below.",
            "Heralded by brand enthusiasts as the best of its breed, the E39-generation M5 arrived in America for the 2000 model year. It was the first of several M-developed cars powered by a V8 engine, and it was exclusively available with a 6-speed manual transmission. Car & Driver crowned it \"the most desirable sedan in the world\" in 2000.",
            "Power comes from an S62 4.9-liter V8, rated at 400 horsepower and 369 lb-ft of torque. Output is sent to the rear wheels via a 6-speed manual transmission."
        ],
        "auction_equipment": [
            "18-inch Style 65 wheels",
            "Power-operated sunroof",
            "Full Nappa Point leather upholstery",
            "Aluminum interior trim",
            "Heated and power-adjustable front seats",
            "Dual-zone automatic climate control",
            "Split-fold rear seat",
            "Park Distance Control (PDC)",
            "Cruise control"
        ],
        "modifications": [
            "Muffler delete with stainless steel tips",
            "Bilstein front shocks",
            "Eibach rear swaybar",
            "Einhorn Industries unicorn egg",
            "Einhorn industries unicorn reigns",
            "Aftermarket engine bay heat shield",
            "DEPO European-style headlights (factory headlights included with the sale)",
            "E39 Facelift taillights (factory taillights included with the sale)",
            "Aftermarket short-shift kit with ZHP shift knob",
            "16:9 navigation screen",
            "MKIV navigation computer",
            "European-style center console",
            "TEC cupholder",
            "Aftermarket pedal covers",
            "BlueBus module"
        ],
        "known_flaws": [
            "The attached Carfax report indicates that \"minor damage\" occurred to the left side and left rear of this M5 in September 2018.",
            "Rock chips on the hood",
            "Cracked driver-side rear window rubber trim",
            "Bubbling finish on Shadowline exterior trim (pictured in the photo gallery)",
            "Paint chips and some rust on the passenger-side front fender",
            "Scratches and some curb rash on wheels",
            "Creases and some wear on the driver seat's outer bolster",
            "Some rust on engine bay hardware"
        ],
        "services": [
            "July 2022: Front control arms and a four-wheel alignment performed",
            "April 2022: Valve cover gasket, spark plugs, upper and lower separator hoses, brake booster, and vacuum hoses replaced",
            "October 2021: Front and mid brake lines, differential seals, and differential mount replaced, brake and differential fluid flushed, engine oil and filter changed, lower oil pan resealed",
            "September 2021: Timing chain tensioner replaced",
            "August 2021: Front shocks replaced",
            "October 2020: Water pump, thermostat, and belt tensioner replaced",
            "January 2020: Power steering hoses, power steering reservoir, EVAP purge valve, and gas tank hard line replaced",
            "December 2019: Engine oil and filter changed, transmission and differential fluid flushed",
            "May 2019: Rear brake lines replaced",
            "April 2019: Four tires installed",
            "March 2019: Front brake pads replaced and used front calipers installed"
        ],
        "included_items": [
            "3 keys",
            "Owner's manual",
            "Factory headlights, and taillights",
            "Factory navigation computer"
        ],
        "ownership_history": "The seller purchased this M5 in May 2019 and has added approximately 19,800 miles since.",
        "auction_stats": {
            "reserve_status": "Reserve",
            "auction_status": "Sold to",
            "highest_bid_value": "$24,000",
            "auction_date": "Apr 4, 2023 11:06 PM",
            "view_count": "11,218",
            "bid_count": "23",
            "bids": [
                "$24,000",
                "$23,500",
                "$23,000",
                "$22,250",
                "$22,000",
                "$21,000",
                "$20,500",
                "$20,000",
                "$19,500",
                "$19,250",
                "$19,000",
                "$18,250",
                "$18,000",
                "$17,250",
                "$17,000",
                "$15,000",
                "$9,250",
                "$9,000",
                "$8,200",
                "$8,000",
                "$6,000",
                "$5,000",
                "$500"
            ]
        }
    },
    "https://carsandbids.com/auctions/rEqaOxP7/2020-jeep-wrangler-rubicon-4x4": {
        "auction_title": "2020 Jeep Wrangler Rubicon 4x4",
        "auction_subtitle": "~11,200 Miles, Recon Edition, 4WD, Some Modifications, California-Owned",
        "auction_quick_facts": {
            "Make": "Jeep",
            "Model": "Wrangler\nSave",
            "Mileage": "11,200",
            "VIN": "1C4HJXCN0LW322686",
            "Title Status": "Clean (CA)",
            "Location": "Rancho Santa Margarita, CA 92688",
            "Seller": "Jon_H",
            "Engine": "2.0L Turbocharged I4",
            "Drivetrain": "4WD/AWD",
            "Transmission": "Automatic (8-Speed)",
            "Body Style": "SUV/Crossover",
            "Exterior Color": "Black",
            "Interior Color": "Black",
            "Seller Type": "Private Party"
        },
        "dougs_take": "The JL Jeep Wrangler is a hugely popular SUV and a highly competent off-roader – and it represents a significant improvement in technology and comfort over the JK model. This particular JL is a Rubicon model with Recon Edition goodies – and it boasts some desirable equipment, including the Cold Weather Group, the Premium Audio Group, and a 3-piece hardtop. It also touts some cool modifications like 17-inch AEV Salta XR wheels, a Warn VR EVO 10-S winch, and an ARB on-board air compressor that further enhances this Wrangler's off-road capabilities. Plus, this Jeep comes with a clean, accident-free Carfax report that shows dry-climate California ownership since new, for added peace of mind.",
        "auction_highlights": [
            "This Jeep's odometer shows about 11,200 miles.",
            "The attached Carfax history report shows no accidents or mileage discrepancies in this Wrangler's past; it also shows California ownership from new.",
            "According to the window sticker provided in the gallery, this Wrangler carried an MSRP of $52,460 when new. Factory equipment includes the Recon, Cold Weather, Premium Audio, and Safety packages, a Rock-Trac part-time 4-wheel-drive system, locking front and rear differentials, a disconnecting front stabilizer bar, a 3-piece hardtop, leather-trimmed bucket seats, a trailer sway damping system, and more as detailed below.",
            "Modifications reported by the seller include 17-inch AEV Salta XR wheels, a Warn VR EVO 10-S winch, a Factor 55 FlatLink winch shackle, an AEV rear bumper and tire carrier, a Tuffy tailgate lockbox, an ARB on-board air compressor, and a RAM Mounts dashboard mount.",
            "Launched in 2018, the fourth-generation JL Wrangler featured an updated exterior and interior design as well as a new optional 8-speed automatic transmission. Offered in a variety of trim levels and packages, the newest Wrangler has further entrenched itself into the high-end SUV arena while maintaining the off-road prowess the model has long been known for.",
            "Power comes from a 2.0-liter turbocharged inline-4, rated at 270 horsepower and 295 lb-ft of torque. Output is sent to the rear or the four wheels through an 8-speed automatic transmission and a 2-speed transfer case."
        ],
        "auction_equipment": [
            "Recon Edition (red seat belts, wrapped instrument cluster bezels with red stitching, Recon badges, black/body-colored grille, LED lighting group, LED front fog lights, LED reflector headlights, daytime running light LED accents, LED tail lights, Steel Bumper Group, Mopar bumper hoop, heavy-duty rock slider with step assist, Jeep Trail-Rated Kit)",
            "Cold Weather Group (heated steering wheel, heated front seats, remote start)",
            "8.4-inch Radio and Premium Audio Group (active noise-control system, Uconnect 4C navigation system, satellite radio compatibility, Alpine audio system, 4G LTE Wi-Fi hot spot, GPS navigation)",
            "Safety Group (ParkSense rear park-assist system, blind spot and cross-path detection)",
            "Rock-Trac part-time 4-wheel-drive system",
            "Locking front and rear differentials",
            "Fuel tank, transfer case, and transmission skid plates",
            "Rock protection sill rails",
            "Disconnecting front stabilizer bar",
            "Black 3-piece hardtop",
            "Mopar hardtop headliner",
            "Rear window defroster",
            "Rear window wiper",
            "Leather-trimmed bucket seats",
            "Trailer sway damping system",
            "Rearview camera"
        ],
        "modifications": [
            "17-inch AEV Salta XR wheels",
            "Warn VR EVO 10-S winch",
            "Factor 55 FlatLink winch shackle",
            "AEV rear bumper and tire carrier",
            "Tuffy tailgate lockbox",
            "ARB on-board air compressor",
            "RAM Mounts dashboard mount",
            "Custom dead pedal"
        ],
        "known_flaws": [
            "Scratch above the passenger's side tail light",
            "Scratches on wheels",
            "Some creases on driver's seat"
        ],
        "services": [
            "April 2021 (3,930 miles): One tire mounted and balanced",
            "January 2021: Battery replaced",
            "January 2021 (3,546 miles): Engine oil and filter changed"
        ],
        "included_items": [
            "2 keys",
            "Owner's manual",
            "Jeep tool pouch",
            "Jeep Trail Rated Kit",
            "Removed factory bumper components",
            "Motobilt e-Torque battery skid plate (power-coated black)",
            "Mopar steel front bumper extensions",
            "Wireless/wired winch controller",
            "CMM Offroad door-off side mirrors",
            "Mesh bimini top",
            "Cab cover",
            "Cargo net",
            "Molle door panels",
            "Carpet floor mats",
            "Freedom Top storage bag",
            "Factory antenna"
        ],
        "ownership_history": "The seller purchased this Wrangler in March 2021 and has added about 7,600 miles since.",
        "auction_stats": {
            "reserve_status": "Reserve",
            "auction_status": "Sold to",
            "highest_bid_value": "$35,500",
            "auction_date": "Apr 4, 2023 10:58 PM",
            "view_count": "5,224",
            "bid_count": "30",
            "bids": [
                "$35,500",
                "$35,250",
                "$35,000",
                "$34,750",
                "$34,500",
                "$34,250",
                "$34,000",
                "$33,750",
                "$33,500",
                "$33,250",
                "$33,000",
                "$32,750",
                "$32,500",
                "$31,750",
                "$31,500",
                "$30,987",
                "$29,500",
                "$28,765",
                "$28,000",
                "$26,789",
                "$26,500",
                "$26,250",
                "$26,000",
                "$25,500",
                "$25,000",
                "$24,000",
                "$22,000",
                "$19,999",
                "$10,100",
                "$9,999"
            ]
        }
    },
    "https://carsandbids.com/auctions/9XPRpvNo/1992-gmc-sierra-1500": {
        "auction_title": "1992 GMC Sierra 1500",
        "auction_subtitle": "NO RESERVE 5.3-Liter V8 Swap, Numerous Modifications, Mostly Texas-Owned",
        "auction_quick_facts": {
            "Make": "GMC",
            "Model": "Sierra\nSave",
            "Mileage": "188,200",
            "VIN": "1GTDC14Z1NZ529175",
            "Title Status": "Clean (NJ)",
            "Location": "Swedesboro, NJ 08085",
            "Seller": "SPIRITCDJR",
            "Engine": "5.3L V8",
            "Drivetrain": "Rear-wheel drive",
            "Transmission": "Automatic (4-Speed)",
            "Body Style": "Truck",
            "Exterior Color": "Green",
            "Interior Color": "Gray",
            "Seller Type": "Dealer"
        },
        "dougs_take": "How's this for a blast from the past? Lowrider-style trucks were all the rage in the 1990s – there were entire magazines dedicated to them. The trend has since died down, but these heavily-modified pickups are just as cool as they were 30 years ago. This GMC Sierra features an adjustable air suspension system, eye-catching green paint, bright American Racing wheels, AND a custom interior – so it's sure to turn heads everywhere it goes. And, while it started life with a V6 under the hood, it's now powered by a newer 5.3-liter V8 for extra power. Air conditioning is a nice feature, too, ensuring you can cruise all summer long and stay cool. This Sierra has also been mostly Texas-owned, which is a great benefit – and it's offered with the added excitement of no reserve.",
        "auction_highlights": [
            "The attached Carfax history report shows that this truck was Texas-owned until 2015.",
            "This GMC's factory-fitted 4.3-liter V6 has been replaced by a 5.3-liter V8, according to the selling dealer. The list of modifications reported also includes an air suspension system, green exterior paint, an aftermarket grille, Cadillac-sourced rear lights, aftermarket upholstery on the seats, and a Kenwood touchscreen.",
            "Introduced for 1988, the fourth-generation C/K 1500 brought smaller cab dimensions than the previous \"rounded-line\" trucks while increasing interior room. Called GMT400 internally, the C/K 1500 was offered in several specialized variants. A wide range of engines and transmissions ensured the model remained competitive no matter the customer's needs, and the truck sold well throughout its production run.",
            "Power comes from a 5.3-liter V8. It spins the rear wheels via a 4-speed automatic transmission."
        ],
        "auction_equipment": [
            "Power-operated windows",
            "Power-operated locks",
            "Air conditioning"
        ],
        "modifications": [
            "5.3-liter V8",
            "Aftermarket parts in the intake system",
            "Aftermarket parts in the exhaust system",
            "Green trim in the engine bay",
            "17-inch American Racing wheels",
            "Air suspension system",
            "Aftermarket rear shocks",
            "Drilled and slotted brake rotors",
            "Green paint",
            "Aftermarket grille",
            "Aftermarket front bumper",
            "Clear parking light lenses",
            "Domed hood",
            "Aftermarket door mirrors",
            "Cadillac-sourced rear lights",
            "Rear bumper removed",
            "Aftermarket upholstery on the seats",
            "Autometer gauges on the A-pillar",
            "Wood-rimmed steering wheel",
            "Aftermarket gear selector knob",
            "Air pressure gauge and aftermarket switches on the dashboard",
            "Power outlets on the bottom part of the dashboard",
            "Aftermarket headliner",
            "Aftermarket door panels",
            "Kenwood touchscreen",
            "Aftermarket parts in the sound system",
            "Microphone for Bluetooth connectivity"
        ],
        "known_flaws": [
            "The attached Carfax history report notes that this Sierra hit a guardrail in February 2005. It provides no additional details about the accident but notes that the truck was functional after the impact.",
            "Scratches on the front splitter",
            "Moisture in the passenger-side front parking lights",
            "Some wear on the driver's seat's outer bolsters and on some of the interior touch points",
            "Front sway bar end link bushings cracked"
        ],
        "services": [],
        "included_items": [
            "1 key"
        ],
        "ownership_history": "The selling dealer states that he purchased this Sierra in 2021.",
        "auction_stats": {
            "reserve_status": "No reserve",
            "auction_status": "Sold to",
            "highest_bid_value": "$15,769",
            "auction_date": "Apr 4, 2023 10:46 PM",
            "view_count": "7,932",
            "bid_count": "18",
            "bids": [
                "$15,769",
                "$14,777",
                "$13,069",
                "$12,345",
                "$10,100",
                "$9,999",
                "$7,069",
                "$6,969",
                "$5,200",
                "$5,100",
                "$5,000",
                "$4,321",
                "$4,100",
                "$4,000",
                "$2,222",
                "$2,000",
                "$750",
                "$100"
            ]
        }
    },
    "https://carsandbids.com/auctions/KDkb6np3/2023-rivian-r1t-adventure-edition": {
        "auction_title": "2023 Rivian R1T Adventure Edition",
        "auction_subtitle": "Quad-Motor AWD, Large Battery Pack, El Cap Granite",
        "auction_quick_facts": {
            "Make": "Rivian",
            "Model": "R1T\nSave",
            "Mileage": "200",
            "VIN": "7FCTGAAA5PN018099",
            "Title Status": "Clean (CA)",
            "Location": "San Francisco, CA 94124",
            "Seller": "jasonlikesfourwheels",
            "Engine": "Quad Electric Motors",
            "Drivetrain": "4WD/AWD",
            "Transmission": "Automatic",
            "Body Style": "Truck",
            "Exterior Color": "El Cap Granite",
            "Interior Color": "Black Mountain",
            "Seller Type": "Private Party"
        },
        "dougs_take": "The Rivian R1T is one of the most impressive vehicles currently on sale, as it packages the practicality of a pickup truck, the acceleration of a sports car, the technology of a modern EV, and the capabilities of a serious off-roader into an innovative design. This particular R1T is a 2023 model that's essentially new, with less than 200 miles on the clock – and it touts the 21-inch Road wheels, which give this truck a fantastic 328-mile driving range. Plus, this Rivian is unmodified – and it comes with a clean, accident-free Carfax report, for added peace of mind.",
        "auction_highlights": [
            "The attached Carfax history report lists no accidents in this Rivian's brief past.",
            "Factory equipment includes the Adventure Edition Package, 21-inch Road wheels, an air suspension system, an air compressor in the cargo box, heated, ventilated, and power-adjustable front seats, a 15.6-inch touchscreen for the infotainment system, and a Rivian Elevation by Meridian sound system. The seller reports no modifications.",
            "Released for 2022, the R1T has a lot of firsts on its resume. It's notably the first model released by Rivian and the first modern electric pickup to enter production. It was developed on a blank sheet of paper with the outdoors in mind, so it offers several clever features like a Gear Tunnel located between the cargo box and the cab. It's still available today.",
            "Power comes from four electric motors, which draw electricity from a 135-kilowatt-hour lithium-ion battery pack to zap the four wheels with 835 horsepower and 908 lb-ft of torque. The R1T, when equipped with the 21-inch Road wheels, earned a maximum driving range rating of 328 miles from the EPA."
        ],
        "auction_equipment": [
            "Adventure Edition Package (Gear Guard remote monitoring system and security cables, dual front bumper tow hooks, Chilewich floor mats)",
            "21-inch Road wheels",
            "Large battery pack",
            "Air suspension",
            "Air compressor in the cargo box",
            "Vegan upholstery",
            "Heated, ventilated, and power-adjustable front seats",
            "Heated rear seats",
            "Heated steering wheel",
            "Dark ash wood interior trim",
            "12.3-inch digital instrument cluster",
            "15.6-inch touchscreen infotainment system",
            "Rivian Elevation by Meridian sound system",
            "Removable Bluetooth-compatible speaker in the center console",
            "Kinetic roll control",
            "Adaptive cruise control",
            "Forward collision warning",
            "Lane Keep Assistance",
            "Blind Spot Warning"
        ],
        "modifications": [],
        "known_flaws": [],
        "services": [],
        "included_items": [
            "2 key cards and 1 key fob",
            "Safety manual",
            "Window sticker",
            "Charging cable"
        ],
        "ownership_history": "The seller purchased this Rivian when new in February 2023.",
        "auction_stats": {
            "reserve_status": "Reserve",
            "auction_status": "Reserve not met, bid to",
            "highest_bid_value": "$77,500",
            "auction_date": "Apr 4, 2023 10:41 PM",
            "view_count": "4,632",
            "bid_count": "19",
            "bids": [
                "$77,500",
                "$77,000",
                "$76,500",
                "$76,000",
                "$75,500",
                "$75,000",
                "$74,500",
                "$74,000",
                "$70,000",
                "$69,000",
                "$68,500",
                "$67,500",
                "$62,420",
                "$61,888",
                "$61,267",
                "$60,000",
                "$57,890",
                "$56,789",
                "$45,678"
            ]
        }
    },
    "https://carsandbids.com/auctions/9a7GAzWX/2018-bmw-340i": {
        "auction_title": "2018 BMW 340i",
        "auction_subtitle": "M Sport Package, M Performance Accessories, California-Owned",
        "auction_quick_facts": {
            "Make": "BMW",
            "Model": "340i\nSave",
            "Mileage": "42,400",
            "VIN": "WBA8B3C57JK384643",
            "Title Status": "Clean (CA)",
            "Location": "San Diego, CA 92113",
            "Seller": "garagecollective",
            "Engine": "3.0L Turbocharged I6",
            "Drivetrain": "Rear-wheel drive",
            "Transmission": "Automatic (8-Speed)",
            "Body Style": "Sedan",
            "Exterior Color": "Alpine White",
            "Interior Color": "Coral Red",
            "Seller Type": "Dealer"
        },
        "dougs_take": "The F30 BMW 3 Series is an excellent sport sedan, offering handsome styling, a nicely-appointed interior, and a fun driving experience. This particular example is the desirable 340i, which boasts a potent turbocharged 6-cylinder with 320 horsepower. It also benefits from some great factory equipment, including the M Sport package, power-adjustable heated front seats, and a heads-up display. This 340i also features a selection of BMW M Performance accessories for an even more impressive look – and it touts a clean, accident-free Carfax report showing ownership in dry-climate California from new, further adding to the appeal.",
        "auction_highlights": [
            "The attached Carfax history report shows no accidents; it also shows that this 340i has been registered in California since new.",
            "According to the build sheet provided in the gallery, factory equipment includes the M Sport Package, a sunroof, Dakota leather upholstery, heated front seats, a navigation system, a Harman/Kardon sound system, and more as listed below.",
            "Modifications reported by the selling dealer include a BMW M Performance front splitter, rocker panel extensions, tinted windows, and more as detailed below.",
            "BMW launched the sixth-generation 3 Series for the 2012 model year. Called \"F30\" internally, it was slightly bigger than its predecessor, and it offered buyers a much more up-to-date interior. 2016 brought a mid-cycle update that included subtle styling tweaks, a widely praised redesigned suspension, and changes to the steering system.",
            "Power comes from a \"B58\" 3.0-liter turbocharged inline-6, rated at 320 horsepower and 330 lb-ft of torque. Output is sent to the rear wheels via an 8-speed automatic transmission."
        ],
        "auction_equipment": [
            "M Sport Package (19-inch Style 704M wheels, sport front seats, aluminum dark carbon interior trim, adaptive M suspension, M steering wheel, aerodynamic kit, Shadowline exterior trim, anthracite headliner)",
            "Black kidney grilles",
            "LED headlights and fog lights",
            "Power-operated sunroof",
            "Dakota leather upholstery",
            "Leather-trimmed steering wheel",
            "Power-adjustable, heated front seats with driver memory function",
            "Harman/Kardon surround sound system",
            "Navigation system",
            "Apple CarPlay compatibility",
            "Driving Assistant",
            "Rear-view camera",
            "Heads-up display",
            "Auto-dimming rear and side view mirrors",
            "Rain-sensing windshield wipers",
            "Lane Change Warning",
            "Park Distance Control (PDC)",
            "Active cruise control"
        ],
        "modifications": [
            "BMW M Performance front splitter",
            "BMW M Performance rocker panel extensions and decals",
            "Aftermarket rear trunk spoiler",
            "Black powder-coated factory wheels",
            "Tinted windows",
            "BMW M Performance stainless steel pedal cover set"
        ],
        "known_flaws": [
            "Chips on front end",
            "Scuffs on driver’s door sill"
        ],
        "services": [
            "June 2022 (38,653 miles): Engine oil and filter changed, cabin air filter replaced",
            "March 2021 (31,764 miles): Engine oil and filter changed, brake fluid flushed",
            "August 2020 (25,144 miles): Engine oil and filter changed, cabin air filter replaced",
            "May 2020 (22,982 miles): Battery charged, computer reprogrammed",
            "October 2019 (17,624 miles): Engine oil and filter changed",
            "July 2019 (12,271 miles): Engine oil and filter changed, cabin air filter replaced",
            "March 2019 (7,249 miles): Engine oil and filter changed, computer reprogrammed"
        ],
        "included_items": [
            "2 keys",
            "Owner's manuals",
            "Spare tire",
            "Tool kit"
        ],
        "ownership_history": "The selling dealer represents this 340i on behalf of the owner, who purchased it in September 2021 and added approximately 7,800 miles since.",
        "auction_stats": {
            "reserve_status": "Reserve",
            "auction_status": "Sold to",
            "highest_bid_value": "$32,000",
            "auction_date": "Apr 4, 2023 10:32 PM",
            "view_count": "11,817",
            "bid_count": "37",
            "bids": [
                "$32,000",
                "$31,750",
                "$31,500",
                "$31,250",
                "$31,000",
                "$30,750",
                "$30,500",
                "$30,250",
                "$30,000",
                "$29,750",
                "$29,500",
                "$29,250",
                "$29,000",
                "$28,750",
                "$28,410",
                "$28,160",
                "$27,250",
                "$27,000",
                "$26,750",
                "$25,750",
                "$25,500",
                "$25,250",
                "$25,000",
                "$24,500",
                "$24,250",
                "$24,000",
                "$23,250",
                "$23,000",
                "$20,000",
                "$15,000",
                "$14,500",
                "$14,000",
                "$13,500",
                "$13,000",
                "$12,345",
                "$1,340",
                "$1,000"
            ]
        }
    },
    "https://carsandbids.com/auctions/92RjJDkQ/2001-jeep-cherokee-sport-4x4": {
        "auction_title": "2001 Jeep Cherokee Sport 4x4",
        "auction_subtitle": "NO RESERVE 4.0-Liter 6-Cylinder, 4WD, Some Modifications, Southern-Owned",
        "auction_quick_facts": {
            "Make": "Jeep",
            "Model": "Cherokee\nSave",
            "Mileage": "149,800",
            "VIN": "1J4FF48SX1L559149",
            "Title Status": "Clean (FL)",
            "Location": "Winter Park, FL 32789",
            "Seller": "antmpeterson",
            "Engine": "4.0L I6",
            "Drivetrain": "4WD/AWD",
            "Transmission": "Automatic (4-Speed)",
            "Body Style": "SUV/Crossover",
            "Exterior Color": "Patriot Blue Pearl Coat",
            "Interior Color": "Agate",
            "Seller Type": "Private Party"
        },
        "dougs_take": "The XJ Jeep Cherokee is a robust SUV that's become an enthusiastic favorite – it touts a boxy, old-school design, great off-road capabilities, and a level of simplicity that's lost in the modern-day Jeep range. This particular Cherokee is a Sport model from the final year of XJ production, and it boasts 4-wheel drive combined with the tried-and-true 4.0-liter straight-6 engine – and it also comes with some nice equipment, including air conditioning, remote keyless entry, and cruise control. Plus, this Cherokee benefits from a few modifications to boost its off-road credentials – and a clean, accident-free Carfax report showing warm-climate Southern ownership since new. It's also offered with the thrill of no reserve!",
        "auction_highlights": [
            "The attached Carfax history report shows no accidents or mileage discrepancies in this Jeep's past; it also shows Southern ownership from new.",
            "According to the build sheet provided in the gallery, factory equipment includes 15-inch wheels, a roof rack, a rear wiper, cloth upholstery, air conditioning, power windows, remote keyless entry, and cruise control.",
            "The full list of modifications reported by the seller is detailed below. Highlights include a Rough Country 3-inch lift kit, 31-inch Maxtrek Mud Trac tires, a DuraHitch trailer hitch, and a Sony head unit.",
            "The Cherokee \"XJ\" was revamped for the 1997 model year with softer styling inside and out, a new dash with dual airbags, and numerous small refinements. With its boxy styling, strong inline-6, and well-judged dimensions, it has become a favorite among SUV enthusiasts.",
            "Power comes from a 4.0-liter inline-6 engine, rated at 190 horsepower and 225 lb-ft of torque. Output is sent to the rear or all four wheels via a 4-speed automatic transmission and a 2-speed transfer case."
        ],
        "auction_equipment": [
            "15-inch wheels",
            "Roof rack",
            "Rear wiper",
            "Cloth upholstery",
            "Air conditioning",
            "Power windows",
            "Power side mirrors",
            "Remote keyless entry",
            "Cruise control"
        ],
        "modifications": [
            "Rough Country 3-inch lift kit",
            "31-inch Maxtrek Mud Trac tires",
            "Aftermarket headlights",
            "DuraHitch trailer hitch",
            "Sony head unit",
            "Floor mats from a Kia Forte"
        ],
        "known_flaws": [
            "Dings, chips, and scratches around the exterior",
            "Weathered exterior trim",
            "Faded paint on wheel arches",
            "Some corrosion and paint damage on the roof",
            "Stains on front seats; driver's seat upholstery is torn",
            "Headliner upholstery is missing",
            "Wear on interior touch points",
            "Stains on carpets",
            "Scuffs and wear on interior panels",
            "Corrosion on underbody components"
        ],
        "services": [
            "Spark plugs, idle air control motor, throttle position sensor, manifold absolute pressure sensor, valve cover gasket, and oil pan gasket replaced, engine oil and filter changed, air conditioning system recharged, remanufactured steering gear box and lift kit installed",
            "February 2023 (149,433 miles): Engine oil and filter changed",
            "April 2022 (145,033 miles): Engine oil and filter changed, air filter replaced",
            "September 2018 (138,781 miles): Tire(s) replaced",
            "April 2018 (137,265 miles): Battery replaced, engine oil and filter changed"
        ],
        "included_items": [
            "2 keys, 1 remote",
            "Rough Country seat covers"
        ],
        "ownership_history": "The seller acquired this Jeep in July 2022 and has added about 2,500 miles since.",
        "auction_stats": {
            "reserve_status": "No reserve",
            "auction_status": "Sold to",
            "highest_bid_value": "$6,500",
            "auction_date": "Apr 4, 2023 10:22 PM",
            "view_count": "8,480",
            "bid_count": "10",
            "bids": [
                "$6,500",
                "$6,400",
                "$6,300",
                "$6,200",
                "$6,100",
                "$6,000",
                "$4,400",
                "$3,500",
                "$2,100",
                "$2,000"
            ]
        }
    },
    "https://carsandbids.com/auctions/3vVG5Bzv/2011-bmw-335i-xdrive-sedan": {
        "auction_title": "2011 BMW 335i xDrive Sedan",
        "auction_subtitle": "NO RESERVE 6-Speed Manual, AWD, M Sport and Premium Packages, Rod Bearings Replaced",
        "auction_quick_facts": {
            "Make": "BMW",
            "Model": "335i\nSave",
            "Mileage": "94,500",
            "VIN": "WBAPL5G55BNN49314",
            "Title Status": "Clean (NY)",
            "Location": "Levittown, NY 11756",
            "Seller": "guns4you",
            "Engine": "3.0L Turbocharged I6",
            "Drivetrain": "4WD/AWD",
            "Transmission": "Manual (6-Speed)",
            "Body Style": "Sedan",
            "Exterior Color": "Space Gray Metallic",
            "Interior Color": "Black Dakota",
            "Seller Type": "Private Party"
        },
        "dougs_take": "The E90 BMW 335i is a wonderful sedan that boasts a potent turbocharged 6-cylinder engine, handsome styling, and a luxurious interior. This particular 335i offers some great benefits, including a 6-speed manual transmission combined with xDrive all-wheel drive – and the M Sport, Premium, and Cold Weather packages. This 335i also features some desirable upgrades like 17-inch Apex wheels, Koni struts and shocks, Dinan springs and bump stops, and a VRSF downpipe. Plus, it comes with a clean, accident-free Carfax report, for added peace of mind – and no reserve means someone is taking home this 335i at the end of the auction.",
        "auction_highlights": [
            "The attached Carfax history report shows no accidents or mileage discrepancies in this car's past.",
            "According to the window sticker provided in the gallery, this 335i had a total suggested retail price of $56,450. Factory equipment includes the M Sport, Premium, and Cold Weather packages, xenon headlights, a sunroof, Dakota leather upholstery, a navigation system, Harman Kardon surround sound system, and more as detailed below.",
            "Modifications include 17-inch Apex ARC-8 wheels, Koni struts and shocks, Dinan springs and bump stops, and more as detailed below.",
            "A service record shown in the photo gallery indicates that the rod bearings were replaced. The seller reports that the work was completed in 2020, though the date is redacted from the record.",
            "Known as the \"E90\" internally, BMW's fifth-generation 3 Series arrived for the 2006 model year with an extroverted design penned under the guidance of Chris Bangle, and less weight than its predecessor thanks in part to the use of aluminum. 2011 brought a new \"N55\" engine that gave the 335i better fuel economy and quicker performance.",
            "Power comes from an \"N55\" 3.0-liter turbocharged inline-6, rated at 300 horsepower and 300 lb-ft of torque in stock form. Due to the modifications performed to this BMW, it likely produces slightly more power, but a dyno sheet was not provided to confirm. Output is sent to all four wheels via a 6-speed manual transmission and BMW's xDrive permanent all-wheel drive system."
        ],
        "auction_equipment": [
            "M Sport Package (18-inch Style 193 wheels (removed, but included), sports seats, M steering wheel, aerodynamic kit, Shadowline exterior trim, Glacier Silver aluminum trim, Anthracite headliner, rear Park Distance Control)",
            "Premium Package (universal garage door opener, auto-dimming mirrors with review mirror compass, lumbar support, BMW Assist with enhanced Bluetooth and USB)",
            "Cold Weather Package (heated front seats and split-folding rear seats)",
            "Xenon headlights with washers",
            "Power-operated sunroof",
            "Dakota leather upholstery",
            "Power-adjustable front seats",
            "Navigation system",
            "Dual-zone automatic climate control",
            "Ambiance lighting",
            "Cruise control",
            "Harman Kardon surround sound system"
        ],
        "modifications": [
            "17-inch Apex ARC-8 wheels",
            "Koni struts and shocks",
            "Dinan springs and bump stops",
            "90a hardness polyurethane front thrust arm bushings",
            "VRSF downpipe",
            "BMS oil catch can",
            "328i badge on trunk lid",
            "ZHP shift knob"
        ],
        "known_flaws": [
            "Stone chips and scratches on front end (pictured in gallery)",
            "Dings on doors",
            "Body filler separation on driver's side rear quarter panel",
            "Scratch on rear bumper and some paint peeling on rear bumper trim",
            "Creases and scratches on driver's seat",
            "Wear on start/stop button",
            "Hole in parking brake boot",
            "Bubbles on interior driver's door pull",
            "Some rust on driver's side rear door sill and rear subframe",
            "Belt squeaks when cold"
        ],
        "services": [
            "August 2022: Alignment performed",
            "May 2022 (91,149 miles): Passed emissions inspection (NY)",
            "April 2021 (83,627 miles): Passed emissions inspection (NY)",
            "October 2020 (75,134 miles): Tires replaced",
            "March 2020 (68,380 miles): Passed emissions inspection (NY)",
            "February 2019 (64,176 miles): Engine oil and filter changed"
        ],
        "included_items": [
            "2 keys",
            "Owner's manual",
            "Window sticker",
            "WeatherTech front floor mats",
            "Factory rear rubber floor mats",
            "Factory front carpet floor mats",
            "Factory 18-inch Style 193 wheels",
            "Wheel lock key",
            "Factory springs and bump stops",
            "Factory downpipe"
        ],
        "ownership_history": "The seller purchased this 335i in 2020 and has added approximately 26,500 miles since.",
        "auction_stats": {
            "reserve_status": "No reserve",
            "auction_status": "Sold to",
            "highest_bid_value": "$13,900",
            "auction_date": "Apr 4, 2023 10:16 PM",
            "view_count": "10,953",
            "bid_count": "67",
            "bids": [
                "$13,900",
                "$13,800",
                "$13,700",
                "$13,600",
                "$13,500",
                "$13,400",
                "$13,100",
                "$13,000",
                "$12,900",
                "$12,800",
                "$12,400",
                "$12,200",
                "$12,000",
                "$11,800",
                "$11,700",
                "$11,600",
                "$11,500",
                "$11,400",
                "$11,300",
                "$11,200",
                "$11,100",
                "$11,000",
                "$10,500",
                "$10,400",
                "$10,100",
                "$10,000",
                "$9,900",
                "$9,800",
                "$9,700",
                "$9,600",
                "$9,500",
                "$9,200",
                "$9,100",
                "$8,909",
                "$8,700",
                "$8,600",
                "$8,500",
                "$8,400",
                "$8,300",
                "$8,200",
                "$7,600",
                "$7,500",
                "$7,100",
                "$7,000",
                "$6,835",
                "$6,735",
                "$6,635",
                "$6,535",
                "$6,435",
                "$6,335",
                "$6,200",
                "$6,100",
                "$6,000",
                "$5,700",
                "$5,333",
                "$5,200",
                "$5,000",
                "$3,800",
                "$3,700",
                "$3,600",
                "$3,500",
                "$3,100",
                "$3,000",
                "$2,800",
                "$2,500",
                "$2,100",
                "$1,000"
            ]
        }
    },
    "https://carsandbids.com/auctions/rGJOzeWw/2012-nissan-370z-coupe": {
        "auction_title": "2012 Nissan 370Z Coupe",
        "auction_subtitle": "~43,600 Miles, 332-hp V6, Touring Trim, Some Modifications",
        "auction_quick_facts": {
            "Make": "Nissan",
            "Model": "370Z\nSave",
            "Mileage": "43,600",
            "VIN": "JN1AZ4EH0CM561766",
            "Title Status": "Clean (TX)",
            "Location": "Springdale, AR 72764",
            "Seller": "Qwk_Collections",
            "Engine": "3.7L V6",
            "Drivetrain": "Rear-wheel drive",
            "Transmission": "Automatic (7-Speed)",
            "Body Style": "Coupe",
            "Exterior Color": "Magnetic Black Metallic",
            "Interior Color": "Black",
            "Seller Type": "Dealer"
        },
        "dougs_take": "The Nissan 370Z is a thrilling sports car with great styling and a potent 332-horsepower V6 under the hood – and a worthy version of the long-running Z nameplate. This particular 370Z touts a handsome Magnetic Black Metallic over black color combination, and it features some nice equipment like automatic bi-xenon headlights, leather and synthetic suede upholstery, heated seats, and a Bose audio system. This Z also boasts a few desirable upgrades, including 18-inch F1R wheels, H&R lowering springs, and aftermarket mufflers – and it's offered with reasonably low mileage, along with a clean, accident-free Carfax report, for added buyer assurance.",
        "auction_highlights": [
            "The odometer on this 370Z currently displays approximately 43,600 miles.",
            "The attached Carfax history report shows no accidents or mileage discrepancies in this 370Z’s past.",
            "According to the Monroney Label pictured in the photo gallery, this 370Z had an original MSRP of $39,505 and came equipped with automatic bi-xenon headlights, leather and synthetic suede upholstery, power-adjustable and heated seats, a Bose audio system with 6 speakers and 2 subwoofers, and more as detailed below.",
            "Modifications reported by the selling dealer include 18-inch F1R wheels, H&R lowering springs, aftermarket mufflers, and tinted windows.",
            "Nissan introduced the 370Z for the 2009 model year, offering more futuristic styling, a more powerful V6 engine, and a sharper driving character thanks in part to its shorter wheelbase compared to the 350Z. The 370Z’s more rigid structure and its better power-to-weight ratio didn’t harm either, allowing Nissan to continue the immensely popular legacy of its Z sports car.",
            "Power comes from a 3.7-liter VQ37VHR V6, rated at 332 horsepower and 270 lb-ft of torque. Output is sent to the rear wheels via a 7-speed automatic transmission."
        ],
        "auction_equipment": [
            "Automatic bi-xenon headlights",
            "LED taillights",
            "Power-adjustable and heated side mirrors",
            "Leather and synthetic suede upholstery",
            "Power-adjustable and heated seats",
            "Push-button ignition",
            "Automatic climate control system",
            "AM/FM/MP3 radio with 6-disc in-dash CD changer",
            "Bose audio system with 6 speakers and 2 subwoofers",
            "Cruise control"
        ],
        "modifications": [
            "18-inch F1R wheels",
            "H&R lowering springs (factory springs included with the sale)",
            "Aftermarket mufflers",
            "Tinted windows"
        ],
        "known_flaws": [
            "Stone chips on front end and hood",
            "Visible touch-up paint on hood",
            "Some ceases on driver’s seat bolsters",
            "Some rust on underside components"
        ],
        "services": [
            "July 2021 (36,046 miles): Exhaust replaced",
            "April 2021: Wheel(s) repaired",
            "April 2021: Engine oil and filter changed",
            "April 2018 (28,077 miles): Battery replaced"
        ],
        "included_items": [
            "2 keys",
            "Owner's manuals",
            "Factory springs"
        ],
        "ownership_history": "The selling dealer acquired this 370Z in March 2022 and has added approximately 1,400 miles since.",
        "auction_stats": {
            "reserve_status": "Reserve",
            "auction_status": "Reserve not met, bid to",
            "highest_bid_value": "$16,000",
            "auction_date": "Apr 4, 2023 10:14 PM",
            "view_count": "5,780",
            "bid_count": "6",
            "bids": [
                "$16,000",
                "$15,678",
                "$11,200",
                "$11,100",
                "$11,000",
                "$10,000"
            ]
        }
    },
    "https://carsandbids.com/auctions/r4e7nqy9/2022-rivian-r1s-launch-edition": {
        "auction_title": "2022 Rivian R1S Launch Edition",
        "auction_subtitle": "Quad Electric Motors, Reinforced Underbody Shield, Glacier White",
        "auction_quick_facts": {
            "Make": "Rivian",
            "Model": "R1S\nSave",
            "Mileage": "1,700",
            "VIN": "7PDSGABL4NN002497",
            "Title Status": "Clean (TX)",
            "Location": "Prosper, TX 75078",
            "Seller": "Rivianite",
            "Engine": "Quad Electric Motors",
            "Drivetrain": "4WD/AWD",
            "Transmission": "Automatic",
            "Body Style": "SUV/Crossover",
            "Exterior Color": "Glacier White",
            "Interior Color": "Black Mountain",
            "Seller Type": "Private Party"
        },
        "dougs_take": "Rivian's R1S is my favorite electric SUV, as it boasts a usable amount of driving range, an interior that's both luxurious and spacious, and excellent off-road capabilities. This is the sold-out Launch Edition model that's finished in an elegant color called Glacier White (which works well with the black roof!), and it's fitted with the desirable reinforced underbody shield that provides extra peace of mind off the pavement. It also touts some cool features, like an air compressor integrated into the cargo area – and with 835 horsepower, this R1S is much quicker than its size and proportions suggest. This R1S also benefits from having less than 1,700 miles on the odometer, so here's your chance to pick up one of these impressive SUVs without the long wait!",
        "auction_highlights": [
            "The attached Carfax history report lists no accidents in this SUV's past.",
            "The window sticker pictured in the gallery notes that this R1S cost $79,750 new. Factory equipment includes 22-inch Sport Bright wheels, a compact spare tire, an air suspension system, a reinforced underbody shield, dark ash wood interior trim, heated, ventilated, and power-adjustable front seats, heated second-row seats, folding third-row seats, an air compressor integrated into the trunk, and a Rivian Elevation by Meridian sound system. The seller reports no modifications.",
            "The R1S entered production in 2022 as Rivian's second model. Closely related to the R1T pickup, it's an electric SUV with up to seven seats that was developed with the outdoors in mind. It's spacious, and it features a long list of comfort and technology features as well as through-the-road all-wheel drive.",
            "Power comes from four electric motors, which draw electricity from a 135-kilowatt-hour lithium-ion battery pack to zap the four wheels with 835 horsepower and 908 lb-ft of torque. The R1S earned a maximum driving range rating of 316 miles from the EPA."
        ],
        "auction_equipment": [
            "22-inch \"Sport Bright\" wheels",
            "Large battery pack",
            "Compact spare tire",
            "Air suspension system",
            "Reinforced underbody shield",
            "Dark ash wood interior trim",
            "Compass Yellow interior accents",
            "Vegan upholstery",
            "Heated, ventilated, and power-adjustable front seats",
            "Heated second-row seats",
            "Folding third-row seats",
            "Heated steering wheel",
            "Air compressor integrated into the trunk",
            "Removable Bluetooth-compatible speaker in the center console",
            "Rivian Elevation by Meridian sound system",
            "Adaptive cruise control",
            "Lane-keeping assist technology",
            "Lane departure warning system",
            "Kinetic roll control technology"
        ],
        "modifications": [],
        "known_flaws": [],
        "services": [],
        "included_items": [
            "1 key card, 1 key fob, and 1 wristband key",
            "Owner's manual",
            "Window sticker",
            "Service record"
        ],
        "ownership_history": "The seller purchased this R1S new in January 2023.",
        "auction_stats": {
            "reserve_status": "Reserve",
            "auction_status": "Sold to",
            "highest_bid_value": "$92,500",
            "auction_date": "Apr 4, 2023 10:06 PM",
            "view_count": "10,170",
            "bid_count": "12",
            "bids": [
                "$92,500",
                "$89,000",
                "$81,000",
                "$80,000",
                "$75,500",
                "$75,000",
                "$66,000",
                "$65,500",
                "$65,000",
                "$27,039",
                "$26,789",
                "$25,000"
            ]
        }
    },
    "https://carsandbids.com/auctions/98dDvYkv/2019-tesla-model-x-performance": {
        "auction_title": "2019 Tesla Model X Performance",
        "auction_subtitle": "Dual-Motor AWD, Ludicrous Mode, Full Self-Driving Capablity",
        "auction_quick_facts": {
            "Make": "Tesla",
            "Model": "Model X\nSave",
            "Mileage": "51,800",
            "VIN": "5YJXCAE47KF189662",
            "Title Status": "Clean (GA)",
            "Location": "Saint Simons Island, GA 31522",
            "Seller": "matthewcertain",
            "Engine": "Dual Electric Motors",
            "Drivetrain": "4WD/AWD",
            "Transmission": "Automatic",
            "Body Style": "SUV/Crossover",
            "Exterior Color": "Red Multi-Coat",
            "Interior Color": "Black/White",
            "Seller Type": "Private Party"
        },
        "dougs_take": "The Tesla Model X is an excellent electric family car, offering fantastic practicality, excellent technology, and a usable driving range – AND, in this case, insane acceleration. This particular Model X is a Performance version, which benefits from a tremendously powerful dual-motor setup, all-wheel drive, and a 270-mile EPA range. It also boasts some great factory equipment, including Tesla’s Full Self-Driving Capability, a 7-seat interior, and a set of handsome 22-inch wheels. This looks like a nice Model X, and I'm proud to offer it on Cars & Bids.",
        "auction_highlights": [
            "The attached Carfax history report shows that this Tesla has been registered in Georgia since 2020.",
            "Factory equipment includes the Raven upgrade, 22-inch Onyx Black wheels, Ludicrous Mode, Falcon Wing rear doors, a Premium Interior, carbon fiber interior trim, heated and power-adjustable front seats, 3-row seating, a 17-inch touchscreen for the infotainment system, Full Self-Driving capability (subscription required) and more as listed below. The sole modification reported by the seller is paint protection film.",
            "Tesla introduced the Model X for the 2016 model year as a taller and more spacious alternative to the Model S. It stood out from other crossovers with unusual double-hinged falcon doors. It has gone through several powertrain and software evolutions, and it's still available new today.",
            "Power comes from a pair of electric motors, which draw electricity from a 100-kilowatt-hour lithium-ion battery pack to zap the four wheels. In 2019. the EPA gave the Model X Performance a maximum driving range rating of 270 miles with 22-inch wheels."
        ],
        "auction_equipment": [
            "22-inch Onyx Black wheels",
            "Raven Upgrade (bigger front motor and adaptive air suspension system)",
            "Ludicrous Mode",
            "Falcon Wing rear doors",
            "Premium Interior",
            "Heated, power-adjustable front seats",
            "3-row seating",
            "Digital gauge cluster",
            "17-inch infotainment system",
            "Navigation system",
            "Full Self-Driving capability (subscription required)"
        ],
        "modifications": [
            "Paint protection film"
        ],
        "known_flaws": [
            "The attached Carfax report indicates that this Model X was involved in a rear-end collision with another vehicle and that \"minor damage\" occurred to the rear in August 2022. The report adds that the airbags didn't deploy. A photo showing the damage from the accident is provided in the Other section of the photo gallery.",
            "Chip in the lower front fascia",
            "Some chips on the wheels",
            "Some scuffs on interior plastics"
        ],
        "services": [
            "Summer 2022: High-voltage battery replaced under warranty",
            "2021: Half shafts replaced under warranty"
        ],
        "included_items": [
            "2 key fobs",
            "Owner's manual",
            "Charging cable",
            "Tow hitch"
        ],
        "ownership_history": "The seller purchased this Model X in July 2020 and has since added about 49,900 miles.",
        "auction_stats": {
            "reserve_status": "Reserve",
            "auction_status": "Sold to",
            "highest_bid_value": "$60,500",
            "auction_date": "Apr 4, 2023 9:50 PM",
            "view_count": "7,739",
            "bid_count": "33",
            "bids": [
                "$60,500",
                "$60,000",
                "$59,500",
                "$59,000",
                "$58,500",
                "$57,500",
                "$56,510",
                "$56,005",
                "$55,501",
                "$55,000",
                "$54,000",
                "$53,000",
                "$47,500",
                "$45,000",
                "$42,500",
                "$40,000",
                "$37,500",
                "$35,000",
                "$32,000",
                "$30,000",
                "$27,000",
                "$25,250",
                "$25,000",
                "$23,800",
                "$23,456",
                "$20,123",
                "$18,901",
                "$17,890",
                "$16,789",
                "$15,678",
                "$14,667",
                "$14,567",
                "$12,345"
            ]
        }
    },
    "https://carsandbids.com/auctions/3oQzR5Nm/2005-chevrolet-avalanche-1500-ls-4x4": {
        "auction_title": "2005 Chevrolet Avalanche 1500 LS 4x4",
        "auction_subtitle": "~33,200 Miles, V8 Power, 4WD, Mostly Unmodified",
        "auction_quick_facts": {
            "Make": "Chevrolet",
            "Model": "Avalanche\nSave",
            "Mileage": "33,200",
            "VIN": "3GNEK12Z15G196011",
            "Title Status": "Clean (FL)",
            "Location": "Orlando, FL 32809",
            "Seller": "mmgcars",
            "Engine": "5.3L V8",
            "Drivetrain": "4WD/AWD",
            "Transmission": "Automatic (4-Speed)",
            "Body Style": "Truck",
            "Exterior Color": "Dark Blue Metallic",
            "Interior Color": "Gray/Dark Charcoal",
            "Seller Type": "Dealer"
        },
        "dougs_take": "The Chevy Avalanche is a really cool truck that was desirable back when it came out – and it has become even more sought-after today, as nice Avalanche models are virtually impossible to find. As a result, this particular Avalanche is an amazing discovery, as it has just 33,200 miles – along with V8 power, 4-wheel drive, and the clever Midgate system between the interior and the truck bed. This Avalanche is also also mechanically unmodified for some added peace of mind, and it touts a clean, accident-free Carfax report, further adding to the appeal.",
        "auction_highlights": [
            "The odometer currently displays approximately 33,200 miles.",
            "The attached Carfax history report has a few gaps but shows no mileage discrepancies for the given time period. It also shows that it has been registered in Florida and Arizona since 2014.",
            "Factory equipment includes 16-inch alloy wheels, an Autotrac transfer case, a foldable midgate, a tonneau cover, bedside storage, automatic headlights, fog lights, a power sunroof, cloth upholstery, a power driver's seat, air conditioning, cruise control, and remote power door locks.",
            "Modifications reported by the selling dealer include a bull bar, aftermarket taillight covers, aftermarket exhaust tips, and a JVC head unit.",
            "The Avalanche was launched for the 2002 model year and filled the gap between GM trucks and SUVs. Built on the same GMT800 platform as the Suburban and Yukon XL, the Avalanche's plastic body cladding and short bed created a distinctive look. The Avalanche also featured the \"midgate\" cargo configuration, which allowed the rear seats to be folded and the passenger compartment fully opened to the bed, creating increased cargo capacity and an open-air experience. The Avalanche was produced for only two generations, and production ended after the 2013 model year.",
            "Power comes from a Vortec 5.3-liter V8 engine, rated at 295 horsepower and 330 lb-ft of torque. Output is sent to the rear or all four wheels via a 4-speed automatic transmission."
        ],
        "auction_equipment": [
            "16-inch alloy wheels",
            "Autotrac transfer case",
            "Foldable midgate",
            "Tonneau cover",
            "Bedside storage",
            "Automatic headlights",
            "Fog lights",
            "Power sunroof",
            "Cloth upholstery",
            "Power driver's seat",
            "Leather-wrapped steering wheel",
            "Air conditioning",
            "Power windows",
            "Remote power door locks",
            "Cruise control"
        ],
        "modifications": [
            "Aftermarket exhaust tips",
            "Bull bar",
            "Aftermarket taillight covers",
            "JVC head unit"
        ],
        "known_flaws": [
            "The attached Carfax report indicates that this Avalanche was involved in an accident with another vehicle in March 2012. No further information is available.",
            "Scratches and chips around the exterior",
            "Yellowing headlights",
            "Some fading on exterior body cladding",
            "Scratches on wheels",
            "2015 date codes on tires",
            "Some wear on interior plastics",
            "Some rust on underbody components",
            "Dent on the passenger-side exhaust tip"
        ],
        "services": [],
        "included_items": [
            "1 set of keys"
        ],
        "ownership_history": "The selling dealer acquired this Avalanche in February 2023 and has added minimal mileage since.",
        "auction_stats": {
            "reserve_status": "Reserve",
            "auction_status": "Sold to",
            "highest_bid_value": "$17,250",
            "auction_date": "Apr 4, 2023 9:43 PM",
            "view_count": "6,599",
            "bid_count": "23",
            "bids": [
                "$17,250",
                "$17,000",
                "$16,600",
                "$16,350",
                "$16,100",
                "$15,769",
                "$15,500",
                "$15,069",
                "$14,370",
                "$14,269",
                "$14,000",
                "$13,779",
                "$13,669",
                "$13,500",
                "$10,100",
                "$10,000",
                "$9,000",
                "$8,888",
                "$8,000",
                "$7,100",
                "$7,000",
                "$6,000",
                "$100"
            ]
        }
    },
    "https://carsandbids.com/auctions/KVVjaj76/2003-honda-civic-si-hatchback": {
        "auction_title": "2003 Honda Civic Si Hatchback",
        "auction_subtitle": "NO RESERVE 1 Owner Until 2022, 5-Speed Manual, Unmodified, Southern-Owned",
        "auction_quick_facts": {
            "Make": "Honda",
            "Model": "Civic\nSave",
            "Mileage": "100,100",
            "VIN": "SHHEP33543U400643",
            "Title Status": "Clean (LA)",
            "Location": "Metairie, LA 70001",
            "Seller": "Devonanno1",
            "Engine": "2.0L I4",
            "Drivetrain": "Front-wheel drive",
            "Transmission": "Manual (5-Speed)",
            "Body Style": "Hatchback",
            "Exterior Color": "Satin Silver Metallic",
            "Interior Color": "Black",
            "Seller Type": "Dealer"
        },
        "dougs_take": "The EP3 Honda Civic Si is among my very favorites, as it touts hatchback practicality, a manual transmission, and unique styling that's far different from the Civic of this era. In fact, if you wanted a Civic hatchback from this era, you had to go with an Si – it didn't come any other way. These cars had reasonably potent engines, boasting 160 horsepower in a small package – and this particular example is especially desirable, as it's a one-owner car from new. This EP3 hatch is also unmodified, and it comes equipped with front sport seats, a sunroof, rear spoiler, and 15-inch wheels. It's offered with a clean, accident-free Carfax report showing ownership in warm-climate Louisiana – AND it boasts the allure of no reserve, which always increases the appeal.",
        "auction_highlights": [
            "The attached Carfax history report shows no accidents or mileage discrepancies in this Civic’s past. It also shows that it's been registered in Louisiana since new and to one owner until 2022.",
            "According to the digital Monroney Label pictured in the photo gallery, this Civic had an original MSRP of $19,460 and came equipped with 15-inch alloy wheels, a power sunroof, cloth upholstery, front sport seats, air conditioning, cruise control, and more as detailed below. The selling dealer reports no modifications.",
            "The seventh-generation Civic was produced from 2000 to 2005 and sold in North America only as a coupe or sedan body style. The exception was the high-performance Si trim, which was offered only as a 3-door hatchback body featuring Honda's \"New Bullet-Form\" styling intended to provide greater aerodynamic efficiency and more stability.",
            "Power comes from a K20A3 2.0-liter twin-cam inline-4, rated at 160 horsepower and 132 lb-ft of torque. Output is sent to the front wheels via a 5-speed manual transmission."
        ],
        "auction_equipment": [
            "15-inch alloy wheels",
            "Rear spoiler",
            "Rear wiper",
            "Power sunroof",
            "Cloth upholstery",
            "Front sport seats",
            "Air conditioning",
            "Cruise control",
            "CD player",
            "Power windows and locks",
            "Remote entry"
        ],
        "modifications": [],
        "known_flaws": [
            "Some scratches and chips throughout",
            "Ding on passenger-side quarter panel",
            "Curb rash on wheels",
            "Creases and wear on front seat upholstery",
            "Scratches and wear on interior plastic trim and touch points"
        ],
        "services": [
            "November 2019 (96,736 miles): Idler pulley and air intake tube replaced",
            "August 2019 (95,246 miles): Starter replaced, engine oil and filter changed",
            "April 2019 (92,694 miles): Front struts and driver-side window run channel replaced",
            "December 2018 (91,521 miles): Front lower control arm bushings replaced, alignment performed",
            "December 2018 (91,498 miles): Battery replaced",
            "August 2018 (89,552 miles): Engine oil and filter changed, tires rotated"
        ],
        "included_items": [
            "2 keys and remote fobs",
            "Owner's manual",
            "Service records",
            "Spare tire",
            "Wheel locks and key"
        ],
        "ownership_history": "The selling dealer acquired this Civic in March 2023 and has added minimal miles since.",
        "auction_stats": {
            "reserve_status": "No reserve",
            "auction_status": "Sold to",
            "highest_bid_value": "$9,200",
            "auction_date": "Apr 4, 2023 9:40 PM",
            "view_count": "7,927",
            "bid_count": "24",
            "bids": [
                "$9,200",
                "$9,100",
                "$9,000",
                "$8,800",
                "$8,700",
                "$8,600",
                "$8,500",
                "$8,400",
                "$8,234",
                "$8,000",
                "$7,777",
                "$7,600",
                "$7,500",
                "$7,400",
                "$7,300",
                "$7,200",
                "$7,100",
                "$7,000",
                "$6,000",
                "$3,000",
                "$2,003",
                "$1,500",
                "$600",
                "$500"
            ]
        }
    },
    "https://carsandbids.com/auctions/3gQpd11b/1997-toyota-4runner-sr5-4x4": {
        "auction_title": "1997 Toyota 4Runner SR5 4x4",
        "auction_subtitle": "5-Speed Manual, 4WD, Extensive Off-Road Modifications, Southern- and Western-Owned",
        "auction_quick_facts": {
            "Make": "Toyota",
            "Model": "4Runner\nSave",
            "Mileage": "380,700",
            "VIN": "JT3HN86R9V0070343",
            "Title Status": "Clean (CA)",
            "Location": "Ramona, CA 92065",
            "Seller": "solan6af",
            "Engine": "3.4L V6",
            "Drivetrain": "4WD/AWD",
            "Transmission": "Manual (5-Speed)",
            "Body Style": "SUV/Crossover",
            "Exterior Color": "Desert Dune Metallic",
            "Interior Color": "Oak",
            "Seller Type": "Private Party"
        },
        "dougs_take": "The third-generation Toyota 4Runner is great SUV, boasting exceptional reliability and good off-road capabilities. This particular 4Runner touts the extremely desirable combination of a 5-speed manual, the 3.4-liter V6, and 4-wheel drive. It also features a LONG list of modifications intended to improve its off-road prowess, including 16-inch FN Five Star wheels with Falken WILDPEAK A/T tires, Bilstein shocks, an Envision Fabrication rear shock setup, a uniball conversion, a Smittybilt winch, Savage skid plates and rock sliders, a ShrockWorks rear bumper with swing-out tire carrier and dual jerry can mount, and a custom sleeping and storage platform. This 4Runner has traveled a lot of miles, but it also comes with an extensive service history showing that the engine was replaced about 80,000 miles ago, and it also benefits from warm-climate ownership in Texas, Oklahoma, and California since new – so it still has a lot of life left!",
        "auction_highlights": [
            "This 4Runner features the desirable 5-speed manual transmission.",
            "The attached Carfax history report shows no mileage discrepancies in this 4Runner’s past. It also shows that it's been registered in California, New Mexico, and Texas since new.",
            "Modifications to this 4Runner are extensive, and the full list is detailed below. Highlights include a 3.4-liter V6 sourced from a JDM Toyota, Koyorad aluminum radiator, a Black Widow Race Venom exhaust system, an LCE Performance Stage 2 clutch, a Hurst short shifter, a \"Big 3\" wiring upgrade, various exterior lights, 16-inch FN Five Star wheels with Falken WILDPEAK A/T AT3W tires, Bilstein shocks, an Envision Fabrication custom outboard rear shock setup, a uniball conversion, a Smittybilt 9.5K front winch, Savage skid plates and rock sliders, a ShrockWorks rear bumper with swing-out tire carrier and dual jerry can mount, and a custom sleeping and storage platform in the rear cargo area.",
            "A build sheet is provided in the photo gallery, and a partial list of notable equipment includes a 2-speed transfer case, cloth upholstery, air conditioning, and power windows (including rear window), side mirrors, and door locks.",
            "Launched for 1996, the third-generation Toyota 4Runner arrived as the popularity of SUVs ballooned across America. Utilizing the same V6 as the first-generation Tacoma and Tundra trucks, it shared its basic proportions with its predecessor but was slightly longer and all-new from the ground up.",
            "Power comes from a 3.4-liter V6 sourced from a JDM Toyota, rated at approximately 190 horsepower and 220 lb-ft of torque. Output is sent to the rear or all four wheels via a 5-speed manual transmission and a 2-speed transfer case."
        ],
        "auction_equipment": [
            "2-speed transfer case",
            "Clutch start cancel function",
            "Cloth upholstery",
            "Air conditioning",
            "Power windows (including rear window), side mirrors, and door locks"
        ],
        "modifications": [
            "3.4-liter V6 sourced from a JDM Toyota (the seller reports the engine had 60,000 miles on it at time of install)",
            "Snorkel with fully sealed pre-filter",
            "RAD Rubber Designs engine splash guards",
            "Airaid intake tube",
            "Koyorad aluminum radiator",
            "Spal 12-inch 1640 CFM auxiliary pusher fan",
            "Black Widow Race Venom exhaust with custom high-clearance tailpipe",
            "LCE Performance Stage 2 clutch",
            "Marlin Crawler braided steel clutch line",
            "Hurst short shifter",
            "Chilkat Designs manual rear differential locker linkage",
            "CVJ 9168 TR front axles",
            "Optima Group 31 battery",
            "CBI Offroad Fab battery tray",
            "GP heavy-duty battery terminals",
            "\"Big 3\" wiring upgrade (uprated current capacity from alternator positive to battery positive, battery negative to chassis, and engine ground to chassis)",
            "Cs144 alternator with connector",
            "LED headlight and reverse light bulbs",
            "Scarab Offroad Technologies hood light",
            "PIAA front and rear roof rack lights",
            "Element Offroad LED Amber Cannon pod lights",
            "Andranik ditch light brackets",
            "16-inch FN Five Star wheels",
            "Falken WILDPEAK A/T AT3W tires (size 285/75 R16)",
            "Full-size spare tire with matching wheel",
            "Spidertrax 1.25-inch hub-centric wheel spacers",
            "Toyota Tundra brake upgrade",
            "Akebono brake pads",
            "Bilstein 6112 front shocks for Toyota Tundra",
            "Bilstein 7100 rear shocks",
            "Eibach 700-pound front coils",
            "Old Man Emu rear 851 coils",
            "Envision Fabrication custom outboard rear shock setup",
            "Total Chaos Fabrication upper control arms and upper coil bucket tower gussets",
            "Whiteline lower control arm bushings",
            "Solo Motorsports boxed lower control arms",
            "Uniball conversion",
            "Rokmen adjustable upper links, lower links, and panhard bar",
            "FK Heim end links",
            "Toytec Lifts panhard drop bracket",
            "Energy Suspension body mounts",
            "Wheeler's Off-Road SuperBump bump stops",
            "Eimkeith lower control arm, strut tower, and upper link reinforcements",
            "McKenzie's limit straps with adjustable clevis",
            "Smittybilt 9.5K front winch",
            "ARB front bumper",
            "Savage rock sliders",
            "Mayhem Metal Works custom-fabricated fender bars",
            "ShrockWorks rear bumper with swing-out tire carrier and dual jerry can mount",
            "Outgear Solutions roof rack",
            "Savage full skid plate set",
            "Lil' Skip's Offroad gas tank skid plate",
            "BudBuilt differential skid plate",
            "Lotus rear link mount skid plate",
            "Chassis-mounted Viair 2.5-gallon on-board air tank",
            "Red Firestik with spring mount (coaxial wired to center console)",
            "CB radio antenna mount",
            "Side window rain guards",
            "Miscellaneous exterior decals",
            "Hurst shift lever and transfer case lever knobs",
            "Steering wheel from 1999 or later Toyota 4Runner",
            "Upgraded center console with cupholders",
            "Custom sleeping and storage platform",
            "Outbound Nevada limited-edition Molle panel",
            "Switch Pros lighting switch panel",
            "CB radio pre-wiring and mounting bracket",
            "LED interior lighting and gauge cluster/air conditioning panel backlighting",
            "Kill switch",
            "Kenwood head unit",
            "Front and rear dash cams with automatic recording capabilities"
        ],
        "known_flaws": [
            "Various scratches, chips, dings, and wear throughout (some pictured in the gallery)",
            "Curb rash on wheels",
            "Some wear on driver’s seat bolsters",
            "Scratches and wear on interior trim and touch points",
            "Pilling on headliner",
            "Discoloration and wear on interior carpeting",
            "Hole in driver's footwell carpeting (pictured in the gallery)",
            "Some rust on rock rails (pictured in the gallery)"
        ],
        "services": [
            "380,600 miles: Engine oil and filter changed",
            "February 2023 (380,480 miles): Fuel pump and steering rack replaced, clutch fluid flushed and bled",
            "August 2022 (380,085 miles): CV boots, rear axle seal, driver-side brake drum, brake shoes, and uniball replaced, brake fluid flushed, gear oil changed",
            "380,000 miles: Throttle body and MAF cleaned",
            "March 2022 (379,922 miles): Lower control arm replaced",
            "February 2022 (379,275 miles): Skid plate repaired",
            "377,000 miles: Air filter and accessory belts replaced",
            "October 2021 (375,471 miles): Driver-side rear axle shaft, cab mount, and front differential bushing replaced",
            "July 2021: Rear differential fluid flushed",
            "May 2021: Battery tray and manual differential lock cable installed",
            "April 2021: Rear shock mounts, axle housing, axle shaft bearing and seals replaced, gear oil changed",
            "370,370 miles: Front differential fluid flushed, front CV axles replaced",
            "March 2021 (368,587 miles): Engine oil and filter, brake, clutch, power steering, and differential fluids changed, EFI system, transfer case, and transmission serviced, alignment performed, valve cover gaskets, power steering outer CV boot, fuel filter, air filter, and inner tie rods replaced, rear brakes adjusted",
            "365,000 miles: Coolant flushed, power steering pump, hose, and filter, radiator hoses, coolant reservoir, clutch pedal, and front differential bushing replaced",
            "364,000 miles: Upper control arm bushings and uniballs replaced",
            "363,000 miles: Spark plugs, wires, and coils and u-joint replaced",
            "362,000 miles: LCE Performance Stage 2 clutch, Bilstein 7100 rear shocks, and Heim upper links installed, tires, clutch cylinders, clutch line, heater core valve, battery, throttle cable, and A/C switch replaced, A/C system recharged",
            "354,000 miles: PCV valve and grommet replaced",
            "353,000 miles: Rack and pinion bushings replaced",
            "348,000 miles: Thermostat replaced",
            "347,000 miles: Transmission mount replaced",
            "346,000 miles: Timing belt and alternator replaced",
            "341,000 miles: Koyorad aluminum radiator installed",
            "337,000 miles: Radiator cap and radiator fan clutch replaced",
            "332,000 miles: Driver-side spindle bearing, spindle gussets, and front springs replaced",
            "328,000 miles: Bilstein 6112 front shocks installed",
            "325,000 miles: Front brake pads replaced",
            "321,100 miles: Rack and pinion and outer tie rods replaced",
            "320,500 miles: Lower control arm bushings replaced",
            "316,600 miles: Fuel injectors replaced",
            "298,840 miles: Engine replaced",
            "October 2020 (363,263 miles): Engine oil and filter changed",
            "August 2020 (359,510 miles): Engine oil and filter changed",
            "June 2020 (356,635 miles): Engine oil and filter changed",
            "March 2020 (352,793 miles): Engine oil and filter changed",
            "December 2019 (349,294 miles): Engine oil and filter changed",
            "September 2019 (345,263 miles): Engine oil and filter changed",
            "June 2019 (340,189 miles): Engine oil and filter changed",
            "January 2019 (336,176 miles): Engine oil and filter changed",
            "October 2018 (332,922 miles): Engine oil and filter changed",
            "August 2018 (329,794 miles): Engine oil and filter changed",
            "July 2018 (326,442 miles): Engine oil and filter changed",
            "June 2018 (322,907 miles): Engine oil and filter changed",
            "April 2018 (319,770 miles): Engine oil and filter changed"
        ],
        "included_items": [
            "2 keys",
            "Owner's manuals",
            "Service records",
            "Husky Liners all-weather floor mats",
            "Front seat covers",
            "Driver's seat heat/massage pad",
            "Recovery traction boards",
            "Hi-Lift jack",
            "2 jerry cans",
            "Replacement shock absorber, oil filters, accessory belts, and CV joints",
            "New-in-box Koyorad aluminum radiator"
        ],
        "ownership_history": "The seller purchased this 4Runner in March 2021 and has added approximately 11,800 miles since. ",
        "auction_stats": {
            "reserve_status": "Reserve",
            "auction_status": "Reserve not met, bid to",
            "highest_bid_value": "$9,500",
            "auction_date": "Apr 4, 2023 9:38 PM",
            "view_count": "8,386",
            "bid_count": "22",
            "bids": [
                "$9,500",
                "$9,400",
                "$9,300",
                "$9,200",
                "$9,100",
                "$9,000",
                "$8,500",
                "$8,400",
                "$8,300",
                "$8,200",
                "$8,000",
                "$7,900",
                "$7,800",
                "$7,700",
                "$7,600",
                "$7,500",
                "$7,400",
                "$7,300",
                "$7,200",
                "$6,969",
                "$5,857",
                "$5,757"
            ]
        }
    },
    "https://carsandbids.com/auctions/rkxQVe4Q/2017-chevrolet-camaro-2lt-convertible": {
        "auction_title": "2017 Chevrolet Camaro 2LT Convertible",
        "auction_subtitle": "6-Speed Manual, 50th Anniversary Edition, Mostly Unmodified",
        "auction_quick_facts": {
            "Make": "Chevrolet",
            "Model": "Camaro\nSave",
            "Mileage": "30,600",
            "VIN": "1G1FC3DX7H0142845",
            "Title Status": "Clean (AZ)",
            "Location": "Chandler, AZ 85226",
            "Seller": "alstempe",
            "Engine": "2.0L Turbocharged I4",
            "Drivetrain": "Rear-wheel drive",
            "Transmission": "Manual (6-Speed)",
            "Body Style": "Convertible",
            "Exterior Color": "Nightfall Gray Metallic",
            "Interior Color": "Jet Black/Dark Gray",
            "Seller Type": "Dealer"
        },
        "dougs_take": "The sixth-generation Chevy Camaro is a fun sports car that touts a muscular design, a wide selection of powertrains, and better handling than you might expect. This particular example is a 50th Anniversary model, which features a Nightfall Gray Metallic exterior, beautiful 20-inch wheels, and other 50th Anniversary visual upgrades inside and out. It's also a convertible model that boasts a 6-speed manual transmission – a rare combination that makes the driving experience especially fun. Plus, this Camaro benefits from minimal modifications and a clean, accident-free Carfax report, for additional peace of mind.",
        "auction_highlights": [
            "This Camaro is a Canadian-spec model that was originally purchased in British Columbia, Canada. The Carfax report shows that the vehicle was imported and declared to meet U.S. highway safety specifications in December 2022, and it comes with an Arizona state title and an imperial instrument cluster.",
            "This Camaro is equipped with a 6-speed manual transmission, and the attached Carfax history report shows no accidents or mileage discrepancies in its past.",
            "Features on this Camaro include the 50th Anniversary Edition Package, heated and ventilated front seats, Apple CarPlay compatibility, a head-up display, a rearview camera, keyless entry, and a Bose sound system. The only modifications reported by the selling dealer are the deletion of the rear emblem and a tinted third brake light.",
            "Chevrolet launched the sixth and current generation of the Camaro for 2016. Built on the same basic platform as the Cadillac ATS, the pony car was smaller and much lighter than its predecessor to offer enthusiasts markedly better handling.",
            "Power comes from a 2.0-liter turbocharged inline-4, rated at 275 horsepower and 295 lb-ft of torque. Output is sent to the rear wheels via a 6-speed manual transmission."
        ],
        "auction_equipment": [
            "50th Anniversary Edition (20-inch 50th Anniversary wheels, 50th Anniversary exterior stripes, 50th Anniversary exterior and interior badges, RS Package, body-colored front splitter, orange front brake calipers, black leather upholstery with suede inserts and orange stitching)",
            "Power-folding soft top",
            "Leather-wrapped steering wheel",
            "Heated, ventilated, and power-adjustable front seats",
            "Dual-zone automatic climate control",
            "Apply CarPlay compatibility",
            "Head-up display",
            "Rearview camera",
            "Keyless entry",
            "Universal garage door opener",
            "Bose sound system"
        ],
        "modifications": [
            "Rear emblem deleted",
            "Tinted third brake light"
        ],
        "known_flaws": [
            "Scratches and crack on the front lip",
            "Scratches on the hood",
            "Scuffs on front passenger-side wheel",
            "Some creases on front seats",
            "Scratches on door sill plates"
        ],
        "services": [],
        "included_items": [
            "1 key",
            "Owner's manuals"
        ],
        "ownership_history": "The selling dealer acquired this Camaro in January 2023.",
        "auction_stats": {
            "reserve_status": "Reserve",
            "auction_status": "Sold to",
            "highest_bid_value": "$26,500",
            "auction_date": "Apr 4, 2023 9:22 PM",
            "view_count": "7,329",
            "bid_count": "43",
            "bids": [
                "$26,500",
                "$26,250",
                "$26,000",
                "$25,750",
                "$25,500",
                "$25,000",
                "$23,500",
                "$23,000",
                "$22,500",
                "$22,000",
                "$21,069",
                "$20,250",
                "$20,000",
                "$16,750",
                "$16,250",
                "$16,000",
                "$15,432",
                "$15,000",
                "$14,321",
                "$14,100",
                "$14,000",
                "$11,000",
                "$10,000",
                "$9,500",
                "$8,900",
                "$8,500",
                "$8,000",
                "$7,900",
                "$7,600",
                "$7,500",
                "$6,969",
                "$5,900",
                "$5,800",
                "$5,000",
                "$2,601",
                "$2,501",
                "$700",
                "$600",
                "$500",
                "$400",
                "$300",
                "$200",
                "$100"
            ]
        }
    },
    "https://carsandbids.com/auctions/30BB8w8G/2007-mercedes-benz-clk350-coupe": {
        "auction_title": "2007 Mercedes-Benz CLK350 Coupe",
        "auction_subtitle": "NO RESERVE ~47,200 Miles, Sport Appearance Package, Mostly Unmodified",
        "auction_quick_facts": {
            "Make": "Mercedes-Benz",
            "Model": "CLK350\nSave",
            "Mileage": "47,200",
            "VIN": "WDBTJ56H17F210374",
            "Title Status": "Clean (TX)",
            "Location": "McKinney, TX 75069",
            "Seller": "moes",
            "Engine": "3.5L V6",
            "Drivetrain": "Rear-wheel drive",
            "Transmission": "Automatic (7-Speed)",
            "Body Style": "Coupe",
            "Exterior Color": "Iridium Silver Metallic",
            "Interior Color": "Ash",
            "Seller Type": "Dealer ($175 Documentation Fee)"
        },
        "dougs_take": "The C209 Mercedes-Benz CLK is a fantastic coupe, and I consider it to be one of the most well-styled modern Mercedes-Benz models. This particular example is a CLK350 that's powered by a 3.5-liter V6, and it boasts relatively low mileage. This CLK also touts some desirable equipment including the Sport Appearance Package, a power sunroof, and Nappa leather upholstery – and it comes with no major modifications, which is a great benefit that adds to the appeal. Plus, this CLK is offered with no reserve, which should make for an exciting auction.",
        "auction_highlights": [
            "THIS… is a 2007 Mercedes-Benz CLK350 Coupe, finished in Iridium Silver Metallic with an Ash interior.",
            "The odometer currently displays about 47,200 miles.",
            "The attached Carfax history report shows no mileage discrepancies; it also shows that this CLK350 has been registered to two owners since new.",
            "According to the build sheet provided in the gallery, factory equipment includes the Sport Appearance Package, a power sunroof, leather upholstery, power-adjustable front seats, dual-zone automatic climate control, a CD changer, and cruise control. The only modification reported by the selling dealer is window tint.",
            "Mercedes-Benz introduced the second-generation CLK for the 2003 model year. It was based on the W203-generation C-Class, but its exterior styling brought it in line with the bigger E-Class. CLK sales ended after the 2009 model year, and the coupe and convertible variants were replaced by the two-door E-Class.",
            "Power comes from an M272 3.5-liter V6 engine, rated at 268 horsepower and 258 lb-ft of torque. Output is sent to the rear wheels via a 7-speed automatic transmission."
        ],
        "auction_equipment": [
            "Sport Appearance Package (17-inch aluminum-alloy wheels, lowered sport-tuned suspension, cross-drilled front brake rotors, rubber-studded stainless-steel pedals)",
            "Power sunroof",
            "Nappa leather upholstery",
            "Burl Walnut wood interior trim",
            "Power-adjustable front seats",
            "Multi-function steering wheel",
            "Dual-zone automatic climate control",
            "AM/FM stereo system",
            "CD changer",
            "Cruise control"
        ],
        "modifications": [
            "Tinted windows"
        ],
        "known_flaws": [
            "The attached Carfax report indicates that \"minor damage\" to this CLK was reported in October 2021. No additional information was provided.",
            "Cracked paint on the front bumper",
            "Scuffs under the front bumper",
            "Chips and scratches around the exterior (pictured in the gallery)",
            "Windshield is chipped",
            "Driver's side underbody splash shield is partially missing",
            "Chips and scratches on wheels",
            "2011 date codes on some tires",
            "Blemishes and wear on driver's seat",
            "Broken steering column adjustment lever",
            "The selling dealer reports an intermittent rattle noise is coming from a plastic piece on the rear passenger's side of the car at idle."
        ],
        "services": [
            "February 2022 (46,852 miles): Engine oil and filter changed, battery replaced",
            "November 2021: Battery/charging system checked",
            "July 2020 (45,599 miles): Maintenance inspection completed, recommended maintenance performed, engine/powertrain computer/module and interior trim checked"
        ],
        "included_items": [
            "2 keys, 1 remote",
            "Owner's manual",
            "Factory toolkit and first-aid kit",
            "Rubber floor mats"
        ],
        "ownership_history": "The selling dealer acquired this CLK in March 2023.",
        "auction_stats": {
            "reserve_status": "No reserve",
            "auction_status": "Sold to",
            "highest_bid_value": "$11,700",
            "auction_date": "Apr 4, 2023 9:15 PM",
            "view_count": "4,350",
            "bid_count": "28",
            "bids": [
                "$11,700",
                "$11,600",
                "$11,500",
                "$11,200",
                "$11,000",
                "$10,800",
                "$10,700",
                "$10,500",
                "$10,400",
                "$10,200",
                "$10,000",
                "$9,500",
                "$9,300",
                "$9,200",
                "$9,100",
                "$9,000",
                "$8,700",
                "$8,600",
                "$8,300",
                "$7,500",
                "$7,000",
                "$6,800",
                "$6,400",
                "$6,000",
                "$5,300",
                "$5,100",
                "$5,000",
                "$1,000"
            ]
        }
    },
    "https://carsandbids.com/auctions/rjZWpw8Y/2018-mercedes-benz-s560-4matic-coupe": {
        "auction_title": "2018 Mercedes-Benz S560 4Matic Coupe",
        "auction_subtitle": "~20,200 Miles, 463-hp Turbo V8, Premium and Sport Packages",
        "auction_quick_facts": {
            "Make": "Mercedes-Benz",
            "Model": "S560\nSave",
            "Mileage": "20,200",
            "VIN": "WDDXJ8GB4JA031836",
            "Title Status": "Clean (CA)",
            "Location": "San Marcos, CA 92078",
            "Seller": "Gabkam",
            "Engine": "4.0L Turbocharged V8",
            "Drivetrain": "4WD/AWD",
            "Transmission": "Automatic (9-Speed)",
            "Body Style": "Coupe",
            "Exterior Color": "Lunar Blue",
            "Interior Color": "Black",
            "Seller Type": "Private Party"
        },
        "dougs_take": "The Mercedes-Benz S560 Coupe is a smooth luxury grand tourer with gorgeous styling, a lovely interior with impressive technology, and great performance - thanks to a twin-turbo V8 with 463 horsepower. This particular S560 Coupe has traveled just 20,200 miles, and it’s finished in elegant Lunar Blue. It also boasts some great factory equipment, including the desirable Sport and Premium packages, along with a Burmester surround sound system. This S560 Coupe is also unmodified – and the attached Carfax report also shows ownership in dry-climate California, further adding to the appeal.",
        "auction_highlights": [
            "The odometer on this S560 currently displays approximately 20,200 miles.",
            "The attached Carfax history report shows no mileage discrepancies in this S560’s past. It also confirms that it's been registered in California since new.",
            "According to the window sticker provided in the gallery, factory equipment includes the Premium and Sport packages, 19-inch AMG twin 5-spoke wheels, Nappa leather upholstery, power-adjustable, heated, and ventilated front seats, a Burmester surround sound system, a Comand infotainment system, and more as detailed below. The seller reports no modifications.",
            "Mercedes-Benz brought a coupe to its S-Class lineup for the first time since the 1990s with the launch of the C217 for the 2015 model year. It was joined by a convertible version, known as A217, the following year. Both received a facelift for the 2018 model year that brought smaller, more powerful twin-turbocharged engines to the lineup. Mercedes-Benz discontinued the coupe and convertible versions of the S-Class after the 2021 model year.",
            "Power comes from an M176 twin-turbocharged 4.0-liter V8, rated at 463 horsepower and 516 lb-ft of torque. Output is sent to all four wheels via a 9-speed automatic transmission and Mercedes-Benz's 4MATIC permanent all-wheel-drive system."
        ],
        "auction_equipment": [
            "Premium Package (active multi-contour front seats with massage function, head-up display, Surround View camera system)",
            "Sport Package (AMG bumpers and side skirts, diamond radiator grille with chrome tips, stainless steel sport pedals with rubber studs)",
            "19-inch AMG twin 5-spoke wheels",
            "Airmatic air suspension",
            "LED Intelligent Light System",
            "Soft-close doors",
            "Electronic trunk closer",
            "Nappa leather upholstery",
            "Burl Walnut wood interior trim",
            "Power-adjustable, heated, and ventilated front seats",
            "Wood and leather-wrapped steering wheel",
            "Dual-zone automatic climate control",
            "Burmester surround sound system",
            "COMAND infotainment system",
            "Navigation system",
            "Apple CarPlay and Android Auto connectivity",
            "Inductive wireless charging",
            "Air Balance cabin fragrance system",
            "Illuminated door sills",
            "Ambient lighting",
            "Magic Vision Control windscreen wipers"
        ],
        "modifications": [],
        "known_flaws": [
            "Although the included Carfax report indicates no accidents in this S560’s past, the seller states that it was involved in an accident in August 2021 that resulted in damage to the driver-side front corner. Documentation detailing the repairs is included in the photo gallery.",
            "Scratches and chips as seen in gallery photos",
            "Detached fender liner on the passenger-side front wheel (pictured in the photo gallery)",
            "Curb rash on the driver-side front wheel",
            "2017 date codes on tires"
        ],
        "services": [
            "March 2023 (20,192 miles): 40,000-mile service performed, evaporator case drain hose serviced, engine oil and filter changed, brake fluid flushed/changed, cabin air filter replaced, antifreeze/coolant checked, fluids checked, brakes checked, drive belts checked, engine checked",
            "January 2022 (17,687 miles): 30,000-mile service performed, engine oil and filter changed, A/C water drain cleaned",
            "October 2020 (12,708 miles): 20,000-mile service performed, engine oil and filter changed, brake fluid flushed/changed, wiper blades replaced, engine closure plugs replaced under recall",
            "September 2019 (8,588 miles): 10,000-mile service performed, engine oil and filter changed, wiper blades replaced"
        ],
        "included_items": [
            "2 keys",
            "Owner's manuals",
            "Window sticker",
            "Spare tire"
        ],
        "ownership_history": "The seller is representing this S560 on behalf of the owner, who purchased the car new in October 2018.",
        "auction_stats": {
            "reserve_status": "Reserve",
            "auction_status": "Reserve not met, bid to",
            "highest_bid_value": "$61,500",
            "auction_date": "Apr 4, 2023 9:03 PM",
            "view_count": "9,522",
            "bid_count": "34",
            "bids": [
                "$61,500",
                "$60,666",
                "$60,000",
                "$59,500",
                "$59,000",
                "$58,500",
                "$58,000",
                "$57,500",
                "$57,000",
                "$56,500",
                "$56,000",
                "$55,500",
                "$55,000",
                "$54,000",
                "$53,500",
                "$53,000",
                "$52,500",
                "$52,000",
                "$51,500",
                "$51,000",
                "$50,500",
                "$49,999",
                "$45,000",
                "$42,500",
                "$42,000",
                "$30,000",
                "$28,000",
                "$26,000",
                "$25,000",
                "$21,500",
                "$20,550",
                "$20,300",
                "$20,000",
                "$12,345"
            ]
        }
    },
    "https://carsandbids.com/auctions/3LvOneJo/1996-nissan-skyline-gts-25t-type-m-coupe": {
        "auction_title": "1996 Nissan Skyline GTS-25T Type M Coupe",
        "auction_subtitle": "5-Speed Manual, RB25DET 6-Cylinder, Mostly Unmodified, U.S. Title",
        "auction_quick_facts": {
            "Make": "Nissan",
            "Model": "Skyline\nSave",
            "Mileage": "114,100",
            "VIN": "ECR33108643",
            "Title Status": "Clean (NC)",
            "Location": "Fletcher, NC 28732",
            "Seller": "patriciapinner1111",
            "Engine": "2.5L Turbocharged I6",
            "Drivetrain": "Rear-wheel drive",
            "Transmission": "Manual (5-Speed)",
            "Body Style": "Coupe",
            "Exterior Color": "Silver",
            "Interior Color": "Gray",
            "Seller Type": "Private Party"
        },
        "dougs_take": "We love the Nissan Skyline here on Cars & Bids, and I’m always happy to see another one listed here – I personally owned an R32, and I know first-hand how special these are! This particular example is an R33 Type M with the desirable 5-speed manual transmission and a potent RB25 6-cylinder under the hood. It’s also mostly unmodified, which is an incredibly rare find, and it touts a U.S. title, which means the difficult task of importing one from abroad has already been completed. These cars are truly exciting to drive, and I’m sure the next owner will enjoy the thrills this Skyline has to offer.",
        "auction_highlights": [
            "This Skyline is a right-hand drive, Japanese-spec coupe currently titled in North Carolina. Reportedly imported in January 2022, it's equipped with a metric instrument cluster, and its odometer displays approximately 183,700 kilometers, which represents about 114,100 miles.",
            "Factory equipment includes a Type M body kit, automatic climate control, a CD player, power-operated windows, mirrors, and locks, and more as listed below. Modifications reported by the seller are limited to 16-inch LISO wheels and an aftermarket turbo timer.",
            "The R33 Skyline was introduced in August 1993 and was available in coupe and sedan body configurations. It was slightly heavier than the R32 but was significantly safer than previous models, thanks to an airbag system and internal crash bars. The GTS-25T models were equipped with the larger \"RB25DET\" 6-cylinder and featured a limited-slip differential and the HICAS 4-wheel steering system. Production ended in 1998.",
            "Power comes from a 2.5-liter turbocharged inline-6 engine, rated at 247 horsepower and 216 lb-ft of torque. Output is sent to the rear wheels via a 5-speed manual transmission."
        ],
        "auction_equipment": [
            "Limited-slip differential",
            "HICAS 4-wheel steering system",
            "Type M body kit",
            "Fog lights",
            "Rear window wiper",
            "Cloth upholstery",
            "Automatic climate control",
            "CD player",
            "Power-operated windows, mirrors, and locks"
        ],
        "modifications": [
            "16-inch LISO wheels",
            "Aftermarket turbo timer"
        ],
        "known_flaws": [
            "Scratches and scuffs on bumpers",
            "Faded headlights",
            "Worn GTS25 t rear sticker",
            "Wear on the wheel center caps",
            "Worn shift knob"
        ],
        "services": [
            "December 2022: Engine oil and filter changed",
            "June 2022: Engine oil and filter changed"
        ],
        "included_items": [
            "2 keys",
            "Owner's manual",
            "Fire extinguisher",
            "Spare tire"
        ],
        "ownership_history": "The seller purchased this Skyline in April 2022 and has added approximately 1,100 miles since.",
        "auction_stats": {
            "reserve_status": "Reserve",
            "auction_status": "Sold to",
            "highest_bid_value": "$23,500",
            "auction_date": "Apr 4, 2023 8:54 PM",
            "view_count": "8,303",
            "bid_count": "14",
            "bids": [
                "$23,500",
                "$21,555",
                "$18,555",
                "$17,555",
                "$16,555",
                "$15,555",
                "$14,500",
                "$13,500",
                "$12,500",
                "$8,888",
                "$7,777",
                "$5,000",
                "$2,000",
                "$1,111"
            ]
        }
    },
    "https://carsandbids.com/auctions/KV1AxL1Y/2002-toyota-tacoma-sr5-xtracab-4x4": {
        "auction_title": "2002 Toyota Tacoma SR5 Xtracab 4x4",
        "auction_subtitle": "NO RESERVE 5-Speed Manual, V6 Power, 4WD, TRD Off-Road Package, Extensive Recent Service",
        "auction_quick_facts": {
            "Make": "Toyota",
            "Model": "Tacoma\nSave",
            "Mileage": "224,200",
            "VIN": "5TEWN72N92Z022241",
            "Title Status": "Clean (CO)",
            "Location": "Blanca, CO 81123",
            "Seller": "02Tacoma",
            "Engine": "3.4L V6",
            "Drivetrain": "4WD/AWD",
            "Transmission": "Manual (5-Speed)",
            "Body Style": "Truck",
            "Exterior Color": "Lunar Mist Metallic",
            "Interior Color": "Charcoal",
            "Seller Type": "Private Party"
        },
        "dougs_take": "The first-generation Toyota Tacoma is a fantastic truck with legendary reliability, excellent capabilities, and great sizing. This particular example is especially desirable, as it boasts the 3.4-liter V6, 4-wheel drive, AND a 5-speed manual transmission. It also features some desirable factory equipment, including the SR5, TRD Off-Road, and Limited packages – and it benefits from having no mechanical modifications. This Tacoma also reportedly touts some extensive recent servicing to add peace of mind – and it boasts a clean, accident-free Carfax report, which always increases the appeal. It's also offered with the thrill of no reserve, which further enhances the excitement.",
        "auction_highlights": [
            "This Tacoma features the desirable 5-speed manual transmission.",
            "The attached Carfax history report shows no accidents or mileage discrepancies in this Tacoma’s past.",
            "According to the Monroney Label provided in the gallery, factory equipment includes the Color-Keyed SR5, TRD Off-Road, and Limited packages, fold-down rear jump seats, air conditioning, cruise control, and more as detailed below.",
            "Modifications reported by the seller include 16-inch alloy wheels with Big O Big Foot A/T tires, a bed tie-down system, tinted windows, a Kenwood head unit with Bluetooth compatibility, an aftermarket sound system, and an aftermarket alarm and keyless entry system.  ",
            "Service documentation and parts receipts in the gallery indicate that the front suspension and axles, timing belt, and clutch have been replaced under the seller's ownership, among other services performed.",
            "Toyota split its global pickup range into two model lines when it released the original Tacoma in 1995. Developed for and built in America, it was a more leisure-oriented model than the work-focused Hilux that soldiered on overseas. The line-up included 2- and 4-wheel-drive models plus a regular or an extended cab. Production ended in 2005.",
            "Power comes from a 3.4-liter V6, rated at 190 horsepower and 220 lb-ft of torque. Output is sent to the rear or all four wheels via a 5-speed manual transmission and a 2-speed transfer case."
        ],
        "auction_equipment": [
            "Color-Keyed SR5 Package (color-keyed front bumper, grille surround, fender flares, and door handles, sun visors, white-faced gauges, digital clock, tilt steering wheel, variable intermittent windshield wipers)",
            "TRD Off-Road Package (off-road suspension with Bilstein shocks, locking rear differential)",
            "Limited Package (power-adjustable side mirrors, sliding rear window with privacy glass, power windows and door locks, leather-trimmed steering wheel and shift knob, cloth upholstery, sport seats)",
            "2-speed transfer case",
            "Mud flaps",
            "Pop-open rear side windows",
            "Fold-down rear jump seats",
            "Air conditioning",
            "Cruise control"
        ],
        "modifications": [
            "16-inch alloy wheels",
            "Big O Big Foot A/T tires (size LT 265/75 R16)",
            "Wiring for fog and driving lights",
            "Bed tie-down system",
            "Side badges and decals removed",
            "Tinted windows",
            "Upgraded metal hinge for rear side windows",
            "Aftermarket steering wheel cover",
            "Kenwood head unit with Bluetooth compatibility",
            "Sony XM-504X amplifier",
            "Clarion amplifier",
            "Aftermarket speakers and subwoofers",
            "Aftermarket alarm and keyless entry system"
        ],
        "known_flaws": [
            "Various scratches, chips, and dings as seen in gallery photos",
            "Visible residue from removed Toyota Tacoma stickers on doors (pictured in the photo gallery)",
            "Some wear on the wheel finish",
            "Creases and wear on front seat bolsters",
            "Some scratches and wear on interior plastic trim and touchpoints",
            "Stains and discoloration on interior carpeting and floor mats",
            "The seller notes that one subwoofer is not functional",
            "Power steering fluid leaking",
            "Some rust on the rear bumper and undercarriage components (pictured in the photo gallery)"
        ],
        "services": [
            "March 2023 (~224,000 miles): Front CV axles, front wheel bearings, front struts, front upper and lower control arms, front upper and lower ball joints, tie rod end, and engine air filter replaced",
            "February 2022 (~218,500 miles): Timing, alternator, A/C, and power steering belts, idler and tensioner rollers, front crankshaft and camshaft seals, water pump, hydraulic tensioner, thermostat, harmonic balancer pulley bolt, and throttle sensor replaced, coolant flushed",
            "January 2022: Windshield replaced",
            "September 2019 (205,000 miles): Clutch, pressure plate, pilot/release bearing, and transmission mount replaced"
        ],
        "included_items": [
            "2 keys",
            "Owner's manuals",
            "Service records",
            "Remote alarm/keyless entry fobs",
            "Front brake kit"
        ],
        "ownership_history": "The seller purchased this Tacoma in July 2019 and has added approximately 39,200 miles since. ",
        "auction_stats": {
            "reserve_status": "No reserve",
            "auction_status": "Sold to",
            "highest_bid_value": "$10,000",
            "auction_date": "Apr 4, 2023 8:48 PM",
            "view_count": "10,409",
            "bid_count": "21",
            "bids": [
                "$10,000",
                "$9,900",
                "$9,800",
                "$9,700",
                "$9,600",
                "$9,500",
                "$9,369",
                "$9,269",
                "$9,123",
                "$8,900",
                "$8,750",
                "$8,600",
                "$8,500",
                "$8,200",
                "$8,000",
                "$3,500",
                "$3,300",
                "$3,000",
                "$2,500",
                "$2,200",
                "$2,000"
            ]
        }
    },
    "https://carsandbids.com/auctions/rx1dbq09/2007-aston-martin-v8-vantage-roadster": {
        "auction_title": "2007 Aston Martin V8 Vantage Roadster",
        "auction_subtitle": "6-Speed Manual, ~20,500 Miles, 380-hp V8, Merlot Red, Unmodified",
        "auction_quick_facts": {
            "Make": "Aston Martin",
            "Model": "V8 Vantage\nSave",
            "Mileage": "20,500",
            "VIN": "SCFBB04B67GD06608",
            "Title Status": "Clean (AZ)",
            "Location": "Tucson, AZ 85718",
            "Seller": "Tucson1Mike",
            "Engine": "4.3L V8",
            "Drivetrain": "Rear-wheel drive",
            "Transmission": "Manual (6-Speed)",
            "Body Style": "Convertible",
            "Exterior Color": "Merlot Red",
            "Interior Color": "Iron Ore Red/Sandstorm",
            "Seller Type": "Private Party"
        },
        "dougs_take": "The Aston Martin V8 Vantage is an excellent entry point into exotic-car ownership, and this example has a lot going for it. It's finished in a color combination that's absolutely gorgeous, it's unmodified, it boasts low mileage, and it touts a clean, accident-free Carfax report for added peace of mind. Best of all, though, this V8 Vantage pairs a convertible body style with a 6-speed manual transmission – which is a hard combination to find, as most convertibles had an automatic. These V8 Vantage models are still beautiful – and with 380 horsepower from a 4.3-liter V8, this Roadster should be reasonably quick, even by modern standards.",
        "auction_highlights": [
            "This V8 Vantage's odometer displays about 20,500 miles.",
            "This Aston Martin comes equipped with the desirable 6-speed manual transmission.",
            "The attached Carfax history report lists no accidents or mileage inconsistencies in this Vantage's past.",
            "Factory equipment includes 19-inch wheels, a limited-slip differential, a power-operated soft top, Graphite interior trim, power-adjustable front seats, a wind deflector, a 700-watt sound system, and rear parking sensors, according to a window sticker shown in the gallery. The seller reports no modifications.",
            "Styled under the guidance of Henrik Fisker, the Vantage made its debut during the 2006 model year. It had a tall order to fill: make the British brand accessible to a wider target audience by luring enthusiasts out of Porsche showrooms. It succeeded thanks largely to its powerful V8 engine and its surprisingly well-tuned chassis. Production ended in 2017, though its V12-powered sibling lived on until 2018.",
            "Power comes from a 4.3-liter V8, rated at 380 horsepower and 302 lb-ft of torque. It spins the rear wheels via a 6-speed manual transmission."
        ],
        "auction_equipment": [
            "19-inch wheels",
            "Limited-slip differential",
            "Red brake calipers",
            "Xenon HID headlights",
            "Bright finish on the grille",
            "Power-operated soft top",
            "Graphite interior trim",
            "Leather upholstery",
            "Power-adjustable front seats",
            "3-position memory function",
            "Power-folding door mirrors",
            "Wind deflector",
            "6-disc CD changer",
            "700-watt premium sound system",
            "Navigation system",
            "Cruise control",
            "Rear parking sensors"
        ],
        "modifications": [],
        "known_flaws": [
            "Some chips on the front end",
            "Flex in lower left area of the front bumper; crack in plastic front lip (pictured in the gallery)",
            "2016 date code on the tires",
            "Some wear on the outer seat bolsters"
        ],
        "services": [],
        "included_items": [
            "2 sets of keys",
            "Owner's manual",
            "Discs for the navigation system",
            "Battery charger",
            "Car cover"
        ],
        "ownership_history": "The seller states that he purchased this Vantage in 2018.",
        "auction_stats": {
            "reserve_status": "Reserve",
            "auction_status": "Sold to",
            "highest_bid_value": "$47,250",
            "auction_date": "Apr 4, 2023 8:42 PM",
            "view_count": "15,820",
            "bid_count": "53",
            "bids": [
                "$47,250",
                "$47,000",
                "$46,500",
                "$46,000",
                "$45,250",
                "$45,000",
                "$44,750",
                "$44,500",
                "$44,250",
                "$44,000",
                "$43,750",
                "$43,500",
                "$43,250",
                "$43,000",
                "$42,250",
                "$42,000",
                "$41,250",
                "$41,000",
                "$40,250",
                "$40,000",
                "$39,500",
                "$39,250",
                "$39,000",
                "$38,500",
                "$38,250",
                "$38,000",
                "$37,000",
                "$35,500",
                "$35,000",
                "$34,000",
                "$33,750",
                "$33,250",
                "$33,000",
                "$32,500",
                "$32,000",
                "$27,000",
                "$26,000",
                "$25,000",
                "$22,000",
                "$20,000",
                "$19,500",
                "$19,000",
                "$18,500",
                "$16,500",
                "$16,000",
                "$15,000",
                "$12,000",
                "$6,000",
                "$4,000",
                "$2,600",
                "$2,500",
                "$1,000",
                "$500"
            ]
        }
    },
    "https://carsandbids.com/auctions/3R6qmgON/2017-subaru-wrx-sti-limited": {
        "auction_title": "2017 Subaru WRX STI Limited",
        "auction_subtitle": "6-Speed Manual, AWD, Highly Equipped, Extensive Modifications",
        "auction_quick_facts": {
            "Make": "Subaru",
            "Model": "WRX STI\nSave",
            "Mileage": "36,300",
            "VIN": "JF1VA2Y68H9801585",
            "Title Status": "Clean (NY)",
            "Location": "Corona, NY 11368",
            "Seller": "cespinosa21",
            "Engine": "2.5L Turbocharged Flat-4",
            "Drivetrain": "4WD/AWD",
            "Transmission": "Manual (6-Speed)",
            "Body Style": "Sedan",
            "Exterior Color": "Crystal White Pearl",
            "Interior Color": "Carbon Black/Red",
            "Seller Type": "Private Party"
        },
        "dougs_take": "The VA Subaru WRX STI is the last of its kind, as Subaru confirmed they won't be making another STI. That's a shame, because these are amazing cars – benefitting from a potent turbocharged flat-4 paired with a 6-speed manual transmission and all-wheel drive — and this one comes equipped with the Active Torque Vectoring system, heated Performance-design seats, and the obligatory rear wing. This STI also boasts a number of performance modifications, such as an ECU tune, various Cobb upgrades, and upgraded brakes. It also touts a clean, accident-free Carfax report, adding even more peace of mind. Kudos to the seller for adding a thorough photo gallery, too – which enhances this STI's appeal even more.",
        "auction_highlights": [
            "The attached Carfax history report lists no accidents in this Subaru's past.",
            "Factory equipment includes 18-inch wheels, Brembo brakes, a Driver Controlled Center Differential, LED headlights, a trunk spoiler, a sunroof, heated Performance-Design front seats, a power-adjustable driver's seat, a 7-inch touchscreen for the infotainment system, and a 9-speaker Harman Kardon sound system.",
            "Modifications to this STI are extensive, and the full list is detailed below. Highlights include a Stage3Motorsports tune, a Cobb flex fuel kit and Accessport V3 ECU tuner, Stoptech rotors, and aerodynamic accessories.",
            "Launched for 2015, the VA-generation WRX and WRX STI were split from the Impreza that they were based on. They became standalone models, not merely sporty evolutions of a compact car, and their new identity was accompanied by a more muscular-looking design plus the assortment of engine and chassis tweaks fans expected. Production ended in 2021, and Subaru confirmed the STI won't return.",
            "Power comes from a 2.5-liter turbocharged flat-4, rated at 305 horsepower and 290 lb-ft of torque when left stock. The modifications increase those figures to 315 and 358, respectively, at the wheels, according to a dyno sheet shown in the gallery. The engine spins the four wheels via a 6-speed manual transmission."
        ],
        "auction_equipment": [
            "18-inch wheels",
            "STI-specific suspension system",
            "Brembo braking system",
            "Driver-Controlled Center Differential (DCCD)",
            "Active Torque Vectoring system",
            "STI-specific body kit",
            "Fog lights",
            "Rear spoiler",
            "Leather upholstery",
            "Heated Performance-design front seats",
            "60/40-split folding rear seats",
            "Heated and power-adjustable door mirrors",
            "Aluminum-alloy pedal covers",
            "7.0-inch touchscreen for the Starlink infotainment system",
            "Harman Kardon sound system"
        ],
        "modifications": [
            "AEM fuel pump",
            "Injector Dynamics ID1050x fuel injectors",
            "Cobb fuel regulator, bypass valve, Accessport V3, and E85 flex fuel kit",
            "Nameless Performance muffler delete",
            "Stage3Motorsports tune",
            "IAG air/oil separator",
            "Perrin fender shroud, oil filler cap, cold air intake, and alternator cover",
            "Stoptech slotted rotors",
            "Brembo brake pads",
            "Body-color rear diffuser lip, side skirts, and front lip",
            "OLM rear window visor, full-width roof vortex generator, and fog lamp bulbs",
            "Wing lip spoiler",
            "Perrin wing stabilizers",
            "STI carbon fiber emblems",
            "Flex fuel emblem",
            "LED reverse lights",
            "Vland headlights",
            "Subispeed sequential taillights",
            "Automatic remote starting system",
            "Cobb shift knob",
            "Music sync color-changing LED lights"
        ],
        "known_flaws": [
            "Rock chips and scratch on front bumper (pictured in the gallery)",
            "Scuff and dent on rear bumper",
            "Dent on roof",
            "Peeling on rear window tint",
            "Curb rash on wheel surfaces"
        ],
        "services": [
            "November 2020 (17,429 miles): Maintenance inspection performed, oil and filter changed, tires rotated",
            "March 2019 (30,760 miles): Oil and filter changed",
            "January 2019 (14,975 miles): Oil and filter changed",
            "October 2018 (11,781 miles): Oil and filter changed",
            "July 2018 (8,206 miles): Oil and filter changed, tires rotated"
        ],
        "included_items": [
            "2 keys and remote start fobs",
            "Owner's manual",
            "Some aftermarket parts receipts",
            "Dyno sheet",
            "Factory fuel system components"
        ],
        "ownership_history": "The seller purchased this WRX STI in May 2020 and has added approximately 9,300 miles since.",
        "auction_stats": {
            "reserve_status": "Reserve",
            "auction_status": "Sold to",
            "highest_bid_value": "$29,500",
            "auction_date": "Apr 4, 2023 8:32 PM",
            "view_count": "12,110",
            "bid_count": "48",
            "bids": [
                "$29,500",
                "$29,250",
                "$29,000",
                "$28,750",
                "$28,500",
                "$28,250",
                "$28,000",
                "$27,750",
                "$27,500",
                "$27,250",
                "$27,000",
                "$26,750",
                "$26,500",
                "$26,250",
                "$26,000",
                "$25,750",
                "$25,500",
                "$25,250",
                "$25,000",
                "$24,000",
                "$23,750",
                "$23,500",
                "$22,750",
                "$22,500",
                "$22,250",
                "$22,000",
                "$21,750",
                "$21,500",
                "$21,000",
                "$20,000",
                "$19,000",
                "$18,500",
                "$18,000",
                "$17,500",
                "$17,250",
                "$17,000",
                "$16,750",
                "$16,500",
                "$16,000",
                "$15,000",
                "$14,500",
                "$14,000",
                "$12,500",
                "$12,000",
                "$7,044",
                "$5,000",
                "$4,000",
                "$944"
            ]
        }
    }
}